[
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "14 Pews",
    "Discipline": "Film",
    "AwardAmount": "$9,166.00",
    "FacebookURL": "facebook.com/14-Pews",
    "InstagramURL": "instagram.com/14pews",
    "WebsiteURL": "www.14pews.com",
    "Summary": "14 Pews is a multidisciplinary nonprofit, which is passionate about engaging and challenging our audiences through the visual arts, film and theater, while promoting artists who are female and people of color. In 2023, we plan to host over 100 films, through our weekly film screenings and our one film festival in the fall."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "4th Wall Theatre Company",
    "Discipline": "Theater",
    "AwardAmount": "$39,893.00",
    "FacebookURL": "facebook.com/4thwallhouston",
    "InstagramURL": "instagram.com/4thwallhouston",
    "WebsiteURL": "www.4thwalltheatreco.com",
    "Summary": "4th Wall Theatre Company seeks support for its 12th anniversary season, which includes four Houston Premiere plays and the third offering of \"Summer Shakes\" - a six-week educational Shakespeare program for high school students co-taught by 4th Wall's Artistic Director and current Juilliard students. 16 public performances of each main-season play will be offered in our 106-seat theatre at Spring Street Studios."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Adam Castaneda",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/adamluis_houston",
    "WebsiteURL": "",
    "Summary": "Reviving Churches\" is a multidisciplinary, community-based activation that addresses the broken windows theory in a holistic, creative manner. Local choreographer Adam Castaneda will activate an abandoned Church's Chicken location in the Near Northside neighborhood at 2700 Fulton Street in partnership with the Greater Northside Management District. Over the course of three weeks, this abandoned complex will be transformed into a vibrant public art installation that will culminate in a community gathering that consists of student essay readings, dance performances, live music, and temporary art."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Adam Castaneda",
    "Discipline": "Dance",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/adam.castaneda.109",
    "InstagramURL": "instagram.com/adamluis_houston",
    "WebsiteURL": "",
    "Summary": "A Migration Through Northside\" is an original dance work that will be performed November 4, 2023 in conjunction with the Northside Management District's Tour de Northside bike tour. The work will be presented in two locations on the tour: the Butterfly Pocket Park and the Hernandez Tunnel. The dance will be created from narratives from Near Northside community members and draw inspiration from the movement of the monarch butterfly, and explore the monarch's migration as a metaphor of the generational travel between the United States and Mexico."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Adam Taylor",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/adam_taylor_director",
    "WebsiteURL": "www.adamtaylordirector.com",
    "Summary": "The Word is a short film about the billionaire class deciding to give reparations to the African American community...but there's one small catch. The one percenters want the linguistic rights to use \"the word\" in public. We believe that through comedy, this film will spur dialog about a complicated and charged subject.  Our entire cast and crew will be comprised of talented Houstonians of multiple ethnicities,  and our production will be shot within Houston city limits."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Addison Freeman",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/amandinapascali",
    "InstagramURL": "",
    "WebsiteURL": "amandapascali.com/immigrantamericanfolkproject",
    "Summary": "The Immigrant American Folk Project is a collaborative storytelling initiative to uplift the voices of Houston's immigrant community through music. This nine-month-long project brings together eight artists of different nationalities in America's most diverse city, Houston, to share their stories and experiences through a collection of songs to be released in December 2023. Over the course of the project, educational outreach will be conducted in local elementary schools and public performances will be held at La Coqueta dance studio and the Heights Theater. Through art, this project aims to retire the outdated archetype of what it means to be \"American."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "AFA American Festival for the Arts",
    "Discipline": "Music",
    "AwardAmount": "$111,250.00",
    "FacebookURL": "facebook.com/afatexas",
    "InstagramURL": "instagram.com/afatexas",
    "WebsiteURL": "www.afatexas.org",
    "Summary": "As Houston's largest nonprofit provider of music education programs for young people, AFA enriches the lives of thousands of students of all backgrounds and skill levels through music each year. AFA's unique and impactful programs culminate in more than 50 recitals and concerts (historically 75+ pre-pandemic) presented free of charge and open to the Greater Houston community in venues across the city."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Alberto Godoy Carratala",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/AlbertoGodoy",
    "InstagramURL": "instagram.com/albertogodoyart",
    "WebsiteURL": "albertogodoy.com",
    "Summary": "The project will be an art exhibition that will take place at Silver Street Studios on February 15th through March 15th, 6:00 PM to 9:00 PM. I will have paintings and bronze sculptures on display."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Alexandra Lechin",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Alyssa Rachelle Savannah",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Andre Sam Sin",
    "Discipline": "Multimedia",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/DJSUN.plays.VINYL",
    "InstagramURL": "instagram.com/djsun/?hl=en",
    "WebsiteURL": "https://www.djsunmusic.com/",
    "Summary": "On July 23rd 2022, Loveletter premiered at the Moores Opera House at the University of Houston. Loveletter is a multi-faceted performance featuring a 10-member orchestra conducted by HSPVA alum Marlon Chen, Houston Poet Laureate Outspoken Bean, Houston rapper Fat Tony, vocalists SAM/Sin and Krystal Hardwick, Chris Dave of Drumhedz, and Tim Ruiz former bassist for La Mafia. These musicians and a documentary filmcrew came together to perform and capture a cover of DJ Sun's Album Loveletter which is considered an ode to Houston from one of Houston's most recognized recording artists and will be performed next year."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "Andrew Davis",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Andrew Davis",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Andrew Roblyer",
    "Discipline": "Theater",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "www.andrewroblyer.com",
    "Summary": "This would be the first major production of The Honeycomb Trilogy by Mac Rogers outside of New York City, presented \"in rep,\" making it possible to binge-watch this science-fiction trilogy of plays just like Stranger Things, Doctor Who, or the MCU. A well-known trilogy of scripts in the theatre world, this would be only the second time that the plays have ever been produced together, which will draw audiences from around the country to Houston for this epic event, to be produced in the spring/summer of 2023, at the MATCH, Matchbox 1."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Anthony Bob",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/linos007",
    "InstagramURL": "instagram.com/_mysound_",
    "WebsiteURL": "",
    "Summary": "Anthony will compose an original piece of music to accompany the four-part arrangement by Claude Debussy entitled \"Children's Corner.\" This work sets the tone of a dreamlike sequence that narrates memories of his childhood in Houston's Fifth Ward. This artistic pursuit will reconstruct memories that are characteristically rewritten in dreams, floating between real imagery in the form of a projected and displayed photo-based installation and synthetic memory in the form of music. The curated images will conjure evocative and fleeting thoughts and will be projected, taking place at Houston Museum of African American Culture (HMAAC) on January 12 at 6pm."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Anthony Brandt",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/anthony.brandt",
    "InstagramURL": "",
    "WebsiteURL": "www.anthonybrandt.net",
    "Summary": "Meeting of Minds\" is a work for two dancers and string quartet, in collaboration with NobleMotion Dance and the University of Houston's Brain Center.  The two dancers will wear portable EEG caps monitoring their brainwaves during the rehearsals and performances.  The new dance will be premiered at the MATCH as part of NobleMotion's 15th Anniversary season in the fall of 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "APERIO Music of the Americas",
    "Discipline": "Music",
    "AwardAmount": "$13,003.00",
    "FacebookURL": "facebook.com/aperiomusicoftheamericas/",
    "InstagramURL": "instagram.com/aperioamericas",
    "WebsiteURL": "www.aperioamericas.org",
    "Summary": "Aperio will present a series of free and ticketed concerts to Houston audiences in 2023 featuring vibrant works by contemporary composers from South and North America. Programs will showcase diverse performing forces in ensembles that range from intimate chamber music to full orchestra. Aperio's concerts and community events will be presented in the heart of Houston's cultural district with outreach to surrounding areas, including access to free streaming content."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Apollo Chamber Players",
    "Discipline": "Performing Arts",
    "AwardAmount": "$42,745.00",
    "FacebookURL": "facebook.com/apollochamberplayers",
    "InstagramURL": "instagram.com/apollochamberplayers",
    "WebsiteURL": "www.apollochamberplayers.org",
    "Summary": "Apollo Chamber Players (Apollo) proposes a 15th Anniversary season of multicultural, multidisciplinary arts programming that promises to captivate audiences and enrich their cultural understanding while strengthening the vibrancy of Houston's arts ecosystem and economy. Apollo will commission 13 new music works and collaborate with 35 locally/nationally-renowned artists of gender and ethnic diversity."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Archaeology Now",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Arie Bouman",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "In Good Company\" is a series of three, long-form, online interviews/conversations/dialogues with Houston visual artists. Using the format of a long-form television interview program, IGC allows the time and space for deeper investigation than a standard online artist talk of the type that are ubiquitous since the start of the pandemic. Zoom, which once held the promise of connection, now seems to magnify the distance and separation. IGC seeks to reconnect with the audience by giving them a virtual seat \"at the table\", where they can listen in to an intimate conversation between two artist friends."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Ars Lyrica Houston",
    "Discipline": "Performing Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Ars Lyrica Houston",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Ars Lyrica Houston",
    "Discipline": "Music",
    "AwardAmount": "$50,315.00",
    "FacebookURL": "facebook.com/arslyricahouston",
    "InstagramURL": "instagram.com/arslyricahouston",
    "WebsiteURL": "www.arslyricahouston.org",
    "Summary": "Ars Lyrica seeks support for all 2023 year programming, including six subscription programs at the\nHobby Center for the Performing Arts, St. Philip Presbyterian Church and Rienzi, a suite of digital companion programs and\nrecordings, touring to San Diego and Tucson, plus community and school education outreach programs city-wide\n(in-person and virtual). ALH offers Houston audiences a multi-faceted subscription programs that\ninclude seldom-heard treasures alongside great masterworks. ALH also offers multiple outreach programs that range from interactive educational experiences to ambassadorial efforts for the City of Houston."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Art Colony Association",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$64,969.00",
    "FacebookURL": "facebook.com/houstonartfest",
    "InstagramURL": "instagram.com/houstonartfest",
    "WebsiteURL": "www.artcolonyassociation.org",
    "Summary": "Art Colony Association, Inc. (ACA) provides multidisciplinary experiences through two outdoor festivals each year. The festival promotes visual arts by featuring original artwork for purchase from artists all over the country that have been selected through a rigorous jury process. We celebrate performing arts on our 2 outdoor stages. We also have introduced a culinary arts stage where we spotlight diverse Houston chef's that provide demonstrations and a tasting experience in front of a live audience. Proceeds benefit our local nonprofits."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Art League of Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Art League of Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Art League of Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/artleaguehouston",
    "InstagramURL": "instagram.com/artleaguehouston",
    "WebsiteURL": "www.artleaguehouston.org",
    "Summary": "Art League Houston (ALH) seeks funding to support its general operating expenses and visual arts programs for the 2023 program year. Committed to accessibility and inclusiveness, ALH's programming engages the community at large while fostering a vibrant network of audiences, students, artists, and patrons. In 2023, ALH will offer 12 public programs and 18 exhibitions, both in-person and virtually, to some 25,000 participants. All exhibitions are free, open to the public, and feature emerging and established local, national and international artists. All programs culminate in public exhibitions that showcase each community's artistic participation and cultivate relationships between ALH's diverse stakeholders."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Ashlei Colgate",
    "Discipline": "Performing Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/ColgateSmilez",
    "InstagramURL": "instagram.com/colgatesmilez12",
    "WebsiteURL": "colgatesmilez.lol",
    "Summary": "An one woman variety show by Colgate Smilez. Using various performing art forms to tell her story as a black trans woman growing up being misgendered, emotionally neglected and abused mentally and physically. How she survived even through the military and how being an artist and an entertainer has helped her overcome her childhood trauma to become \"Miss Congeniality\" amongst the LGBTQIA and a blazing pioneer artist, business owner and entertainer."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Ashley Hoskins",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Asia Society Texas",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$106,250.00",
    "FacebookURL": "facebook.com/asiasocietytexas",
    "InstagramURL": "instagram.com/asiasocietytx",
    "WebsiteURL": "https://asiasociety.org/texas",
    "Summary": "Asia Society Texas (ASTX) strives to both educate and entertain by creating thought provoking experiences of the highest quality, from a variety of countries/cultures, aesthetic points of view and art forms. Through visual arts, dance, film, literature, music, and theatre, ASTX embraces the fluidity between traditional and contemporary arts to engender curiosity, empathy, and a better understanding of our community and the world."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Aurora Picture Show",
    "Discipline": "Film",
    "AwardAmount": "$52,688.00",
    "FacebookURL": "facebook.com/AuroraPictureShow/",
    "InstagramURL": "instagram.com/aurorapictureshow/?hl=en",
    "WebsiteURL": "www.aurorapictureshow.org",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Avenue Community Development Corporation",
    "Discipline": "Visual Arts",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "facebook.com/avenuecdc",
    "InstagramURL": "instagram.com/avenue_cdc/",
    "WebsiteURL": "https://www.avenuecdc.org/",
    "Summary": "Art on the Avenue is Houston's biggest local art exhibition and is hosted annually by Avenue at Winter Street Studios. This event supports our mission of investing in people and strengthening communities. More than 250 local artists contribute to Art on the Avenue each year, giving them a unique opportunity to participate in a large exhibition attended by hundreds of Houstonians where they can benefit both professionally and financially from the sale of their work."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Axiom Quartet",
    "Discipline": "Music",
    "AwardAmount": "$9,217.00",
    "FacebookURL": "facebook.com/axiomquartet",
    "InstagramURL": "instagram.com/axiomquartet",
    "WebsiteURL": "axiomquartet.com",
    "Summary": "The Axiom Quartet 2023 Jukebox series is an artistic collaboration where Houston audiences play a key role in the creation of, and participation in, the artistic process. A diverse and culturally relevant playlist of music from Mozart, to Duke Ellington and Rhianna will highlight the string quartet medium through the various musical genres. These performances will target several Houston neighborhoods, being held at coffee shops, bars, and restaurants where neighborhood communities gather. Using the portable nature of the quartet this series meets Houston's multicultural communities where they are and offers them an equally varied playlist of music styles."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Axzel Sequera",
    "Discipline": "Music",
    "AwardAmount": "$14,700.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/axzel_oriental/",
    "WebsiteURL": "",
    "Summary": "Project consists of producing an archival collection album of ancestral folk musical genres of the eastern Venezuela region. This music represents one of the earliest musical expressions of post-Columbian Americas. The album will be centered on vocals, in Spanish, and supported by traditional string accompaniment. The vocal performance will be by Hernan Marin, whose lifelong works have been declared cultural heritage of Venezuela, in combination with Axzel Sequera, his nephew and mentee, established in Houston, who has learned and promoted these underrepresented musical styles and has recently established himself as carrier of this musical tradition."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Badie Khaleghian",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/badiekhaleghian/",
    "WebsiteURL": "https://badiekhaleghian.com",
    "Summary": "This project is a battlecry for women's rights, encompassing a collaboration among pianist and movement artist Caroline Owen, painter Kyle Sharkey, and composer and sound artist Badie Khaleghian. All three of us will come together for UNCHAINED, a live concert program featuring two interactive intermedia works. This program synthesizes live piano, movement, and interactive visual art and audio to illuminate two women's journeys through struggle to find freedom and authenticity."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Bay Area Houston Ballet & Theatre",
    "Discipline": "Dance",
    "AwardAmount": "$43,226.00",
    "FacebookURL": "facebook.com/BayAreaHoustonBallet&Theatre",
    "InstagramURL": "instagram.com/bahbtorg",
    "WebsiteURL": "www.bahbt.org",
    "Summary": "Bay Area Houston Ballet & Theatre is the only non-profit semi-professional ballet company on the south side of Houston that creates triple threat dancers and an eclectic season that entices diversified audiences. Four full staged productions are done each year bringing over 14,000 to the theater and thousands to view digitally. Numerous outreach endeavors are done yearly in schools, parks, and events to promote the arts to our community."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Ben Koush",
    "Discipline": "Design",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/benkoush/?hl=en",
    "WebsiteURL": "www.benkoush.com",
    "Summary": "I am an architect in Houston who is working on a book documenting modern architecture in Texas. My co-author is Kathryn O'Rourke, a professor of architectural history at Trinity University. The working title is Texas and Modern Architecture, and it is under contract with the University of Texas Press with a publication date projected for late 2023 or early 2024. I have spent the past several years photographing significant buildings in Houston across the state and O'Rourke is writing the manuscript."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Bethany Logan",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Bharathi Kalai Manram",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$16,202.00",
    "FacebookURL": "facebook.com/bharathikalaimanram.bkm",
    "InstagramURL": "",
    "WebsiteURL": "https://bkmhouston.org/",
    "Summary": "Tamil Harvest Festival (Pongal) will be conducted in Houston in January 2023 involving 500 people. BKM day will be conducted in Westchester academy inviting 250 people. 2-3 dramas will be conducted in JCC with 250 participants. Tamil New year celebration will be conducted in India House, Houston location with 300 participants. Tamil school annual day will be conducted with 500 participants. 2 picnics will be conducted in Houston parks with 500 participants. Bharathiyar day will be celebrated in Houston location inviting 500 participants. Multidisciplinary art forms will be promoted throughout the year."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Bloomsday Literary",
    "Discipline": "Literary",
    "AwardAmount": "$7,437.00",
    "FacebookURL": "facebook.com/BloomsdayLiterary",
    "InstagramURL": "instagram.com/bloomsdayliterary/",
    "WebsiteURL": "www.bloomsdayliterary.com",
    "Summary": "In 2023, Bloomsday will be launching Fellowship Publishing, where two authors whose voices have been largely underrepresented in traditional publishing will be selected for publication and paid a $20,000 fellowship at the time of signing, and supported financially as they make their way through the editorial process. Additionally, we will celebrate the publication of three current Bloomsday authors�Deborah D.E.E.P. Mouton, Victoriano Cardenas, and Rima Ruhman�with public events complete with dramatic readings, audience engagement, and musical and performing act from Houston area talents."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Brandi Allen",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/daisiesandpancakes",
    "InstagramURL": "instagram.com/daisiesandpancakes",
    "WebsiteURL": "https://linktr.ee/daisiesandpancakes",
    "Summary": "Daisies & Pancakes (D&P) has taken skating and the production of skates to a historic African American community in Houston, the 3rd Ward, and has created  an art form to advocate for family and community well-being . Through two weekly classes, a monthly event and hand crafted custom skates, D&P seeks to reduce stress and outdoor recreation and promote community health. D&P requires support to build out a website and strength current activities to advance to the next stage of growth."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Brandon Willis",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Brandon Willis",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "The Biggest Love: Musical Sonic Experiences in Public Spaces is a multi-site public performance experience that incorporates music, videography, and dance to provide alternative healing spaces in Houston's public parks. Between February and June of 2023, The Biggest Brandon will perform at The Buffalo Bayou Cistern, Herman Park Centennial Garden, Fifth Ward Jam Park, and Houston Police Department Memorial to highlight public performance in a non-traditional way. This public art series will inspire Houstonians and visitors to reimagine their defines of love and liberation."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Buffalo Bayou Partnership",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "facebook.com/buffalobayou",
    "InstagramURL": "instagram.com/buffalobayou/",
    "WebsiteURL": "https://buffalobayou.org/",
    "Summary": "Buffalo Bayou Partnership (BBP) will present arts and cultural programs to activate the 10-square mile stretch of Buffalo Bayou from Shepherd Drive to the Port of Houston. This area includes the 160-acre Buffalo Bayou Park, the Buffalo Bayou Park Cistern, Allen's Landing in downtown, and parks and green space along the bayou in the East End and Fifth Ward neighborhoods.  BBP's goal is to offer site-specific art and programming that engages the public with the organization's distinctive spaces and seeks to reveal beauty, create a sense of belonging and inspire awe."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Buffalo Soldiers National Museum",
    "Discipline": "Museum",
    "AwardAmount": "$54,332.00",
    "FacebookURL": "facebook.com/buffalosoldiermuseum/",
    "InstagramURL": "instagram.com/buffalosoldiersmuseum/",
    "WebsiteURL": "buffalosoldiermuseum.com",
    "Summary": "The Center for African American Military History dba Buffalo Soldiers National Museum is requesting support of our museum and its programs, which are designed to increase knowledge about the role African Americans have played in the United States military.The Buffalo Soldiers National museum is one of the leading providers of African American and military history education in Houston, with a focus on showcasing the full breadth of the African American military experience through various mediums, including artistic programming and exhibitions. We conduct historical tours, youth programming, educational programming, historical lecture series, military art shows, and reenactments for various audiences."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Camisha long",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Catherine Lu",
    "Discipline": "Literary",
    "AwardAmount": "$10,500.00",
    "FacebookURL": "facebook.com/HoustonArtsJournal",
    "InstagramURL": "",
    "WebsiteURL": "www.houstonartsjournal.com",
    "Summary": "Houston Arts Journal is an independent arts blog that shares arts news, announcements, and opportunities across art forms and genres, so that anyone interested in following the Houston arts scene can stay up-to-date with local developments. A form of public \"journaling,\" it reports on noteworthy events, trends, arts leadership, and other headlines to illustrate the activity, possibility, and diversity that exist in Houston arts."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "CCM Foundation",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/stdfree365",
    "InstagramURL": "instagram.com/stdfree365/",
    "WebsiteURL": "www.hivawareness.org",
    "Summary": "The Art On The Streets World AIDS Day Art Project, which has showcased talented young artists work around Houston since 2015, is a collaborative effort between CCM Foundation, Houston Independent School District(HISD) and the Houston Health Department. In addition to supporting the creative vision of some of Houston's most talented young artists, raising awareness and encouraging prevention of HIV/AIDS to HISD middle & high school students, the artwork featured in this multi-location, public art exhibit also serves as signage for the official City of Houston World AIDS Day remembrance ceremony which is held at Sam Houston Park."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Chamber Music Houston",
    "Discipline": "Music",
    "AwardAmount": "$21,427.00",
    "FacebookURL": "facebook.com/ChamberMusicHouston",
    "InstagramURL": "instagram.com/chambermusichou/",
    "WebsiteURL": "www.chambermusichouston.org",
    "Summary": "Chamber Music Houston is inspiring a passion for chamber music in Houston and throughout the world by presenting exceptional international chamber music ensembles performing the greatest classical music composed, from 1723 to 2023!  This year will feature nine concerts in Stude Concert Hall at the Shepherd School of Music, on the beautiful Rice University campus, with musicians from Spain, Italy, Poland, Israel, France, and throughout the U.S."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Chavonte Wright",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Children's Museum of Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$626,034.46",
    "FacebookURL": "facebook.com/cmhouston",
    "InstagramURL": "instagram.com/childrensmuseumhouston",
    "WebsiteURL": "www.cmhouston.org",
    "Summary": "In FY22 we served 412,200 Museum visitors, 176,200 outreach participants at 251 locations, and 710,000 viewers via virtual programming. COVID caps limited attendance through March 2022, with April-June 2022 attendance exceeding pre-pandemic rates. Multilingual programming features dance, film, literature, music, performing arts, theater, visual arts, craft, multimedia, and design/fabrication. We prioritize low-income BIPOC families underserved by other arts organizations, with arts experiences essential for children's socioemotional/cognitive development."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Chinese Community Center",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/ccchouston",
    "InstagramURL": "instagram.com/ccchouston",
    "WebsiteURL": "www.ccchouston.org",
    "Summary": "Commemorating the Year of the Rabbit, the 2023 Lunar New Year Festival will celebrate one of the most important holidays in Chinese and many Asian cultures by featuring traditional dance and martial arts performances, cultural learning activities, and an Asian marketplace for the whole family to enjoy. The festival will take place on Saturday, January 21, 2022, from 10:00 a.m. to 4:00 p.m. at the Chinese Community Center, located at 9800 Town Park Drive in the heart of southwest Houston's Asiatown."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "City Ballet of Houston",
    "Discipline": "Dance",
    "AwardAmount": "$2,356.00",
    "FacebookURL": "facebook.com/academyofcityballetofhouston",
    "InstagramURL": "instagram.com/academyofcityballetofhouston",
    "WebsiteURL": "cityballetofhouston.com",
    "Summary": "City Ballet of Houston's (CBH's) goal is to bring high quality, affordable dance performances to the entire community of Houston, with a particular focus on underserved youth.  This is achieved through dance training master classes (ongoing), educational docents with performance excerpts (September - schools and public park sites), repertoire concerts (May - Match Theater) and professional level productions of The Nutcracker (November - Wortham Center; December - The Grand 1894 Opera House).  CBH prides itself in giving the community the opportunity to enjoy dance, regardless of ones economic status."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Classical Theatre Company",
    "Discipline": "Theater",
    "AwardAmount": "$13,904.00",
    "FacebookURL": "facebook.com/classicaltheatrecompany",
    "InstagramURL": "instagram.com/ctchouston",
    "WebsiteURL": "https://classicaltheatre.org/",
    "Summary": "Classical Theatre Company is the only professional theatre company in the State of Texas that solely produces year round classical drama, which we define as any source material that is 100 or more years old. We bring the classics to the stage, classrooms, and the community with engaging programming that is geared to reflect the diversity and relevant topics that make up our city. We produce three full mainstage productions and host three lectures at the Fifth Ward's historic DeLuxe Theater, free readings, and have the foremost classical education and outreach program in the area with our Shakespeare Outreach program."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Cl'Che'",
    "Discipline": "Performance Art",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Cl'Che'",
    "InstagramURL": "instagram.com/clchemusic",
    "WebsiteURL": "www.ilovemshouston.net",
    "Summary": "My Proposed project is titled The Hustle Hard Block Xplosion #7. Expected to take Place July 4th weekend 2023 from 12pm-9pm in the South Park Community. I have had 6 successful events I fundraised for and gathered sponsors to help bring this positive stage to life. Bringing Unity to the Community through Arts & Culture."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Community Artists' Collective",
    "Discipline": "Visual Arts",
    "AwardAmount": "$31,136.00",
    "FacebookURL": "facebook.com/Communityartistscollective",
    "InstagramURL": "instagram.com/Communityartistscollective",
    "WebsiteURL": "www.thecollective.org",
    "Summary": "Community Artists' Collective will provide visual arts Exhibits, Educational Artist Programming, Entrepreneurship Artist Workshops and Cultural Arts Community Development Programming from\nJanuary 1, 2023 to December 31, 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Community Development Corporation of Freedmens Town",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$4,886.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/RestorationofAndrewsStreetBrick",
    "WebsiteURL": "https://houstonfreedmenstown.org",
    "Summary": "Qtr 1: Jan MLK Parade, Programs on Moor Americans contributions; February 1-28, Heritage Programs at Rutherford Yates Museum. Qtr 2: Junefest first week in June for 4 days; welcoming public to Freedman's Town and learn heritage in its buildings, brick streets, people, sites, etc. Qtr 3: August 23 Annual Camp Logan War Program, honoring 3rd Battalion, 24th Infantry; Octoberfest on Oct. 31 offers creativity in costumes for youth and adults."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Community Music Center of Houston",
    "Discipline": "Music",
    "AwardAmount": "$31,375.00",
    "FacebookURL": "facebook.com/CMCHLive1",
    "InstagramURL": "instagram.com/cmch_houston/",
    "WebsiteURL": "https://www.cmchouston.org",
    "Summary": "We will be presenting our youth programming that includes our traditional weekly music lessons, vocal development classes, semi-annual student recitals/ youth orchestra performances, and our summer music youth camp. We will be producing our yearly programming: Martin Luther King Jr. Tribute Concert, Discovered Treasures Concert, Black History Month Concert with the African American Museum of Dallas, Annual Legacy Project with Community Artists' Collective and our End-Of-The-Year-Giving Music Series."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Contemporary Arts Museum Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Contemporary Arts Museum Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/theCAMH",
    "InstagramURL": "instagram.com/camhouston",
    "WebsiteURL": "camh.org",
    "Summary": "CAMH seeks general operating support to present its suite of exceptional exhibitions, dynamic public programming, and community-centered partnerships in 2022. The deep reflection and hard work as a result of COVID-19 and the racial reckonings of 2020 have established new operating procedures, long-term programs, and partnerships that, when fully realized, will strengthen our local arts infrastructure in an equitable, inclusive, and accessible manner while promoting extraordinary, thought-provoking arts programming and exhibitions to educate and inspire audiences nationally and internationally."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Cressandra Thibodeaux",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Crystal Toussant",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/crystaltoussant",
    "WebsiteURL": "",
    "Summary": "Lone Star Players Summer Camp will have a low-cost 2-week Performing and Visual Arts summer camp for students primarily in District D with any Houston Area students welcome to join.  Our students in the 3rd - 10th grade age range will research, memorize, and perform the play, Shirley Chisholm: \"Unbought and Unbossed\" by Mary Satchell.  We will offer a Digital option for viewing and an in-person performance at a location in District D in August 2021."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "C-Stem Teacher and Student Support Services",
    "Discipline": "Public Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/cstem.org/",
    "InstagramURL": "https://www.instagram.com/cstemorg/",
    "WebsiteURL": "cstem.org",
    "Summary": "The C-STEM Little Library Free WiFi Public Art Project offers free books to increase STEM literacy and awareness of health/wellness, bridges the digital divide by providing access to the Internet of Things (IoT), beautifies the community, increases usage of underutilized pocket spaces in the community, and creates safer neighborhoods."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "C-Stem Teacher and Student Support Services",
    "Discipline": "Public Art",
    "AwardAmount": "$9,255.00",
    "FacebookURL": "facebook.com/cstem.org/",
    "InstagramURL": "instagram.com/cstemorg/",
    "WebsiteURL": "cstem.org",
    "Summary": "African American mathematicians, scientists, and inventors have contributed to our nation's greatness and beyond for hundreds of years. From Dr. Daniel Hale Williams performing the first prototype open-heart surgery to Hadiyah Nicole-Green's cancer treatment research using lasers and nanoparticles, the natural artistic expression embedded in the scientific approach is evident."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Culture of Health - Advancing Together",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$17,145.00",
    "FacebookURL": "facebook.com/CHATCULTUREOFHEALTH",
    "InstagramURL": "instagram.com/chat_tx",
    "WebsiteURL": "https://chattx.org/",
    "Summary": "Art has been part of the core mission for Culture of Health - Advancing Together (CHAT) from the beginning. CHAT art projects and programs have included the Gulfton Story Trail mural series, CENSUS 2020 murals, Arts Book Project 2021, Health Resources murals, and the art components provided as part of our after school and summer camp programs."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "DACAMERA",
    "Discipline": "Music",
    "AwardAmount": "$20,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "DACAMERA",
    "Discipline": "Music",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/dacamera",
    "InstagramURL": "instagram.com/dacamerahouston/",
    "WebsiteURL": "www.dacamera.com",
    "Summary": "DACAMERA presents pianists Emanuel Ax; the Juilliard String Quartet; pianist Sarah Rothenberg and cellist Sonia Weider-Atherton; an all-star jazz series featuring Christian McBride, Cecile McLorin Salvant, and saxophonist Miguel Zenon; world-renowned Ensemble Intercontemporain; the baroque period ensemble, Ruckus; violinist Christian Tetzlaff, cellist Tanja Tetzlaff, and pianist Lars Vogt. Multi-disciplinary offerings - music and poetry celebrating poet Adam Zagajewski; composer Osvaldo Golijov's Falling Out of Time; and the world premiere of a DACAMERA original production, UNEARTHED, commemorating the Sugar Land 95 created by a Houston triumvirate of composer/drummer Kendrick Scott, poet Deborah D.E.E.P. Mouton, and artist Robert Hodge."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Dance of Asian America",
    "Discipline": "Dance",
    "AwardAmount": "$33,595.00",
    "FacebookURL": "facebook.com/danceofasianamerica/",
    "InstagramURL": "instagram.com/danceofasianamerica/",
    "WebsiteURL": "https://www.danceaa.org/",
    "Summary": "Dance of Asian America promotes and preserves the rich cultural heritage of Asia through authentic Asian dance.  In doing so, DAA sustains traditions, builds international ties, educates Houstonians in cross-cultural understanding and fosters new generations of professional artists.  DAA's programs include free city-wide productions, cultural performances and programs for the community, educational programs for youths and professional dance training."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Dance Source Houston",
    "Discipline": "Dance",
    "AwardAmount": "$30,547.00",
    "FacebookURL": "facebook.com/dancesource",
    "InstagramURL": "",
    "WebsiteURL": "https://dancesourcehouston.org/",
    "Summary": "Dance Source Houston is an arts service organization dedicated to supporting local dance artists and organizations throughout the Greater Houston region. During the grant timeline DSH will provide performance opportunities through Mind The Gap showcases at MATCH and Barnstorm Dance Fest (6/5/23-6/10/23 at MATCH), serving dancemakers and audiences. Through ongoing programming, DSH will also amplify dance events through marketing support, deliver weekly communications to inform constituents about professional opportunities, host monthly community networking events, distribute funding to artists and companies, and provide access to health services."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Banco",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/yungbanco",
    "WebsiteURL": "",
    "Summary": "Banco and friends is an evening designed and led by POC Queer woman to uplift female artists, DJs, and creatives. Created to give them an opportunity to showcase their talents and message behind their art during a packed showcase in downtown Houston. Calling out diverse sounds and systems to Houston from all over the country encourage growth among artists and camaraderie, while also building new communities of diverse people."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Dawn Reavis",
    "Discipline": "Film",
    "AwardAmount": "$2,150.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/dawn.reavis",
    "WebsiteURL": "imdb.me/dawnreavis",
    "Summary": "Dawn Reavis is the writer and producer of The Art of Eternal Love, a sci-fi drama with a surprising twist Dawn is 2022  MFA graduate of HBU and a SAG actor who appears most recently on Queen Sugar. This is the second film she has produced but this time she also plans to direct. The production will employ five Houston actors, a diverse professional crew, and several student production assistants. The grant will  offset the production budget of more than $14,000. Based on The Birthday Club, her first film, the short will  have a theatrical release and a festival run."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Dean Liscum",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "facebook.com/Dean.Liscum.7",
    "InstagramURL": "instagram.com/deanliscum",
    "WebsiteURL": "www.deanliscum.com",
    "Summary": "Writing Sideways uses techniques from surrealism, theater of the absurd, and automatic writing to explore new approaches to political, social, and cultural issues. I will open the workshop by reading examples from my published work. Next I will walk participants through a series of exercises to help them approach the issue/issues of their choice from new/re-imagined vantage points. Finally, we will work together to create drafts of an original work that incorporates their work from the exercises."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Deeper Than Dance",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Deniz Lopez",
    "Discipline": "Performance Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/allrealradio",
    "InstagramURL": "www.instagram.com/allrealradio",
    "WebsiteURL": "www.allrealradio.com",
    "Summary": "Poet deniz dee!colonize lopez invites you to an intimate poetry reading featuring notable established and up-and-coming poets from around the country. Experience an intimate �storytelling' poetic experience with 1 featured poet, light bites, and libations at the All Real Radio studio. We plan to start our poetic journey by featuring Houston -Area poets and expand over the next 6 months and our events will be live streamed via our airwaves at www.allrealradio.com, our app, and all the other ways you can listen to All Real Radio."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Devonte Hill",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/totalmedulla",
    "InstagramURL": "instagram.com/totalmedulla/",
    "WebsiteURL": "https://www.totalmedulla.com",
    "Summary": "Through Salsa! A retrospective look on the diversification in the Latino community that went from mostly Mexican to a thriving multi Latinx community; traced through the rise of salsa music and dance. Starting in the 1970s to present, interviews, historical data, archival videos and artists experiences, Through Salsa! highlights how an art-form had the power to unite people from Latin countries and the world, as they shared their love for salsa. With many major salsa events in Houston, I plan to present this documentary as part of the international salsa spring events between the months of February-April, 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Diaz Music Institute",
    "Discipline": "Music",
    "AwardAmount": "$19,313.00",
    "FacebookURL": "facebook.com/DiazMusicInstititute",
    "InstagramURL": "instagram.com/diazmusicinstitute",
    "WebsiteURL": "www.diazmusicinstitute.org",
    "Summary": "The 23rd Annual Latin Jazz Summer Workshop and Concert Series is a two-week program for students ages 4-18 held at Elsik HS (District F), MacArthur HS, Wheatley HS (District B), and Lakeshore Elementary (District E). Elementary students receive percussion, dance, voice, and guitar classes. Middle and high school students have courses, in theory, music business, production, improvisation, dance, and masterclasses on their instruments. The workshop exposes students to diverse cultures through instructors, artists, music, and performances."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Dirt Dogs Theatre Company",
    "Discipline": "Theater",
    "AwardAmount": "$2,459.00",
    "FacebookURL": "facebook.com/DirtDogsTheatre",
    "InstagramURL": "instagram.com/dirtdogstheatre",
    "WebsiteURL": "www.dirtdogstheatre.org",
    "Summary": "Dirt Dogs Theatre Co. recently announced our Season 7 lineup, consisting of three mainstage productions, the third of our UNLEASHED series, and our annual Student Playwright Festival. COYOTE ON A FENCE runs October 21 - November 5, 2022, MISERY plays March 3 - 18, 2023, and AUGUST: OSAGE COUNTY performs May 2 - June 10, 2023. Dirt Dogs UNLEASHED in association with Sweet Darlin' Productions presents the second ever staging of SHAKIN' THE BLUE FLAMINGO August 12 - 20, 2022. All events take place at MATCH."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Discovery Green Conservancy",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "facebook.com/DiscoveryGreenHouston",
    "InstagramURL": "instagram.com/discoverygreen/",
    "WebsiteURL": "www.discoverygreen.com",
    "Summary": "Discovery Green is a transformative outdoor community space where Houstonians connect and share moments of magic and joy. Cultural events animate public life here. It fosters strong community relationships. It strengthens economies and appreciation for diversity.  Its programs are an important part of Houston's vibrancy. A grant from Houston Arts Alliance would support 12 months of freely accessible in-person and online cultural, wellness, and family programming reflecting Houston's diversity and creativity. This green in the center of the country's 4th largest city serves as a platform for emerging and award-winning artists, telling the unique story of Houston through art."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "DiverseWorks",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$67,734.00",
    "FacebookURL": "facebook.com/DiverseWorks/",
    "InstagramURL": "instagram.com/diverseworks",
    "WebsiteURL": "https://www.diverseworks.org/",
    "Summary": "In 2023, DiverseWorks will commission, produce, and present new multidisciplinary exhibitions and performance projects by local and national artists that engage Houstonians on urgent social and cultural issues related to labor, race, and generational healing. Projects will take place at MATCH and offsite/outdoor locations. Additionally, DW will launch the 4th round of Project Freeway Fellowships and present the Diverse Discourse Lecture and Studio Visit Series, which brings curators/critics/artistic directors to Houston to give a free public lecture and conduct studio visits with Houston artists."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Donna Crump",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "facebook.com/DonnaCrump",
    "InstagramURL": "instagram.com/_Gooddance1984",
    "WebsiteURL": "www.LinearFunction.net",
    "Summary": "Grace Under Pressure  is an immersive, multi-disciplinary experience including film, dance, photography, and audience participation at Sanman Studios in Houston, TX,  March 2023 at 7:30pm. This installation is 2 of 3 parts of the work in progress, Gend[H]er which examines the reversal of gender roles' portrayal through society's stereotypes in the workforce and in the home amidst the pandemic. It studies feminine energy on a deeper level examining Octopuses as a female archetype and female mental and reproductive health. The goal is to create connection and awareness while making safe and accessible art for all."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Drea the Artist",
    "Discipline": "Visual Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/drea_theartist",
    "WebsiteURL": "www.dreatheartist.com",
    "Summary": "Elevated Intersections\" is a painting exhibition featuring Andrea Venson and Jatziri Barron that captures a series of monthly events in Fifth Ward Houston. There will be a Mindful Painting session led by Andrea, a Salsa night led by Texas Salsa Congress, a Hip-Hop dance night led by Sun'Kissd Dance Concepts, and two outdoor yoga sessions led by Nicole Peralta and Jotina Buck. The final art exhibition will open at the DeLuxe Theater on September 23, 2023, and will feature dance performances by Nia's Daughters Movement Collective and Itzcoatl Tezkatlipoka."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Dynamism Fine Arts of Texas",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$6,379.00",
    "FacebookURL": "facebook.com/dynatexas/",
    "InstagramURL": "instagram.com/dynatexas/",
    "WebsiteURL": "instagram.com/dynatexas/",
    "Summary": "Through innovative arts programing, Dyna Texas exist to bring out the talents of young scholars to the center stage. Through our Acting Up Project, students will write, direct, and create artistic productions for their communities. These productions will showcase student's acting skills, dance skills, visual art designs, and their ability to bring joy to their community through arts."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "East End Houston Cultural District",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$27,509.00",
    "FacebookURL": "facebook.com/eastendhou",
    "InstagramURL": "instagram.com/eastendhou/",
    "WebsiteURL": "eastendimprovement.org",
    "Summary": "In line with our goal to amplify East End as a destination for arts and cultural tourism, we seek $50,000 which will support our 2023 arts programming.  Through this programming, we will draw visitors from 50+ miles through public art, art tours, events and major arts festivals while also supporting the desire of our community to have \"numerous, intense short-term activations\" and \"artistically-integrated gatherings\" which \"encourage all ages to come together and enjoy the many offerings of the East End\".  All activities will be free and open to the public."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "ECHO Orchestra",
    "Discipline": "Music",
    "AwardAmount": "$7,136.00",
    "FacebookURL": "facebook.com/ECHOrchestra",
    "InstagramURL": "instagram.com/ECHOrchestra",
    "WebsiteURL": "www.echorchestra.org",
    "Summary": "ECHO will produce and present 3 full, orchestral performances during the 9th Season: the Fall Concert on October 7, 7:30, at St. John Vianney; the \"New Year's Eve Eve\" Concert on December 30, 7:30, at Queensbury Theatre; and the Spring Concert on May 18, 2023, 7:30, at Strake Jesuit HS. We will also present ECHOes in the Area -- smaller concerts -- on October 23, 5:50, at La Tartine; November 27, 5:30, at Cafe Benedicte; and April 1, 5:30, at King's Head Pub. We will collaborate with the Energy Corridor District to present a Christmas Tree Lighting Ceremony in December."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Elizabeth Newkirk",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Ensemble Theatre",
    "Discipline": "Theater",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/TETMidtownHouston",
    "InstagramURL": "instagram.com/tet_houston",
    "WebsiteURL": "EnsembleHouston.com",
    "Summary": "The Ensemble Theatre will present its Mainstage season of six classic and contemporary theatrical works, the \"Celebrating the Creative Journey\" series of diverse programming to provide enrichment and education for patrons and artists, as well as wide variety Performing Arts Education programs both in-house and in Houston-area schools. In these ways, we will fulfill our mission to preserve African American artistic expression and enlighten, entertain and enrich a diverse community."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Erica Lee",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Etienne Brown",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/Luchadorios_Short_Film",
    "WebsiteURL": "www.AdonayMRP.com",
    "Summary": "Luchadorios is a short film based on two wrestling fanatics. Leia, the younger sister, is woken up on her sixth birthday by her older sister Mia, who is excited for the best part; smashing a pi�ata and starting the day watching their favorite Saturday morning wrestling show! The festivities take a turn when their father buys the wrong type of cereal and their imagination gets carried away. At heart, Luchadorios is a film for those that grew up watching AAA and having awesome birthday pi�atas."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Eunghee Cho",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "www.eunghee.com",
    "Summary": "The inaugural CelloFest Houston takes place February 5-6, 2023 at venues across University of Houston's Moores School of Music campus. CelloFest Houston brings together master cellists and young cellists from the Greater Houston area to collaborate in two concerts that celebrate the cello, its music, and the musicians."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Evelyn Rubenstein Jewish Community Center of Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$23,678.00",
    "FacebookURL": "facebook.com/ERJCC",
    "InstagramURL": "instagram.com/erjcchouston/",
    "WebsiteURL": "https://www.erjcchouston.org/",
    "Summary": "Serving the community for more than 85 years the J is a communal leader for arts and culture programming in Southwest Houston.  By providing opportunities throughout the year in five core areas of theatre, dance, music, film and literary arts as well as immersive festivals focused on literature and cinematic arts, the J has something for everyone.  Our longstanding relationships with more than 30 arts organizations, as well as established and emerging artists, provides our arts and culture program the opportunity to reach a variety of areas in Houston and giving us the ability to continually diversify our work."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Express Children's Theatre",
    "Discipline": "Theater",
    "AwardAmount": "$16,797.00",
    "FacebookURL": "facebook.com/expresschildrenstheatre/",
    "InstagramURL": "instagram.com/expresstheatre1/",
    "WebsiteURL": "https://expresstheatre.com",
    "Summary": "Express Children's Theatre is Houston's oldest and largest multicultural performing arts and education organization dedicated exclusively to children and families. Typically, we present 200 performances (interactive theatrical productions and storytelling events) for 75,000 children throughout Greater Houston, with a focus on underserved populations. (Pandemic permitting), public events take place year-round throughout the Houston and Harris County Library systems, at the Maybe Theatre at Houston Baptist University, the Bayou Bend Collection of the Museum of Fine Arts Houston, Oaks Christian Church and other locations. A number of our shows are also available virtually and are shown throughout Library Systems."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Fatima Hye",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/blackrevelproductions",
    "InstagramURL": "instagram.com/blackrevelfilms",
    "WebsiteURL": "https://www.blackrevel.com",
    "Summary": "Ana and Mia\" is a psychological body horror feature film about two lonely girls who form a strong attachment and begin pushing one another into dangerous behaviors, such as disordered eating. We are currently doing a crowdfunding campaign, but with an HAA grant, we can expand our budget in the areas of the physical shoot (in Texas), post production, and distribution, culminating in a special community preview of the film (2023)."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Filipino Young Professionals",
    "Discipline": "Dance",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/fyphouston/",
    "InstagramURL": "instagram.com/fyphouston/",
    "WebsiteURL": "https://www.fyphouston.com",
    "Summary": "Hire a professional dance instructor with a background in Filipino cultural dance to level up our troupe's foundational skills, teach us more challenging maneuvers, extend our repertoire, and work with us to create original choreography. We envision participating in a series of day-long workshops open to all comers over the course of the summer, resulting in fresh and exciting new programming our troupe can use for years to come to showcase the rich variety and artistry of Filipino cultural dance traditions."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "FLATS",
    "Discipline": "Visual Arts",
    "AwardAmount": "$30,276.00",
    "FacebookURL": "facebook.com/FLATSpresents/",
    "InstagramURL": "instagram.com/flatspresents",
    "WebsiteURL": "https://www.flatspresents.com/",
    "Summary": "FLATS is continuously growing our space for photographers to develop, digitize, and print their work using the traditional tools of analog photography. We want to continue to serve as a learning space for artists and hobbyists alike. We have begun to expand our classes on traditional photography techniques such as processing, enlarging, and more. As a companion to our nomadic exhibition series, print publication, and photo lab, the FLATS community darkroom has furthered our mission: to serve as a hub of support for every level of the Houston photo community, and for photographic artists who visit our city."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "FotoFest",
    "Discipline": "Visual Arts",
    "AwardAmount": "$105,000.00",
    "FacebookURL": "facebook.com/fotofest",
    "InstagramURL": "instagram.com/fotofest",
    "WebsiteURL": "www.fotofest.org",
    "Summary": "A platform for art and ideas, FotoFest exhibits contemporary photography and new media art by local, national and international artists, fostering cross-cultural exchange and advancing the discourses surrounding visual culture and society. During spring 2023 and fall 2023, FotoFest will present two distinct large discursive exhibitions in its Silver Street Studios exhibition space and a range of public programs. FotoFest will also begin organizing the 20th international Biennial of Photography and New Media Art in Houston, attracting an audience of 200,000+ visitors citywide, currently planned to take place March through April, 2024."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Frame Dance Productions",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/framedanceproductions",
    "InstagramURL": "https://www.instagram.com/framedance/",
    "WebsiteURL": "www.framedance.org",
    "Summary": "Distracted Driving: it's a big problem. This new large-scale public dance performance by Lydia Hance, \"the city's reigning guru of dance in public spaces\" (Dance Magazine) takes place in a parking lot. This new two-day performance will examine what happens if we take away the protective metal casings of cars that make us feel anonymous and we see the people who drive the cars maneuvering...dancing in a parking lot. Road Rage is a chapter in the year long performance series choreographed by Lydia Hance, City Life, a collaboration with artist Cindee Klement in which we reimagine urban landscapes."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Fred Schmidt-Arenales",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/tfredsa",
    "WebsiteURL": "https://fredschmidt-arenales.net/",
    "Summary": "Untitled Ike Dike Film focuses on something that as yet only exists as an idea: a giant movable gate in the ocean near Houston, spanning from Galveston Island to the Bolivar Peninsula, intended to protect vulnerable property, corporations, residents, and infrastructure from the increasingly catastrophic hurricanes which sometimes strike the region. To anticipate  the future monolith, the film investigates the systems that determine if it will be built: the invisible lines designating the start of the beach, 3D models tracking the loss of landmass, species density, and water flows, and political and economic narratives that privilege oil companies over people."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Fresh Arts",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$61,593.00",
    "FacebookURL": "facebook.com/freshartsorg",
    "InstagramURL": "instagram.com/freshartsorg",
    "WebsiteURL": "www.fresharts.org",
    "Summary": "Fresh Arts is an arts service organization positioning local artists for success through professional development and artist-centered public programming.  We manage Arts District Houston (ADHou) and commission public art projects as career opportunities for local artists that increase access to free arts programming in the First/Sixth Wards. We seek support for 2023 ADHou programming: 1) SpaceTaking Artist Residency, where local artists innovatively utilize public space/stage events; 2) ADHou Welcome Center, where visitors see local artists' exhibitions and learn about the area's arts activities; and 3) free performances celebrating Make Music Day in June."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Frewuhn",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/frewuhn/",
    "WebsiteURL": "www.frewuhn.com",
    "Summary": "From October 13 through October 15, multidisciplinary visual and performing artists Frewuhn and Monae Jacobs, will present a three-part hybrid (live and digital performance art installation) \"The Black Galactic.\" The free performance will include an in-person and digital artist conversation, journal session (in-person and digital) and live streamed performance at Buffalo Bayou Park Cistern. This performance is an opportunity for participants to assess how the pandemic has left a \"black hole,\" that has altered the way we perceive and interact with reality while also confronting the beauty in the unknown through sound, reflection and visual art projection and digital simulation."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Friends of River Oaks Theatre",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "http://www.facebook.com/FriendsofRiverOaksTheatre",
    "InstagramURL": "https://www.instagram.com/FriendsOfRiverOaksTheatre",
    "WebsiteURL": "www.friendsofriveroakstheatre.org",
    "Summary": "The River Oaks Theater is reopening as a theatre. With the help and partnership of community based non-profit Friends of River Oaks Theatre it will be able to operate as a cinema centric Art House and community arts center. In addition to programming and marketing, Friends is working on producing a virtual platform to present programs, panels, workshops, and monthly podcasts. The monthly podcast FRIENDS ON FILM, AND OTHER CREATIVE MISCHIEF will have program related guests, arts program announcements, reviews, cinema History, interviews, and readings."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Gabriel da Fonseca Santiago",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/GabrielSantiagoProject",
    "InstagramURL": "instagram.com/gabrielsantiago",
    "WebsiteURL": "gabrielsantiagoproject.com",
    "Summary": "I would like to compose an original, multi-movement musical piece, roughly 60-80 minutes in length, to be premiered as a live concert for the public.  The theme of the concert program will be the unexpected, yet beautiful, intersection of the seemingly disparate genres of jazz, classical, and Brazilian music, as imagined by a Brazilian immigrant musician living in Houston.  The concert will be performed by a sizable chamber-style ensemble, featuring myself as well as other local musicians. The concert would take place in a church hall, such as St. Philip Presbyterian Church, on a Saturday evening in Spring 2023."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "God's Grace Community Church",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/godsgraceccpastor",
    "InstagramURL": "",
    "WebsiteURL": "https://godsgracecc.org/",
    "Summary": "The \"Christmas in the 4 4\" is a formal event that showcases national artists as they perform Christmas selections. This event is scheduled the third week in December every year on a Friday night at 7 PM. It is held at God's Grace Community Church, 9944 West Montgomery Road. After the concert, a reception is held in the fellowship hall. This concert will benefit the construction of a gym for our youth. This event will benefit the 44CYA which is 44 Christian Youth Association."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Gregory Audel",
    "Discipline": "Theater",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/GregAudel",
    "InstagramURL": "instagram.com/GregAudelStorytellerSpeaker",
    "WebsiteURL": "www.GregAudel.com",
    "Summary": "In 7-years, I've gone from Uber driver to one of Houston's most established storytellers. I've shared my autobiographical stories: on stage, winning 7 Moth Story Slams; via radio, as co-host for 6-years of Houston's \"So, What Your Story?\" on 90.1 KPFT Houston; and in front of audiences from Houston to Seoul, Korea. I've been featured numerous times in The Houston Chronicle and on NPR. \nNow, I'm ready to produce my one-man show, a performance at Houston's iconic, and refurbished, River Oaks Theatre, Thursday, March 30th that will showcase my most popular stories, featuring legendary Houstonians as I knew them."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Group Acorde",
    "Discipline": "Dance",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Gulf Coast: A Journal of Literature and Fine Arts",
    "Discipline": "Literary",
    "AwardAmount": "$30,664.00",
    "FacebookURL": "facebook.com/GulfCoastJournal",
    "InstagramURL": "instagram.com/gulfcoastjournal",
    "WebsiteURL": "instagram.com/gulfcoastjournal",
    "Summary": "Gulf Coast is a literary journal and reading series that brings together cutting-edge national and local arts. Writers and artists published in Gulf Coast are a unique blend of neighborly and international avant-garde. Selected by the journal's staff of Houston editors, Gulf Coast's content represents voices as diverse as the Gulf itself. Gulf Coast is published bi-annually while Reading Series events take place at Lawndale Art Center the third Friday of each month, Spring and Fall."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Ha Na Lee",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Henry Darragh",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "Hispanic Alliance for Performing and Audiovisual Arts",
    "Discipline": "Theater",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/HAPAAHTX",
    "InstagramURL": "https://www.instagram.com/hapaahouston/",
    "WebsiteURL": "https://hapaa.org",
    "Summary": "On the occasion of the 80th anniversary of the publication of Antoine de Saint-Exupery's work, The Little Prince; we want to honor the memory of the author and promote the knowledge of this magnanimous work in the new generations of artists and audience. Through a play that brings to the visual plane the philosophy proposed in this beautiful story. The performance is programed to be on June 16, June 17 and June 18 of 2023 On MECA East End's Theater , through this, it's also an attempt to bring the community closer to the artistic expressions of the Latino community."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Hispanic Alliance for Performing and Audiovisual Arts",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/HAPAAHTX",
    "InstagramURL": "https://www.instagram.com/hapaahouston/",
    "WebsiteURL": "https://hapaa.org",
    "Summary": "The project is based on a series of 8 sessions of online webinars where participants will be trained in the basic technique to write scripts and create the structure of storytelling. Each session will be 2 hours, starting with the creation of the character, timeline, analyzing and identifying each of the parts that make the structure of the script, establishing the differences between the literary script and the technical script and its particularities for the different practical fields. Ending with the actantial diagram, and character relationship scheme."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "HITS Theatre",
    "Discipline": "Performing Arts",
    "AwardAmount": "$71,071.00",
    "FacebookURL": "facebook.com/hitstheatre",
    "InstagramURL": "instagram.com/hitsbackstage",
    "WebsiteURL": "www.hitstheatre.org",
    "Summary": "Nestled in the Houston Heights, HITS Theatre empowers youth in grades K-12 through educational theater classes in acting, singing, dancing, and production. For 42 years, our compassionate approach engages student creators in professional training to find their passion and raise their unique voice. HITS Theatre after-school and summer programs are committed to providing an inclusive safe space using eco-conscious practices, mindfulness techniques, and fanciful storytelling - all culminating with a public performance. We believe this in-depth experience in the performing arts fosters creativity, confidence, and social-emotional learning on and off stage."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Homemade Hope for Homeless Children",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$30,600.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://www.homemadehope.org/",
    "Summary": "Homemade Hope brings creative enrichment to homeless and at-risk children in Houston through an after-school program focused on the culinary arts. Through weekly cooking classes, Homemade Hope's mission is to nurture and empower at-risk Houston children, teaching them how to cook nutritious foods, developing their life skills and engendering stability in their lives."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Hope Stone",
    "Discipline": "Dance",
    "AwardAmount": "$28,154.00",
    "FacebookURL": "facebook.com/hope.stone",
    "InstagramURL": "instagram.com/hopestoneinc/",
    "WebsiteURL": "hopestoneinc.org",
    "Summary": "From the short film created in the fall of 2022 - \"airs above the ground\" (the healing of equine therapy between horse and dancers) - a longer version called \"horse latitudes\" will premiere and combine live performance in the spring, 2023. These latitudes, 30 degrees north and south of the Equator, are high pressure areas of calm winds. The legend comes from ships sailing to the New World that would stall for weeks where crews, unable to sail, would throw horses they were transporting overboard to conserve water. \"horse latitudes\" looks at the question of healing over so much time."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Ballet",
    "Discipline": "Dance",
    "AwardAmount": "$819,141.91",
    "FacebookURL": "facebook.com/houstonballet",
    "InstagramURL": "instagram.com/houstonballet",
    "WebsiteURL": "www.houstonballet.org",
    "Summary": "Commencing in 2022, Houston Ballet's 53rd season will continue into 2023 featuring full-length narrative works like Romeo & Juliet, alongside numerous one-act ballets including world premieres from young Black choreographer Silas Farley in 2022, and female creator Cathy Marston in 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Boychoir",
    "Discipline": "Music",
    "AwardAmount": "$26,285.00",
    "FacebookURL": "facebook.com/HoustonBoychoir",
    "InstagramURL": "instagram.com/houston_boychoir",
    "WebsiteURL": "https://www.houstonboychoir.org",
    "Summary": "Houston Boychoir (HBC) provides rich musical experiences to the city of Houston, helping boys find their voice and serve their community with integrity. This coming season, HBC will continue its three anchor concerts: Sing4Life Choral Workshop and Concert, our Spring Concert at South Main Baptist Church, and our Winter Concert at St. Martin's Episcopal Church. Additionally, our ensembles regularly collaborate with Houston's performing arts organizations, and partner with local hospitals and retirement communities to ensure equal access to Houston's fine arts."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Houston Brass Quintet",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/theHBQ/",
    "InstagramURL": "https://www.instagram.com/houstonbrassquintet",
    "WebsiteURL": "www.houstonbrassquintet.org",
    "Summary": "HBQ would like to create a new work, City Beats, would be a second work to City Moves. This piece is a contemporary work for Brass Quintet and electronics, dedicated to the Underground Houston Hip Hop scene. Centered around Social Justice, we would like to start the commission with Houston BIPOC Composer Stephen Bachicha this fall, with a performance at Levy Park in the Spring."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Houston Brass Quintet",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Brass Quintet",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/theHBQ/",
    "InstagramURL": "instagram.com/houstonbrassquintet",
    "WebsiteURL": "www.houstonbrassquintet.org",
    "Summary": "HBQ has made significant growth in not only community support, income, demand for bookings and ability to sponsor flagship concerts but also growth in the need for marketing and administrative/organizational support. HBQ members Sarah Perkins and Russell Haehl volunteer personal time in addition to rehearsal and performances to provide these administrative needs. In order to meet HBQ's growth rates and continue providing Houston with diverse music HBQ would be able to use this grant to extend their contract with their social media manager, hire Sarah and Russell to work part-time to fulfill the necessary administrative needs and sponsor flagship concerts."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Center for Contemporary Craft",
    "Discipline": "Craft",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/crafthouston",
    "InstagramURL": "instagram.com/crafthouston",
    "WebsiteURL": "www.crafthouston.org",
    "Summary": "Since 2001, Houston Center for Contemporary Craft (HCCC) has established itself as an important cultural and artistic resource for both Houston and the nation�one of the few art venues in the country dedicated exclusively to the interpretation and presentation of craft. In service of its mission to advance education on the process, product, and history of craft, HCCC delivers innovative educational programs, a nationally recognized artist residency program, and thought-provoking exhibitions to place Houston at the forefront of the national conversation on contemporary craft. Its commitment to free programming serves to increase access to arts programming for all."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Center for Photography",
    "Discipline": "Visual Arts",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/houstoncenterforphotography",
    "InstagramURL": "instagram.com/hcponline/",
    "WebsiteURL": "https://hcponline.org/",
    "Summary": "In 2023, HCP will present 10 exhibitions and 10 public dialogues supporting these exhibitions. HCP will also offer over 150 onsite courses and workshops, and work with immigrant, refugee, and at-risk youth from Greater Houston. Exhibitions feature a diverse array of artists, and range from a newly commissioned site-specific installation examining environmental justice to youth-voice-focused shows by Houston-area high school students. By prioritizing global-majority perspectives and program accessibility, HCP will further its mission to use photography as a tool that shapes salient cultural, political, and aesthetic discourse."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Houston Chamber Choir",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Children's Chorus",
    "Discipline": "Music",
    "AwardAmount": "$27,528.00",
    "FacebookURL": "facebook.com/HoustonChildren",
    "InstagramURL": "instagram.com/HoustonChildrensChorus",
    "WebsiteURL": "www.houstonchildren.org",
    "Summary": "Houston Children's Chorus is the community's premiere choral & performing arts organization for children in grades two through eight by annual audition. This 150-voice Chorus rehearses weekly in the Museum District and participates in or presents over 40 performances around the greater Houston area each year. They are regularly featured in civic & cultural events throughout the city and have performed for the President of the United States on 33 occasions. They are in demand in the recording studio for album projects and radio and television ads, most notably the Blue Bell Ice Cream commercial and Coca-Cola (Mexico and South America)."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Choral Society",
    "Discipline": "Music",
    "AwardAmount": "$4,657.00",
    "FacebookURL": "facebook.com/houstonchoralsociety",
    "InstagramURL": "instagram.com/houstonchoralsociety",
    "WebsiteURL": "houstonchoral.org",
    "Summary": "Houston Choral Society is seeking support for the FY/Concert Season 2023 to perform 4 concerts- in February 2023, May 2023,  September 2023 and December 2023.  These concerts will be presented at Tallowood Baptist Church and The Foundry United Methodist Church.  The February concert will feature a  Broadway themed evening .  The May concert will feature Dan Forrest's \"Jubilate Deo\" followed in August with a masterwork to be determined and the traditional Christmas concert at The Foundry featuring traditional Christmas carols and inspiring Christmas classics."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Houston Climate Justice Museum",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/ClimateJusticeMuseum",
    "InstagramURL": "https://www.instagram.com/climatejusticemuseum/",
    "WebsiteURL": "",
    "Summary": "The Houston Climate Justice Museum (HCJM), founded by Tiffany Jin and Aaron Ambroso, is proposing the project, \"Climate Migration: Displacement, Travel, Home,\" a series of art installations, expert panels, and public engagements that aim to deepen understandings and experiences of climate migration in Houston. Running from September 2022 to December 2022, the undertaking and its ensuing free-to-the-public events and exhibits will take place at several sites: the Museum (located in the Greater East End), the Solar Studios at Rice University, CHAT and BakerRipley. The proposal includes working with a distinguished group of artists, academics, and organizations."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Contemporary Dance",
    "Discipline": "Dance",
    "AwardAmount": "$15,476.00",
    "FacebookURL": "facebook.com/houstoncontemporary",
    "InstagramURL": "instagram.com/houstoncontemporary",
    "WebsiteURL": "https://www.houstoncontemporary.org/",
    "Summary": "Houston Contemporary Dance Company is a fresh, young contemporary dance organization committed to making its work accessible to the Houston populace.  Our 2023 Season will be highlighted with compelling works by exceptional artists including Peter Chu, Alexander Anderson, and Kia Smith, and will be presented at a range of Houston venues including DUe at the Heights Ironworks, a collaboration with ROCO at the Rothko Chapel, our Spring Concert in April,  educational performance of \"Moving Myths\" in June and Fall Concert in October to all be presented at the Hobby Center for the Performing Arts."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Grand Opera",
    "Discipline": "Performing Arts",
    "AwardAmount": "$839,305.16",
    "FacebookURL": "facebook.com/houstongrandopera/",
    "InstagramURL": "instagram.com/hougrandopera/?hl=en",
    "WebsiteURL": "www.houstongrandopera.org",
    "Summary": "Houston Grand Opera requests support of our 2023 season, which will draw over 70,000 people to the Wortham Theater Center in Houston's downtown Theater District. From January through December 2023, audiences can enjoy new and innovative productions of Mozart's The Marriage of Figaro, Massenet's Werther, Puccini's Tosca, Strauss's Salome, Verdi's Falstaff, plus two thrilling world premieres: Jake Heggie/Gene Scheer/Jawole Zollar's Intelligence and Will Liverman/ DJ King Rico's The Factotum. From families coming from the suburbs to international arts tourists, HGO's season appeals to audiences of all ages and backgrounds, with stories told by a diverse set of artists and creators."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Latin American Philharmonic",
    "Discipline": "Music",
    "AwardAmount": "$45,453.00",
    "FacebookURL": "facebook.com/Houston-Latin-American-Philharmonic",
    "InstagramURL": "instagram.com/houstonlatinphil",
    "WebsiteURL": "www.houstonlatinphil.org",
    "Summary": "These are exciting times for the Houston Latin American Philharmonic, the only full-size professional orchestra in the United States created to promote and elevate Latin American music.\nThe Houston Latin Phil celebrates its 10th anniversary with three gala concerts as follows: Mother's Day Serenade on May 14 - 6:30 pm; Viva Latin America on October 14 - 8:00 pm; and Latin Christmas on December 1 - 8:00 pm.  Led by maestro Glenn Garrido, the HLAP is comprised by 52 professional musicians performing traditional rhythms like Joropo, Zamba, Tango, Danzon, Ranchera, Bolero and more -music that makes you dance even in your seats."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "Houston Latino Film Festival",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Houston Latino Film Festival",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Masterworks Chorus",
    "Discipline": "Performing Arts",
    "AwardAmount": "$9,854.00",
    "FacebookURL": "facebook.com/HoustonMasterworksChorus",
    "InstagramURL": "instagram.com/Houston_Masterworks_Chorus",
    "WebsiteURL": "https://houstonmasterworks.org/",
    "Summary": "The Houston Masterworks Chorus (HMC) celebrates 36 years of bringing the world's choral masterworks to Houston. The volunteer, auditioned chorus of 60 performs 7 distinctive concerts to broaden community involvement and build singer musicianship. Creative partnerships include: The Houston Boychoir, Tianna Hall and The Houston Jazz Band, Space City Sound, and HISD Inertia Modern Dance Team. High school juniors and seniors compete in the HMC Young Singer Competition and students singing with HMC earn community service hours. This spring HMC co-hosts \"Illuminare\" a TX premier by Elaine Hagenberg - 200 singers. In June we perform in Houston's Sister City, Huelva, Spain."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Museum of African American Culture",
    "Discipline": "Museum",
    "AwardAmount": "$55,805.00",
    "FacebookURL": "facebook.com/HoustonMuseumofAfricanAmericanCulture",
    "InstagramURL": "instagram.com/houstonmaac",
    "WebsiteURL": "www.hmaac.org",
    "Summary": "The Houston Museum of African American Culture proposes a 6-week artist residency at Worthing, Wheatley, and Willowridge High Schools around the themes explored in April Frazier's Frame of Reference Exhibition presented at HMAAC from December 2021 through April 2022. The residency will inspire students to explore their family history, their own place in society, and what being part of a community means to them. The residency concludes with a culminating display at HMAAC or  the High School that showcases their work and experiences as participants in the program. Residencies will take place in January, March and October, 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Symphony",
    "Discipline": "Music",
    "AwardAmount": "$814,770.29",
    "FacebookURL": "facebook.com/houstonsymphony",
    "InstagramURL": "instagram.com/housymphony",
    "WebsiteURL": "www.houstonsymphony.org",
    "Summary": "Now in it's second century, the Houston Symphony stands proudly as one of the oldest performing arts organizations in Texas and on of the largest, most established in Houston. During the 2022-23 Season, we will continue our tradition of serving as the musical heart of Houston, offering audiences 18 Classical concert weekends, nine POPS concert weekends, nine Symphony Specials, four Family concert weekends, five performances at the Cynthia Woods Mitchell Pavilion, four concerts at Miller Outdoor Theatre, six Community Concerts at venues throughout the city, and 20 concerts for area students."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Youth Symphony",
    "Discipline": "Music",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/houstonyouthsymphony/",
    "InstagramURL": "instagram.com/houstonyouthsymphony/",
    "WebsiteURL": "www.houstonyouthsymphony.org",
    "Summary": "Through a youth orchestra program that brings together 415 students�selected through audition and placed in one of five orchestras�Houston Youth Symphony (HYS) provides professional coaching and performance opportunities for musicians, including six public concerts (afternoon and evening performances) at Rice University's Shepherd School of Music on February 5, May 7, and November 13. HYS musicians are ages 7-19, and come from 23 school districts in 7 counties, representing the best young musicians in the region. HYS provides free quality music instruction to 250+ children annually through its Coda Music and Melody Programs for low-income families in targeted Houston neighborhoods."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Houston Zoo",
    "Discipline": "Museum",
    "AwardAmount": "$630,080.76",
    "FacebookURL": "facebook.com/houstonzoo",
    "InstagramURL": "instagram.com/houstonzoo",
    "WebsiteURL": "https://www.houstonzoo.org",
    "Summary": "The Houston Zoo connects communities with animals to inspire action to save wildlife and is committed to being a leader in the global movement to save animals in the wild. We are home to nearly 5,500 animals representing more than 600 species to whom we provide the highest standard of care and welfare. In 2021, we welcomed than 1.9 million guests who experienced our animals and ecosystems, and through their admission ticket or membership, helped us fund the protection efforts of our animals' wild counterparts. We support more than 30 wildlife conservation projects in Texas and around the world."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "India House",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/indiahouse/",
    "InstagramURL": "instagram.com/indiahousehouston",
    "WebsiteURL": "https://www.indiahouseinc.org",
    "Summary": "India House is a non-profit organization serving Greater Houston through a number of charity and welfare initiatives. We also remember and celebrate our Indian arts, culture, and heritage. We will hold Diwali, the Festival of Lights -- a celebration of the victory of good over evil -- on a tentative date in November 2023. It will take place on our outdoor premises of 9.6 acres and in our building of 30,000 square feet. We will unite dancers, musicians, visual artists, and vendors. We are excited to share the joy of this festival with Houstonians from a wide variety of backgrounds!"
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Indian Film Festival of Houston",
    "Discipline": "Film",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/iffhinc/",
    "InstagramURL": "instagram.com/iffhinc/",
    "WebsiteURL": "https://iffhinc.org/",
    "Summary": "The Indian Film Festival of Houston (IFFH) offers a unique opportunity to learn about India's multi-faceted culture and long history of film-making. IFFH 2022 will showcase a combination of feature films, shorts and documentaries and will offer jury awards for the Best Films, special recognition to outstanding talents and industry leaders, as well as, periodic community events promoting broad cultural exchanges throughout the year."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Indo-American Association",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$21,617.00",
    "FacebookURL": "facebook.com/iaahouston",
    "InstagramURL": "instagram.com/iaa_houston",
    "WebsiteURL": "https://www.iaahouston.org/",
    "Summary": "IAA's 2023 season will deliver 6-10 spectacular cross-cultural performances of music, dance, and drama spotlighting artists from the Indian subcontinent to Houston audiences and visitors. From January to December 2023 events are held at Houston's top venues in the Theater District, the Museum District and MATCH in midtown contributing to Houston's cultural nightlife. IAA performances attract all segments of Houston's diverse arts and cultural audiences and enjoys a strong base of season ticket subscribers and patrons."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Inprint",
    "Discipline": "Literary",
    "AwardAmount": "$90,000.00",
    "FacebookURL": "facebook.com/inprinthouston",
    "InstagramURL": "instagram.com/inprinthouston",
    "WebsiteURL": "www.inprint.org",
    "Summary": "Inprint will advance its mission \"to inspire readers and writers\" through programs that champion the power of storytelling in Houston. We will present 10-15 nationally/internationally acclaimed authors in 10+ accessible readings for adults and children at leading performance venues; offer 50+ year-round writing workshops for aspiring writers, senior citizens, K-12 teachers, healthcare professionals, veterans, and the incarcerated at locations throughout the city; conduct 10+ poetry busking events, a new season of a Latinx-focused podcast, 3+ Spanish reading series events, and several collaborations, and support local writers and writing students through fellowships, prizes, and paid employment."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Interfaith Ministries for Greater Houston",
    "Discipline": "Public Art",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "facebook.com/InterfaithMinistries",
    "InstagramURL": "instagram.com/interfaithministries",
    "WebsiteURL": "www.imgh.org",
    "Summary": "For Martin Luther King Day 2023, Volunteer Houston will implement the second annual Martin Luther King Heroes Project, which will engage 150 to 175 volunteers in painting a mural designed by a local African American artist at four sites throughout Houston. Volunteers will complete 12�12 \"paint by numbers\" canvases that will be pieced together to create a larger, final mural. The murals will be donated and installed at the site of four local organizations where Dr. King's message of equity and inclusion will serve as a daily reminder to \"do your part\" to improve our society."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Ishida Dance Company",
    "Discipline": "Dance",
    "AwardAmount": "$23,292.00",
    "FacebookURL": "facebook.com/Ishidadancecompany/",
    "InstagramURL": "instagram.com/Ishidadance/",
    "WebsiteURL": "www.ishidadance.org",
    "Summary": "ISHIDA is presenting \"if not, winter\" thought-provoking world premieres at MATCH in collaboration with Hope Stone, ISHIDA will teach a master workshop for their disadvantaged students and provide them with complimentary tickets.  ISHIDA will also provide complimentary tickets to Gracewood, which supports single mothers, and Family-to-Family Network, which supports families with children with intellectual disabilities. ISHIDA will premiere new works that intimately explore victim and rescuer archetypes and how one might break that cyclical pattern. An additional fall performance is contemplated contingent on funding."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Ivan Brave",
    "Discipline": "Literary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Ivan.brave.author/",
    "InstagramURL": "instagram.com/ivanbrave_",
    "WebsiteURL": "https://www.ivanbrave.com",
    "Summary": "Houstonians worry about rising prices, crime, and reproductive rights. My novel Awake & Asleep tackles these issues, through the story of two long lost Houstonians who reunite on the night of a flood. With HAA's support, I will complete the novel in May; present the opening chapter at Brazos bookstore in June; and adapt the final chapter for the stage, for presentation at Latino Cultural Center in July and at Worthing High School in the fall."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "J.E. Hernandez",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$14,700.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/jehernandezhtx",
    "WebsiteURL": "jehernandez.com",
    "Summary": "Desert Shelter: Immigrant Bodies at the Sonoran Crossing, is a 24-minute multi-disciplinary program that portrays the hardships of migrants crossing the U.S.-Mexico border via the Sonoran Desert pass. This crossing has resulted in thousands of deaths, with human remains disappearing into the desert floor. The title alludes to one of the last portions of this particular desert crossing: as migrants approach American civilization, their condition worsens. Desperately clinging to life, they seek out bushes�curled by the desert heat�as shelter. The program features musicians from The Ponce Project, and a dance choreographed and produced by NobleMotion Dance specifically for this project."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Jacob Schafer",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/jacob.schafer.3760",
    "InstagramURL": "",
    "WebsiteURL": "jacobschaferviolin.com",
    "Summary": "In \"Offshoots,\" I will perform and record pieces for solo violin by established composers, paired with newly commissioned pieces by up-and-coming composers. By presenting works by Gabriela Lena Frank, Michael Friedmann, Nicky Sohn, and Max Vinetz, \"Offshoots\" showcases composers with Houston connections, demonstrates the diverse influences each brings to the table, and celebrates the ties that binds us all together. Each piece will receive a recording and online premiere between October 2022 and March 2023, as well as an in-person live performance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Jahrel Pickens",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Jake Eshelman",
    "Discipline": "Visual Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "January Bones",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/januaryonline",
    "InstagramURL": "www.instagram.com/januarybones_",
    "WebsiteURL": "",
    "Summary": "January Bones: Bayou Dolls Ball\" is an exhilarating performance of drag, vogue, pole and contemporary dance fused with high fashion, interactive art and avant-garde concepts. To highlight the vogue ballroom scene and will be open to participants of all experience levels to compete in various categories such as Catwalk, hands performance, floor performance and Body. The vogue ball will spotlight local creatives and HIV organizations and promote HIV awareness, education, and access to honor the LGBTQIA+ community and those affected by HIV."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "January Bones",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/januaryonline",
    "InstagramURL": "instagram.com/januarybones_",
    "WebsiteURL": "",
    "Summary": "January Bones: For Us by Us\" is a multidisciplinary program featuring interactive art, performances of drag and music centering queer and Southern artists of color. The performance is designed to offer new experiences for patrons of Houston who want to immerse themselves in the local art renaissance, featuring local creatives and HIV organizations and to promotes HIV awareness, education, and access to honor the LGBTQIA+ community and those affected by HIV."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Jason Leal",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Jasonleal",
    "InstagramURL": "instagram.com/Jasonwleal",
    "WebsiteURL": "Spindletopmovie.com",
    "Summary": "Break a Leg is a film about a director making his first horror feature. When the cast and crew go out into the woods to film, people start dying for real. The project will be filmed in Houston and include nods to local culture including Marvin Zindler."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Jaylin Vinson",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "The project includes writing an original 15 - 20 minute operatic retelling of an African mythological folktale with an educational, interactive presentation. The intent of this project is to bring opera and this method of storytelling to audiences that would not be exposed nor have ready access to programs of this type. Venues included Project Workshop, an after school program for youth in houston; Alta arts, a visual art gallery in the third ward, and Project Row Houses. All performance will be between April 23rd - May 6th."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "JD Pluecker",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "www.jdpluecker.com",
    "Summary": "The Unsettlements: Poetry & (Un)Monuments is the 2023 chapter of a long-term series of projects that delve into sites of memory and ancestry, particularly in Houston and across Texas, locations where seven generations of my mainly German settler-colonial family have lived since the early nineteenth century. This project (at the intersections of Literary Arts, Social Practice Art, and Historical Preservation) will gather people in outdoor monument spaces for collective poetry readings, potlucks and conversation 3 times in the spring and 3 times in the fall to read crucial poets together out loud, like Lorenzo Thomas, Pat Parker and Gloria Anzaldua."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Jessi Bowman",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "Jesus Cantu Medel",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$9,900.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "John P. McGovern Museum of Health & Medical Science",
    "Discipline": "Museum",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/thehealthmuseum",
    "InstagramURL": "instagram.com/thehealthmuseum",
    "WebsiteURL": "www.thehealthmuseum.org",
    "Summary": "As the nation's only interactive health museum, a proud member of the Association of Science - Technology Centers (ASTC), and the only Smithsonian Affiliate Museum in the Houston Museum District, The Health Museum is a culturally significant educational asset that attracts learners of all ages. The Museum offers a unique perspective on the human experience through the lens of health, medical science, art, technology and innovation."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Jose Diaz",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/JoseAntonioDiazMusic",
    "InstagramURL": "",
    "WebsiteURL": "www.joseantoniodiaz.com",
    "Summary": "Voces Eternas\" is the title of a multi-movement music composition I will create for an expanded jazz orchestra. This work seeks to capture musically the emotions involved in the human experience of finding one's truth about their hearts and souls as it relates to the many conflicts we have in our communities, especially those underserved and under-represented. \"Voces Eternas\" will be performed live on November 14, 2023, at 8 PM at The Match located at 3400 Main Street, Houston, TX 77002, by young emerging BIPOC and LGTBQIA+ artists. The performance will be audio and video recorded."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Joshua Andrews",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/THRIVERMUSIC",
    "InstagramURL": "instagram.com/thriver/",
    "WebsiteURL": "https://iamthriver.com",
    "Summary": "With the HAA grant I will finish filming a film series \"From A Boy to A Man\". This series will be a three Act 7-10 mins piece series that will be shot and presented virtual in Houston, TX. Josiah is a teenager growing up without the guidance of his father. He decides to not let his negative circumstances get the best of him, but instead channels his emotions and energy thru the creation of music and masters his secret rap talents. HAA will support the production team, 8 actors, and equipment to complete the film."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Joshua Gottlieb-Miller",
    "Discipline": "Literary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/JoshuaGottlieb-Miller",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Houston is a great city of and for artists�livable, diverse, full of supportive institutions�but Houstonians are un-aware of the many artists around them working ordinary jobs. I am a documentary poet; I'm writing a chapbook based on interviews with working artists in Houston. I plan to host a brief series of readings featuring those working artists alongside my writing (I have in mind a musician, director, painter, and novelist, to start, who come from various backgrounds and live in various parts of Houston�each reading would be unique to each working artist and in their neighborhoods: Montrose, Third Ward, Fifth Ward�)."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Joshua Pazda",
    "Discipline": "Literary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Josh Pazda",
    "InstagramURL": "instagram.com/joshpazda",
    "WebsiteURL": "www.pazdabutler.com",
    "Summary": "Slated for early 2023, this project will consist of the publication of the first monograph dedicated to the drawings of Texas artist Tony Feher. A relatively unknown but crucial aspect of the artist's practice, the drawings serve as the key to fully comprehending the depth of Feher's production. The book will serve as a vital contribution to both the artist's literature as well as drawing in the 21st century overall. An exhibition at Pazda Butler Gallery in Houston will demonstrate a key argument in the book that the artist's sculptures are examples of drawing in space with three-dimensional material."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "Justin Grant",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/justinearlgrant",
    "InstagramURL": "https://www.instagram.com/justinearlgrant/",
    "WebsiteURL": "http://justinearlgrant.com/",
    "Summary": "To celebrate the line as an essential conceptual element in the visual arts, a year of exhibitions and events is planned that includes a program of educational activities for the community and students. The activities will take place in Sabine Street Studios, part of the Sawyer Yards located in the established Arts District Houston. The programs coincide with the formation of a new exhibition space called East Corridor Gallery, or ECG, designated exclusively for the exhibition of local artists and creatives whose work emphasizes the practical and conceptual elements of the line and its many facets."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Karen Navarro",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/KarenNavarroPhotography/",
    "InstagramURL": "instagram.com/karennavarroph/",
    "WebsiteURL": "https://www.karennavarroph.com",
    "Summary": "My Ancestors\" by Houston-based, Argentina-born artist Karen Navarro is a visual art exhibition featuring  a series of portraits that use collage to visually represent the fluidity and abstract nature of identity. Navarro creates colorful deconstructed portraits reimagining Indigenous beauty to retake ownership of her cultural identity.\n\nFree and open to the public, the exhibition will premiere in Houston, Texas at Silver St Studios Gallery in Sawyer Yards on June 16th and will run until July 28th, 2023."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Katrina Moorhead",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/KatrinaMoorhead",
    "InstagramURL": "instagram.com/katrina_moorhead",
    "WebsiteURL": "www.katrinamoorhead.net",
    "Summary": "Everything Island comprises an immersive environment of sculptural objects, installation and works on and of paper which together reimagine aspects of the natural world through an odd lens, offering a refreshing escape from the materialism of the contemporary world to a more human spiritualism, but with a sense of humor. The works will reference otherworldly entities and apparitions, flora and fauna, culled from contemporary video games, Victorian fairy tales and traditional Irish fairy folklore. Programming will occur at Inman Gallery in September/October 2023, with public events involving a folklorist and a horticulturalist. Everything Island will culminate in a small publication."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Keda Sharber",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/imagesbypapillon",
    "InstagramURL": "www.instagram.com/imagesbypapillon",
    "WebsiteURL": "www.imagesbypapillon.com",
    "Summary": "UNBOUND is a series of 5 short documentaries that explore what it means to reject limiting beliefs and embrace a life of possibility. Each film introduces viewers to a diverse array of Houston residents who are shattering stereotypes in 1) family & relationships, 2) career & education, 3) arts & entertainment, 4) community & culture and 5) health & wellness. Fine art portraits will be created of each film subject for exhibition and an online gallery as an accompaniment to the films, which will be screened in person and made available online. The screenings, exhibit and talkbacks will occur monthly from May-September 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Kinetic Ensemble",
    "Discipline": "Music",
    "AwardAmount": "$4,109.00",
    "FacebookURL": "facebook.com/kinetictheensemble",
    "InstagramURL": "instagram.com/kineticensemble",
    "WebsiteURL": "https://www.kineticensemble.org",
    "Summary": "Kinetic continues its commitment to amplifying diverse, under-represented, and newly composed classical music with 3 performances at MATCH on March 3, 2023, May 26 2023, and October 13, 2023, plus a debut performance at Asia Society Texas on January 25. Key collaborators include our current Composer-in-Residence, Nicky Sohn."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Korean-American Society of Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$3,045.00",
    "FacebookURL": "facebook.com/KASHouston/",
    "InstagramURL": "instagram.com/kashouston/",
    "WebsiteURL": "www.kfesthouston.com",
    "Summary": "KASH's annual Korean Festival in October provides a large platform for Houston dancers and musicians in the traditional and modern Korean arts space. KASH also connects Korean/Houstonian performers with various local events throughout the year (eg. Asia Society AsiaFest, Summer Seoul Fest Pearland, Magical Winter Lights, and Corporate Diversity Events at NASA/City of Houston)."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Kristina Koutsoudas",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Kristina Koutsoudas",
    "Discipline": "Literary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Divine-Dances/wfacebook.com/kristinakoutsoudas",
    "InstagramURL": "instagram.com/MnemosyneInternational",
    "WebsiteURL": "divinedances.com",
    "Summary": "Integrating audience feedback from my 2020 SACI project, I propose the final editing and expansion of \"Inara and the World Tree: An Anthology of Tales with 2 or 3 additional tales that address a \"call to action\" concerning the stewardship of the land/contemporary challenges of the pandemic and climate change, the edits of all tales, and the conversion of these tales into professionally recorded/marketed audio podcasts/shorts to reach audiences across time and geographies.  Readings will be shared through a variety of digital mediums (see below) and in person, if safe.  A diversity of venues will reach a diversity of audiences."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Kurt Stallmann",
    "Discipline": "Multimedia",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://music.rice.edu/faculty/kurt-stallmann",
    "Summary": "I propose creating \"American Landscape Studies,\" a twenty-minute sound-image composition that combines a subjective, fragmented vision of the natural world with sounds that resonate and respond to the images' complex patterning, density, and reflections. This work represents the sixth collaboration between filmmaker Alfred Guzzetti and composer Kurt Stallmann since 2005. Our previous sound-image works have been featured at venues in the United States, Europe, and Asia. Alison Weaver, Director of the Moody Center for the Arts, is excited to support this project by sponsoring a free, public premiere at the Lois Chiles Theater in the fall, 2023 (exact date TBD)."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Kyle Fu",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "H.O.F is a festival is created and to be enjoy for the whole family (Adults & Kids) during the spring timer (April/2023). The festival included an Origami art exhibition and 5 workshops (kids & adults): 2 basic Origami workshops, 2 advance Origami workshops, and an awarded \"Foldtstic\" documentary film (18 minutes) on Origami master artist Kyle ( Te - Jui) Fu and  meet & greet (Q & A) the Origami masters session after film screening. Location: Chinese Community Center ( C.C.C.)"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "La Speranza",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "La Speranza",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/lasperanzamusic",
    "InstagramURL": "",
    "WebsiteURL": "https://la-speranza.com/",
    "Summary": "La Speranza is a chamber music ensemble that evokes the vibrant life of the past through historically informed performances and lectures in communities in Houston. The group recently received their 501c3 designation, and the Support for Organizations grant would specifically cover their program printing, liability insurance, bookkeeping, and website maintenance costs in 2023."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Lawndale Art and Performance Center",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Lawndale Art and Performance Center",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$58,800.00",
    "FacebookURL": "facebook.com/LawndaleArtCenter",
    "InstagramURL": "instagram.com/lawndaleartcenter",
    "WebsiteURL": "www.lawndaleartcenter.org",
    "Summary": "Since 1979, Lawndale has thrived at the grassroots level in the city of Houston, the most ethnically diverse city in the United States and a dynamic setting for interacting with and understanding our world. Lawndale is committed to supporting the creation, exhibition, and discussion of contemporary art, with a focus on promoting the work of artists from Houston, Texas, and the Gulf Coast region. Our year-round programming, always free and open to the public, is a vital platform for artists to exhibit their work to audiences across Houston and the region."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Leslie Gauna",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "This project's goal is to narrate and share the complex experience of immigration. We solicit funds to publish an anthology consisting of twelve short stories. We are a group of writers from different Latin-American regions that call Houston home. The need to express in our original language to the vast diaspora of Spanish speaking people also affirms a language that has been part of the U.S history. The ultimate goal is to showcase the wide spectrum of emotions, feelings, values, culture, and tensions that is implied in the universal act of moving from one place to another."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Lone Star Flight Museum",
    "Discipline": "Museum",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "facebook.com/lonestarflightmuseum",
    "InstagramURL": "instagram.com/lonestarflightmuseum/?hl=en",
    "WebsiteURL": "facebook.com/lonestarflightmuseum",
    "Summary": "Lone Star Flight Museum (LSFM) offers a unique museum experience that utilizes history, science, and art to engage multigenerational audiences. The museum features the rich history of aviation, focusing primarily on the role the state of Texas has played in the evolution of aircraft from the Wright Brothers to NASA. LSFM is home to over two dozen historic flying aircraft, including rare planes such as the Houston-built Anderson-Greenwood AG-14, Howard 250, and the Douglas DC-3. Offering an engaging public programing, LSFM is one of the top flight museums in the US with over 45,000 annual visitors."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Loop38",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/loop38/",
    "InstagramURL": "https://www.instagram.com/loop.38/",
    "WebsiteURL": "",
    "Summary": "Loop38 will record and digitally premiere \"Glitter, Doom, Shards, Memory,\" the third string quartet by Pulitzer Prize-winning composer Shulamit Ran. This work was inspired by the life and works of Matthew Nussbaum, a German-Jewish painter who perished at age 39 in the Holocaust. The recording will be live-streamed in an interactive digital event that memorializes the victims of war and oppression and highlights the important role of music and art in society."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Loop38",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/loop38/",
    "InstagramURL": "instagram.com/loop.38/",
    "WebsiteURL": "facebook.com/loop38/",
    "Summary": "Loop38 is an emerging ensemble that is led by musicians who are passionate about new music. Our mission is to bring Houstonians together around artistic experiences that are innovative, stimulating, and culturally relevant. We embrace opportunities for diverse voices to share their stories, and we believe in the power and responsibility of artists to forge robust dialogue with our local and global communities."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Lotus Bermudez",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "I want to create a series of sculptures that will be the world's largest clay tools that will be displayed outside at my studio, Third Coast Clay, visible to the public. This project is to celebrate the ceramics arts community in Houston that I have joyously been involved with for over 26 years. If approved, the process will be documented and shared online as well as in person."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Magnolia City Brass Band",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/magnoliacitybrassband",
    "InstagramURL": "www.instagram.com/magnoliacitybrassband",
    "WebsiteURL": "WWW.MagnoliaCityBB.org",
    "Summary": "Houston's Finest Brass Band Composer!\" will feature works of great brass band composers: the United Kingdom's Philip Sparke and Malcolm Arnold, as well as Houston's Dr. William Brusick. This will demonstrate that Brusick's works are of the musical stature of the finest British compositions."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Main Street Theater",
    "Discipline": "Theater",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/MainStreetTheaterHouston",
    "InstagramURL": "instagram.com/mst_houston",
    "WebsiteURL": "www.mainstreettheater.com",
    "Summary": "Main Street Theater's upcoming 2022-23 Season (Sep. 1, 2022 - Aug. 31, 2023) will present six MainStage productions, including three regional premieres, at our Rice Village theater. Our Theater for Youth, presented at the MATCH in midtown, will produce six family-friendly productions designed for elementary and middle school students. Main Street Theater also hosts numerous free community programs that allow audiences to interact with our actors and artists, including our Part of the Art series that provides an intimate behind-the-scenes look at our productions."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Mary Johnson",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/marygjohnson/",
    "InstagramURL": "instagram.com/mgjohnsn/",
    "WebsiteURL": "marygracejohnson.com",
    "Summary": "My proposal is to commission and premiere a concerto for violin and dancers from Houston-based Korean composer Nicky Sohn, inspired by graduates of the Women's Home Houston, an addiction rehabilitation center. The premiere will take place at MATCH Houston on March 3rd, 2023, featuring the innovative choreography of African-American dancer/choreographer Kayla Collymore,  myself as violin soloist, and an all-female cast of dancers. Entitled \"Her,\" the ultimate goal of this project is to promote the work of talented young women in the arts while providing a voice for marginalized women from all walks of life."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Masumi Kataoka",
    "Discipline": "Craft",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/MasumiKataoka",
    "InstagramURL": "",
    "WebsiteURL": "masumikataoka.com",
    "Summary": "I will be making a series of wearable art that are an extension of a series that I have been working since last year called \" out of longing\". They are made of different animal parts, mainly of cicadas and snails since they share similar symbolism as cycles and re-birth. They are transformed into copper and enamel, I am intending to extend different animals in the new work to add different meanings in my work. Besides the objects, I want to create a background movie and a music collaborated with musicians."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Mecca Dishmon",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "The Celestial Salutations is a healing arts series that includes M3CCA's celestial being abstract artworks -- a series of characters called celestial beings that have a different purpose that will oversee different workshops personas, and be showcased November 4th, 2023 at The Big Release event. The Big Release is an interactive concert and artistic healing experience that will showcase the complete collection of celestial being artworks and create a creative safe space for the community."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Mel House",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Inbetweening is a semi autobiographical feature length darkly comedic film that revolves around my last two decades operating as a multiracial filmmaker. We began principal photography in the Spring of 2022, and completed that on March 25, 2002. The film includes other mixed media approaches, such as animation, puppetry, and musical theatre, so our post production pipeline will be quite complex. However, I am confident that all the elements will coalesce into a compelling and unique piece. Post production timeline is projected to be completed by mid 2023."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Melissa Aytenfisu",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Melissa Aytenfisu",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/AytenfisuArt",
    "WebsiteURL": "www.aytenfisuart.com",
    "Summary": "My project is a visual arts exhibition titled 'Covid Masks/ Unmasks'. Through a series of prints, mixed media pieces, paintings, and an interactive installation, my exhibition will explore ways in which Covid 19 has exposed social and economic inequities in Houston."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Mercury Chamber Orchestra",
    "Discipline": "Music",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/mercuryhouston",
    "InstagramURL": "instagram.com/mercuryhouston",
    "WebsiteURL": "www.mercuryhouston.org",
    "Summary": "Baroque and Classical favorites come to life in Mercury's Downtown Series concerts which are performed at the Wortham Center including: Chopin's Letters; Bach's Coffee Cantata; Tchaikovsky's Serenate; Beethoven's Seventh. Mercury's Neighborhood Series is held at four distinct venues including MATCH, Memorial Drive Presbyterian Church, Museum of Fine Arts Houston and The Dosey Doe and features three intimate concerts of inspiring repertoire including: Klezmer Night, a lively journey featuring the musical traditions of Eastern Europe."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Michael Chavez",
    "Discipline": "Design",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/Dynastyeez",
    "InstagramURL": "instagram.com/Dynastyeez",
    "WebsiteURL": "Dynastyeez.com",
    "Summary": "The Art of Hustling is an experience grounded in entrepreneurship and art. Led by Michael Chavez, this project features the release and exhibition of a capsule streetwear collection, incorporating the multifaceted expression of music, style, and design signature to hip hop, and pairs it with a creative approach to business, in order to offer an accessible model of artistic entrepreneurship in Houston's historic East End neighborhood, the artist's home community."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Michele Brangwen Dance Ensemble",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/brangwendance",
    "InstagramURL": "https://www.instagram.com/brangwendance",
    "WebsiteURL": "www.brangwendance.org",
    "Summary": "The Michele Brangwen Dance & Music Ensemble will premiere a new work that explores the delivery systems for renewable energy. New sources of energy mean that new conduits will be constructed to harness and deliver wind and sun; equity in how these new grids are designed and function are issues the work will raise. The premiere will feature jazz saxophonist & composer Jon Irabagaon."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Mildreds Umbrella Theater Company",
    "Discipline": "Theater",
    "AwardAmount": "$14,549.00",
    "FacebookURL": "facebook.com/MildredsUmbrella/",
    "InstagramURL": "instagram.com/mildredsumbrella",
    "WebsiteURL": "www.mildredsumbrella.com",
    "Summary": "Mildred's Umbrella Theater Company requests operating support for 2023  that includes  the family show,an original fairy tale/adventure play with a racially diverse cast of mostly women,  TOOTH AN TAIL,  by local playwright Elizabeth Keel. We will also participate for the third year in the national project, #Enough: Plays to End Gun Violence, and a Fall 2023 show that has not yet been chosen. In addition, we are working on an original script in 2023 about abortion rights, based on interviews with real women."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Miller Outdoor Theatre",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,872,737.45",
    "FacebookURL": "facebook.com/milleroutdoor/",
    "InstagramURL": "instagram.com/milleroutdoor/",
    "WebsiteURL": "www.milleroutdoortheatre.com",
    "Summary": "The Miller Theatre Advisory Board (MTAB) acts as a steward of public and private funds to provide professional-caliber performances, free to the public, at the Miller Outdoor Theatre for the cultural enrichment of Houston's diverse communities and the visitors to this great city."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Misha Penton",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Monarch Chamber Players",
    "Discipline": "Music",
    "AwardAmount": "$3,680.00",
    "FacebookURL": "facebook.com/monarchchamberplayers",
    "InstagramURL": "instagram.com/monarchchamberplayers/",
    "WebsiteURL": "https://www.monarchchamberplayers.com",
    "Summary": "Monarch Chamber Players is a Houston-based collective of professional musicians committed to taking classical chamber music out of the concert hall and into accessible community spaces. Our year-round concerts are at no cost to the audience, taking away a major barrier present in many classical music ventures and providing a space for neighbors and communities to connect with each other and with the musicians. We connect with unique community partners for each performance at diverse venues including front porches, yards, parking lots, parks, churches, and schools; these informal settings allow audiences to become more intimately familiar with classical music."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Multicultural Education and Counseling through the Arts",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$113,750.00",
    "FacebookURL": "facebook.com/MECAHouston/",
    "InstagramURL": "instagram.com/meca_houston/",
    "WebsiteURL": "https://www.meca-houston.org/",
    "Summary": "MECA Presents, a 12-month performing and visual arts season between two sites, Dow School in the Old Sixth Ward and TBH Center in the East End."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Murad Aliyev",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Murad Aliyev",
    "Discipline": "Film",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/murad1986",
    "InstagramURL": "instagram.com/murad1985/",
    "WebsiteURL": "www.drp-studio.com",
    "Summary": "The Judgment\" is a second episode of 3D animated series \"The Man from Oguz\". Loosely based on Turkic epic medieval legend \"The Book of Dede Korkut\", series tells a story of a young man sent to foreign soil to fulfill his father's orders. It is a coming of age story dealings with moral and ethic values, coming of age story and acceptance. 40 minute episode is a second episode in the series. Project is culturally significant for huge Turkish, Azerbaijani, Kazakh and Turkmen communities in Houston."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Museum of Fine Arts Houston",
    "Discipline": "Museum",
    "AwardAmount": "$1,000,000.00",
    "FacebookURL": "facebook.com/mfah.org",
    "InstagramURL": "instagram.com/mfahouston",
    "WebsiteURL": "https://www.mfah.org/",
    "Summary": "Established in 1900, the Museum of Fine Arts, Houston (MFAH), is among the five largest art museums in the United States, with an encyclopedic collection of over 70,000 works dating from antiquity to the present. Each year nearly one million people engage with the MFAH through its exhibitions and programming, including special presentations, lectures, symposia, films, family activities, community outreach, and school partnerships. Education is at the heart of the Museum's mission, and the MFAH strives to be a center of learning for the entire community with programming that responds directly to the needs and interests of Houston's diverse populations."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "MUSIQA",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/musiqahouston",
    "InstagramURL": "https://www.instagram.com/musiqahouston/",
    "WebsiteURL": "www.musiqa.org",
    "Summary": "Diabelli 200 Explorer is the interactive website accompanying Anthony Brandt's February 24-25 premiere of \"Diabelli 200\", commissioned by Performing Arts Houston for their New/Now performance series. The virtual component explores the historic and neuroscience inspiration behind this new work, which is being developed in collaboration with University of Houston neuroscientist Dr. Jose Luis Contreras-Vidal. Diabelli 200 Explorer will take listeners on a journey through this new work, allowing viewers to select options to learn more about the ideas behind the music."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "MUSIQA",
    "Discipline": "Music",
    "AwardAmount": "$25,204.00",
    "FacebookURL": "facebook.com/musiqahouston",
    "InstagramURL": "instagram.com/musiqahouston/",
    "WebsiteURL": "www.musiqa.org",
    "Summary": "In 2023 Musiqa will celebrate new music and showcase it as a living art form through collaborations with some of Houston's premier artists and arts organizations, commissioning new works by established and emerging composers, and providing educational programs that foster creativity in younger generations."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "My Connect Community",
    "Discipline": "Public Art",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/MyConCom/",
    "InstagramURL": "https://www.instagram.com/connect_com/",
    "WebsiteURL": "https://myconnectcommunity.org/",
    "Summary": "Building on the very successful Gulfton Story Trail of larger than life murals, our project will employ artists to create a series of murals on the METRO retaining walls that will enhance the newly created bus stops and bike lanes, provide visual safety reminders, and also artistically represent the diversity of the Gulfton neighborhood. With the advent of Gulfton's first bike lanes, there is a need for increased education and awareness about non-car transit users. We hope a series of vibrant PSAs along Hillcroft will create attention and give drivers pause as they contemplate the many users of the road."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Nameless Sound",
    "Discipline": "Music",
    "AwardAmount": "$18,918.00",
    "FacebookURL": "facebook.com/Nameless-Sound-106710186021029",
    "InstagramURL": "instagram.com/namelesssound/?hl=en",
    "WebsiteURL": "www.namelesssound.org",
    "Summary": "Nameless Sound will present two concert series, offering musically and culturally diverse experimental music, sound art, contemporary jazz, and improvisation. Creative Music Concert Series offers nine concerts, including: cellist Tomeka Reid (January 20, MECA), jazz legends Joe McPhee and Raymond Boni (May 14 and 15, Project Row Houses and Deluxe Theater), percussionist Hamid Drake (June 21, Rothko Chapel), and sound artist Olivia Block (September 22, James Turrell's Skyspace). They Who Sound, centering local and regional artists, features 27 weekly concerts at Lawndale Art Center beginning January 9 and running through December 18 (with a Summer break)."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Nathaniel Donnett",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/nathaniel.donnett",
    "InstagramURL": "",
    "WebsiteURL": "https://www.nathanieldonnett.com/",
    "Summary": "Dark Energy/Dark Matter consists of paintings, soundscapes, installations, and sculptures referencing historical black communities settled by freed black people post-emancipation in Houston, Texas. It also references Navy ex-airplane pilot Ed Dwight, an African American who almost became the first black astronaut in the United States. The project draws on Fred Moten's notion of enclosure - a psychological entrapment caused by social precarity and Michel Foucault's concept of heterotopias - an engagement with the plurality of space and time. The project will exhibit at Texas Southern University's Museum in Dec 2023. Lastly, a book documenting the project will be published."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Newspring",
    "Discipline": "Visual Arts",
    "AwardAmount": "$44,046.00",
    "FacebookURL": "facebook.com/newspringcenter",
    "InstagramURL": "instagram.com/newspringartstudio",
    "WebsiteURL": "www.newspringcenter.org",
    "Summary": "The NewSpring Visual Arts program offers afterschool art classes and a nine week summer program free of charge for students qualifying for free/reduced lunch programs. Each class provides a robust arts curriculum with STEAM components and provides a safe, inclusive, social and emotional environment. The afterschool art program is offered at six locations, averaging 17 classes per week. The summer program runs at four locations for nine weeks, primarily in District A.  All Programs at NewSpring work together to provide learning opportunities for success and stability in the present and in the future for underserved communities."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Nia's Daughters Movement Collective",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/niasdaughters",
    "InstagramURL": "https://www.instagram.com/niasdaughters",
    "WebsiteURL": "https://www.staceyallencde.com/nias-daughters-movement-collective.html",
    "Summary": "The Fairytale Project\" was created by Stacey Allen in order to showcase to show families and children in the United States' most diverse city, Houston, stories about themselves. As a continuation of this mission- Discover Green and Nia's Daughters Movement Collective collaborate again to present \"Shorts in Color\". \"Shorts in Color\" showcases a curated selection of diverse local filmmakers and creatives who create positive and empowering work for families to enjoy. This will take place in April 2023 at Discovery Green as part of their 15th year anniversary."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Nia's Daughters Movement Collective",
    "Discipline": "Dance",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/niasdaughters",
    "InstagramURL": "instagram.com/niasdaughters",
    "WebsiteURL": "https://www.staceyallencde.com/nias-daughters-movement-collective",
    "Summary": "Nia's Daughters Movement Collective is here to create and support art through the lens of Black women and girls. We do this by consistently building relationships with artists in multiple disciplines. We have an upcoming season full of multidisciplinary collaborative artmaking that includes re-staging historical dance pieces on our company members, creating visual art exhibits and installations, and co-creating new musical scores for dance. We also are steadfast in our commitment tp engaging people who have not traditionally had access to quality arts programming. We do this by making the overwhelming majority of our programming free for the public."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Nigerian-American Multicultural Council",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/namchouston",
    "InstagramURL": "instagram.com/namchouston",
    "WebsiteURL": "www.namchouston.org",
    "Summary": "Houston AfriFEST, a yearly festival celebrating the rich cultures of African in the city of Houston, is a family -friendly, open-air, event hosted by a number of partnering African organizations, led by the Nigerian-American Multicultural Council. Houston AfriFEST invites fellow Houstonians and guests from out of state to enjoy a space displaying the richness of Africa's diverse cultures. Join us to celebrate and learn more about various African cultures on Saturday, October 14th, 2023."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Noblemotion Dance",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "facebook.com/NobleMotionDance",
    "InstagramURL": "instagram.com/NobleMotionDance",
    "WebsiteURL": "www.noblemotiondance.com",
    "Summary": "On the heels of wild success for recent dance film Pit Stop, which has won two awards and been featured internationally in ten film festivals and counting, NobleMotion Dance is looking for support for the creation of a dance film Couplet. Couplet is a heartfelt, fiercely intimate duet created for the stage in 2018 by Andy Noble. For this project, a team of artists wish to situate the duet against the vast open sky of the Texas plains to highlight the strength and beauty of the relationship. Seven Spurs Ranch has welcomed the project for filming."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Noblemotion Dance",
    "Discipline": "Dance",
    "AwardAmount": "$14,415.00",
    "FacebookURL": "facebook.com/NobleMotionDance",
    "InstagramURL": "instagram.com/NobleMotionDance",
    "WebsiteURL": "www.noblemotiondance.com",
    "Summary": "NobleMotion's 2023 season features exciting new collaborations in music, neuroscience, A.I./machine learning, and film. In February, NMD will partner with composer Jose Hernandez and Latin American Classical Repertory company The Ponce Project to premiere \"Desert Shelter: Immigrant Bodies at the Sonoran Crossing\" through Performing Arts Houston's New/Now performance series. In August, NMD celebrates its 15th season by returning to The Hobby Center with a new production that offers twists on past NMD repertory as the company looks to empower the female voice. The company will continue expanding its educational outreach programs through NMD2 and NMD+, which takes place throughout Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Nyssa Juneau",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Open Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$52,890.00",
    "FacebookURL": "facebook.com/opendanceproject",
    "InstagramURL": "instagram.com/opendanceproject",
    "WebsiteURL": "www.opendanceproject.org",
    "Summary": "Open Dance Project's boundary breaking performances engage audience members throughout the entire creative process - building collaborative communities through innovative, inclusive, interactive art experiences. 2023 performances in Houston include: \"Peter & Wendy,\" for family audiences February 3-11; \"1968,\" ODP's latest immersive dance theater production May 11-20; and \"Shortcuts,\" an evening of new dance theater \"shorts\" by ODP company members in fall 2023, all at MATCH Theaters."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Orange Show Center for Visionary Art",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$125,000.00",
    "FacebookURL": "facebook.com/TheOrangeShow, facebook.com/HoustonArtCarParade",
    "InstagramURL": "instagram.com/TheOrangeShow",
    "WebsiteURL": "www.orangeshow.org",
    "Summary": "OSCVA will present a season of arts programming including tours and events at its three world-famous artist-built environments: The Orange Show, The Beer Can House, and Smither Park. Funds will also support the annual Art Car Parade in downtown Houston in April 2023 and the annual Art Bike Parade at MacGregor Park in May 2023."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Orissa Culture Center",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/HoustonOdias",
    "InstagramURL": "instagram.com/OCCHouston",
    "WebsiteURL": "https://occhou.org/",
    "Summary": "Houston Chariot Festival, a daylong free event, is held during summer holidays to attract out of town attendees and tourists to Houston area. 2023  festival is scheduled for Sunday, June 18 and will be held at the newly built Orissa Culture Center at 3101 Fuqua st, Houston TX, a handicap-accessible structure located on a park-like land in the heart of the city in an undeserved neighborhood to attracts people from all walks of life."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Oscar Rivas",
    "Discipline": "Dance",
    "AwardAmount": "$14,550.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Ecstatic Sunday is a safe space for free expression thru movement, \"Ecstatic Dance\" is the point of intersection between movement, expression and meditation."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Ouoc Huynh",
    "Discipline": "Film",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Performing Arts Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/performingartshouston",
    "InstagramURL": "instagram.com/performingartshouston/",
    "WebsiteURL": "www.performingartshouston.org",
    "Summary": "We respectfully request funding in support of Society for the Performing Arts' 2023 calendar year programming, which spans two artistic seasons: the spring of the 22/23 Season and the fall of the 23/24 Season. Already-planned programming includes the presentation of 17 local and touring artists and companies in 25 performances in spring 2023, along with dozens of arts education and community engagement programs held both independently of and in collaboration with touring artists. Fall 2022 programming is still being assembled and will be announced in April 2022, but will include approximately 10 additional artists and approximately 30 additional outreach activities."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Pilot Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/PilotDanceProject",
    "InstagramURL": "https://www.instagram.com/thepilotdanceproject",
    "WebsiteURL": "https://www.pilotdanceproject.org/",
    "Summary": "Bourgeois-Z is a new dance work created by Lebanese-American performance artist Jadd Tank. Using Max Brooks' World War Z: An Oral History of the Zombie War and David Roegler's The Sinking Middle Class as inspiration, Tank's timely new work investigates the absurdity of late-stage capitalism and its affects on the way people move. Bourgeis-Z will be livestreamed from the MATCH on October 30, 2022."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Preservation Houston",
    "Discipline": "Preservation",
    "AwardAmount": "$27,817.00",
    "FacebookURL": "facebook.com/preservationhouston",
    "InstagramURL": "instagram.com/preshou",
    "WebsiteURL": "www.preservationhouston.org",
    "Summary": "Preservation Houston will present a series of monthly docent-led Architecture Walks in different historic districts and neighborhoods from January 8 through November 12, 2023, including new tours of Washington Cemetery, Boulevard Oaks and Cherokee Place. Preservation Houston will produce four quarterly walking tours of historic Glenwood Cemetery from February 25 through November 25, 2023. Preservation Houston will produce the tenth annual Good Brick Tour of award-winning historic homes and buildings on Saturday and Sunday, November 4 and 5, 2023; locations will be selected after the 2023 Good Brick Awards for excellence in historic preservation are presented in February."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Preston Gaines",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/preston.gaines.4",
    "InstagramURL": "instagram.com/inanimatenature/",
    "WebsiteURL": "inanimatenature.com",
    "Summary": "The Secret Life of Plants is a single volume 20x30 space enclosing 600 square feet of land in collaboration with different Houston based Arts and Culture organizations. This enclosure will be a modular plywood structure that can be easily disassembled and relocated to sites within historically Black neighborhoods over a 3 month duration. The piece comprises a white, LED-lit enclosure placed atop an uncultivated fragment of land.This white-box-gallery space is built to capture and showcase the beauty of nature and transform the landscape into a 'contemplative space' for hosting art, activations, and workshops designed to bridge dialogue."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Pride Chorus Houston",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/PrideChorusHouston",
    "InstagramURL": "instagram.com/pridechorus",
    "WebsiteURL": "www.pridechorus.org",
    "Summary": "Pride Chorus Houston is Houston's LGBTQ+ affirming choral group and annually produces a season of 3-4 ticketed choral music concerts along with a slate of free community concerts for the Houston Community. During the grant period, we plan to produce four concerts in April, June, October, and December. Our concert season is from October to June, so the grant period overlaps two concert seasons. We produce community events as opportunities arise. In FY2022, we performed free concerts in connection with the Menil Collection, the Moody Center for the Arts, Houston AIDS Walk, and more."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Public Poetry",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Public Poetry",
    "Discipline": "Literary",
    "AwardAmount": "$5,852.00",
    "FacebookURL": "facebook.com/publicpoetryUSA",
    "InstagramURL": "instagram.com/public_poetry",
    "WebsiteURL": "publicpoetry.net",
    "Summary": "Public Poetry has been showcasing the power of poetry for over 11 years with signature programs and projects, locally, nationally and internationally.  They include a monthly reading series and Favorite Poem open mic, currently online first Saturdays 2:00-3:30 PM (135 consecutive months); \"REELpoetry/Houston TX,\" an acclaimed hybrid, international poetry film/video festival, (entering its 5th season); recently publishing the \"Pandemic Poems\" poetry anthology; plus outreach to the deaf community (3rd year),  special events, and more. We're committed to inclusivity and diversity, big on collaborations, and pay all poets we directly invite or commission (300+ to date) for the work they do."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Rec Room Arts",
    "Discipline": "Theater",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/recroomhtx/",
    "InstagramURL": "instagram.com/recroomhtx/",
    "WebsiteURL": "https://www.recroomarts.org/",
    "Summary": "Throughout the 2023 calendar season, Rec Room will present four new plays for Houston, nurture the development of ten local playwrights, and offer educational programs that utilize the tenets of theatrical creativity to foster social and emotional well-being. By cultivating new work and removing barriers that prohibit access to theater, Rec Room's goal is to further position Houston as a leader in American theater. Plays and events will demonstrate a cultural competency that directly reflects the diverse milieu of Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Reyes Ramirez",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Rhonda Radford Adams",
    "Discipline": "Public Art",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/ArtbyRhondaRadfordAdams",
    "InstagramURL": "instagram.com/ArtbyRhondaRadfordAdams",
    "WebsiteURL": "www.ARTRRA.com",
    "Summary": "Food for the Soul, is a public art project that engages local residents in the co-creation of a series of mosaic murals that will adorn the columns leading into the Hope Farms, located in Houston's historic Sunnyside community.  Hope Farms is an urban farm, a place for all Houstonians and visitors to our city to learn about and celebrate fresh, locally grown food.  Food for the Soul, brings the community together to raise the awareness of the benefits of Hope Farms and to use public art to help transform a local civic space into a cultural and artistic destination."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "River Oaks Chamber Orchestra",
    "Discipline": "Music",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/rocohouston/",
    "InstagramURL": "instagram.com/rocohouston/",
    "WebsiteURL": "www.roco.org",
    "Summary": "With a mission to shape the future of classical music, ROCO is one of the most prolific commissioning organizations, prioritizing new works from diverse artists that add to the available repertoire of classical music. ROCO will present at least seven new commissions in the 2022-2023 season themed \"Grateful,\" showcasing our gratitude for music and its ability to unite us. Demonstrating its commitment to inclusive representation among music creators, half of ROCO's new works are by composers of color and each of ROCO's In Concert series will be led by a female conductor this season."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "Rivkah French",
    "Discipline": "Film",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Rivkah French",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/rivkahfrenchchoreography",
    "InstagramURL": "instagram.com/rivkahfrenchchoreography",
    "WebsiteURL": "https://rivkahfrenchchoreography.carrd.co/",
    "Summary": "Artists @ Work is an interdisciplinary series of performances and events strategically placed in multiple venues across the Houston area, broken into phases that represent the different phases of construction. This series will build a new way for artists (and their audiences) to be in community after the separation and communal fracturing we experienced as a result of COVID. We will accomplish this by exposing participants to new performance spaces, new collaborators--even art forms they may be new to--and construct a new foundation of connection by deconstructing the barriers between us."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "RSA of Dance and Performing Arts",
    "Discipline": "Performing Arts",
    "AwardAmount": "$12,863.00",
    "FacebookURL": "facebook.com/myrisingstarsacademy",
    "InstagramURL": "instagram.com/rsaofdance",
    "WebsiteURL": "https://rsaofdance.com",
    "Summary": "RSA of Dance and Performing Arts is the premiere fine arts training and educational institution in Houston's beloved Hiram Clarke area. We are requesting support to continue to offer programs to underserved communities. We are bringing more. More classes, more arts, more instructors, and more fun. Join us on this journey."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Russian Cultural Center",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$9,477.00",
    "FacebookURL": "facebook.com/RCCOurTexas",
    "InstagramURL": "instagram.com/rccourtexas",
    "WebsiteURL": "ourtexas.org",
    "Summary": "RCC has plans to present a variety of events in 2023, including musical evenings and concerts, movie screenings, children's and adult cultural enhancement classes, photo and art exhibitions, and festivals. We will host six art exhibitions, six musical evenings, Kids' Reading Contest (March), Spring Festival (April), 17th Documentary Showcase (February), a New Year celebration for kids (December), musical evening with maestro Hans Graf (June), and Old Gregorian Calendar New Year Celebration (January). These events encourage and enhance cross-cultural understanding and give Texans a unique look at culture of all former Soviet Republics."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Ryan Hawk",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/ryan._.hawk",
    "WebsiteURL": "ryanhawk.info",
    "Summary": "Ryan Hawk will produce a new sculptural installation continuing his practice of researching alternative corporealities and forms of embodiment. Through narratives of horror and dark humor, the project will map contingencies between cultural expressions of power and modes of representations to undermine processes of social ordering. It will be displayed in Houston's Ion District in the summer of 2023."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Samskriti",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/IndianPerformingArtsSamskriti",
    "InstagramURL": "instagram.com/samskriti_tx",
    "WebsiteURL": "https://www.samskritihouston.org",
    "Summary": "Samskriti has planned an eclectic array of 5 high caliber programs for 2023 -   \"The Boat Story\", a Kuchipudi dance drama; \"The Ramayana\" - Indian, Indonesian and Thai dancers perform to Indonesian music by Gamelan of the New Moon; \"Beyond Jungle Book\" , JCC; \"Rudyard Kipling Revised\" - by EnActe Arts, CA, with dance, music and drama; featured presentation of \"Incredible India\"; \"Call of the Flute\" - dances on Krishna featuring Houston artists."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Sara Gaston",
    "Discipline": "Film",
    "AwardAmount": "$13,800.00",
    "FacebookURL": "facebook.com/ActressSaraGaston",
    "InstagramURL": "instagram.com/sara_gaston101/",
    "WebsiteURL": "www.saragaston.com",
    "Summary": "I've been wanting to tell the true story of a near miss my sister had with sexual abuse as a young child.  Most women I know have had some instance of being subjected to predation by an older male, often someone they knew.  She got lucky."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Sara Van Buskirk",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/officialsvb",
    "InstagramURL": "instagram.com/saravanbuskirk",
    "WebsiteURL": "www.saravanbuskirk.com",
    "Summary": "Sara Van Buskirk seeks the creative capital & space to organize and assemble all her creative materials to self-release a collection of songs. These songs will document the process and cover topics such as: introspective growth and healing after abuse, coming out as queer & falling in love."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q2",
    "Name": "Sarah Sudhoff",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Sarah Sudhoff",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/sarah.sudhoff.8",
    "InstagramURL": "instagram.com/sarahsudhoff",
    "WebsiteURL": "www.sarahsudhoff.com",
    "Summary": "Again and Again\" will create a series of works that memorialize the lives lost from school shootings and highlight our collective frustrations over increased gun violence. Texas has seen two K-12 incidents in the last four years, including the recent Ulvade massacre at Robb Elementary and the 2018 shooting at Santa Fe High School in Houston. Unfortunately school shootings continue to rise yet no local or national memorial exists to honor the young children and teachers who have lost their lives. \"Again and Again\"  aims to bring families, friends and communities together to celebrate and remember these extraordinary lives."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Screwed Up HQ",
    "Discipline": "Music",
    "AwardAmount": "$6,213.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://camh.org/screwed-up-hq-donations/",
    "Summary": "Screwed Up HQ Non-Profit will host an array of activities during the 2022-2023 fiscal year in efforts to expand the cultural legacy of the late great DJ Screw and members of the Screwed Up Click (S.U.C.) in collaboration with the Contemporary Arts Museum Houston. Through community based workshops and activities offered both online and in-person along with live performances, panels, and programs, Screwed Up HQ is committed to provide a hub for hip-hop independent artists and fans of chopped and screwed music across Houston and beyond."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q3",
    "Name": "Segundo Barrio Children's Chorus",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "www.facebook.com/segundobarriocc",
    "InstagramURL": "www.instagram.com/segundobarriocc",
    "WebsiteURL": "www.segundobarriocc.org",
    "Summary": "Segundo Barrio Children's Chorus is being established as Houston's first bi-lingual children's choir, whose mission is to enrich the lives of children and families through transformative performance opportunities which engage residents, build communities, and share with visitors the unique cultural identity of Second Ward/East End. This pilot-project targets children from immigrant and Spanish-speaking households ages 4-12, offering bi-lingual mentoring and access to the Arts, including music/vocal instruction. By utilizing a unique, culturally-informed curriculum, the choir aims to reduce drop-out rates, strengthen families, and foster pride in community for residents and visitors through appearances at community and city-wide public events."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Sha Davis",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Shabach Enterprise",
    "Discipline": "Theater",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/FadeToBlackFest",
    "InstagramURL": "instagram.com/Fade2BlackFest",
    "WebsiteURL": "www.FadeToBlackFest.com",
    "Summary": "Fade To Black is Houston's first and only short play festival to showcase the new works of African-American playwrights. We are a nationally recognized movement that produces amazing 10-minute plays. Playwrights are never charged submission fees and receive a $100.00 honorarium for their work. Local actors perform. Since 2017 the festival's home has been MATCH Theater in Downtown Houston (3400 Main Street, Houston, TX 77002) where we continue to witness sellout crowds."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Shabach Enterprise",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Shannon Murray",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "SHAPE Community Center",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$42,412.00",
    "FacebookURL": "facebook.com/shapecommunitycenter",
    "InstagramURL": "instagram.com/shapecommunitycenter",
    "WebsiteURL": "www.shape.org",
    "Summary": "SHAPE's cultural programming is a yearlong celebration and education of the African-American community through activities and classes such as visual arts, African dance, music production; and events such as our Pan-African Cultural Festival, International Food Festival, and Kwanzaa celebrations.  Using creativity is an integral part of our mission in the process of achieving justice for all people by removing barriers to equitable access to economic, political, and social rights, opportunities, and power, we provide the space for diverse communities to come together during quarterly events, and youth afterschool and summer programs."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Shih-Hui Chen",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/profile.php?id=100004150059195",
    "InstagramURL": "",
    "WebsiteURL": "www.shihhuichen.com",
    "Summary": "sisila ila ila: A Recalling to Mind is a 50-minute theatrical work for solo viola, an ensemble of 17 musicians and electronics to be performed at the Asia Society Texas Center on November 11, 2023. The solo viola serves as a deep-listening shaman, evincing endangered voices from two very different worlds: a disappearing human tribe and humpback whales. This poetic, musical narrative mines the realm of nostalgia for things past while encouraging us to listen more purposefully to all the voices that surround us - while we are still here."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Silambam Houston",
    "Discipline": "Dance",
    "AwardAmount": "$21,405.00",
    "FacebookURL": "facebook.com/silambamhouston",
    "InstagramURL": "instagram.com/silambamhouston",
    "WebsiteURL": "https://www.silambamhouston.org/",
    "Summary": "Silambam Houston, the city's premiere Indian classical arts organization, regularly presents original productions, designed to reach out to diverse audiences and facilitate cross-cultural collaborations. In addition, Silambam routinely hosts performances by visiting US-based and international artists, both established and emerging, in Houston. Our annual palate of offerings to Houston audiences include traditional Indian classical dance and music performances, cross-cultural collaborative dance-theater productions through our dance Company, the unique ArtStream festival that brings US-based emerging artists together in artistic conversation, and hosted performances by visiting artists."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Society for Indo-American Arts",
    "Discipline": "Performing Arts",
    "AwardAmount": "$4,241.00",
    "FacebookURL": "facebook.com/SocietyForIndoamericanArts/",
    "InstagramURL": "instagram.com/societyforindoamericanarts/",
    "WebsiteURL": "www.siaarts.com",
    "Summary": "Improvement in COVID situation has opened possibilities for in-person arts events as we knew them pre-COVID. We are in the process of delivering a productive season of ten in-person events in 2022 (January-December). Although the audiences still seem hesitant to return to in-person events and/or are recovering from economic impact of COVD, we are optimistically scheduling a season of 8-10 in-person events in 2023 (January-December) to be presented at the MATCH and Wortham Center, both being hubs of cultural arts activity in Houston."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "South Asian Folks Arts Council",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Southwest Alternate Media Project",
    "Discipline": "Film",
    "AwardAmount": "$4,671.00",
    "FacebookURL": "facebook.com/swampfilm",
    "InstagramURL": "instagram.com/swampfilm/",
    "WebsiteURL": "https://www.swamp.org/",
    "Summary": "In 2023, Southwest Alternate Media Project will continue to expand our program offerings while maintaining a focus on support emerging artists. We will leverage or community partnerships to offer the best quality programs that are attainable and affordable for the widest range of filmmakers."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q2",
    "Name": "Stacey Allen",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Stages",
    "Discipline": "Theater",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/stageshouston",
    "InstagramURL": "instagram.com/stageshouston",
    "WebsiteURL": "www.stageshouston.com",
    "Summary": "Founded in 1978, Stages is Houston's sixth-largest nonprofit performing arts producer overall and the largest outside the downtown theater district. Stages is one of the region's leading artistic employers, producing an average of 10 productions annually totaling 350+ performances and welcoming tens of thousands of visitors each season. Our focus on producing a broad range of plays and musicals in an intimate setting has generated critical acclaim and created a devoted community of audiences and artists who share a true sense of engagement, inclusion, and connection."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Tami Moschioni",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$14,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Tami Moschioni",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Tami Moschioni",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/TamiMoschioni",
    "InstagramURL": "instagram.com/tmoschioni",
    "WebsiteURL": "www.artuniti.com",
    "Summary": "Spoken Bicicleta\" is Art Uniti's community based public artwork celebrating Near Northside's Latino culture. Moschioni's team creates a monumental-scale, low rider bicycle sculpture featuring community artworks as sound making \"spoke cards\".  Greater Northside Management District sponsors its 10th anniversary \"Tour De Northside\" event unveiling \"Spoken Bicicleta\" at main Street's Hernandez tunnel on November 4th. It metamorphoses into a stage set for interactive performances.  Houston's award-winning Blues singer song writer, Jonn Del Toro Richardson integrates \"Spoken Bicicleta's\" percussive sounds into his original music.  Relocating to White Oak Bayou bike trails, \"Spoken Bicicleta\" is a selfie photo destination thru December 2023."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "TEATRX",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/teatrx/",
    "InstagramURL": "instagram.com/TEATRX/",
    "WebsiteURL": "www.teatrx.org",
    "Summary": "La Vida Es Cortos/Life Is Shorts is a unique festival that presents short plays and short films to highlight the Latinx community, its artists, and its stories. Short films and short plays are seldom seen by the general public but even more rare is seeing Latinx arts featured in Houston's prominent arts scene. In its fifth year, the festival will add children's programming, a dance theatre performance and dance short films to the lineup to create a Latinx multidisciplinary, multigenerational experience never seen before. The festival will be presented at MATCH in November 2023."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "Terrell Quillin",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Texas Medical Center Orchestra",
    "Discipline": "Performing Arts",
    "AwardAmount": "$4,354.00",
    "FacebookURL": "facebook.com/tmcorchestra",
    "InstagramURL": "instagram.com/TMCOrchestra",
    "WebsiteURL": "tmcorchestra.org",
    "Summary": "The Texas Medical Center Orchestra will perform our 2022-2023 season with concerts dedicated to mental health and mindfulness.  Our first concert, focusing on \"The Power of the Human Spirit,\" will feature works by composers Dvorak and Schumann; our second concert, \"The Power of Life,\" will feature Scandinavian composers Rautavaara and Sibelius, who interpret through their compositions the human ability to embrace the gifts and struggles that life holds for us; and our season finale will focus on \"The Power of the Moment,\" showcasing the powerful works of Tchaikovsky and Rachmaninoff."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Texas New Music Ensemble",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/texasnewmusic",
    "InstagramURL": "instagram.com/texasnewmusicensemble/",
    "WebsiteURL": "www.tnme.org",
    "Summary": "TNME's 2023 season \"For the Greater Whole '' focuses on the cultivation of community on both an audience and artistic level, allowing for expansive growth of the whole person experiencing performances while also supporting the well being of artists included in our network. Activities include one Spring concert, a Student Composer Workshop, the debut of our major music festival, and a Fall concert. Focus will be on connective programming including new commissions, workshops on mental health/wellness, and promotion of maintaining a healthy ecosystem for music to live and thrive within the Houston area and beyond."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Catastrophic Theatre",
    "Discipline": "Theater",
    "AwardAmount": "$50,439.00",
    "FacebookURL": "facebook.com/TheCatastrophicTheatre",
    "InstagramURL": "instagram.com/thecatastrophictheatre/",
    "WebsiteURL": "https://catastrophictheatre.com",
    "Summary": "The Catastrophic Theatre fulfills a vital niche as Houston's only experimental, avant-garde theatre; its creative partnerships, singular aesthetic, and locally developed new work have drawn significant national media attention and tourism to our city, contributing to its reputation as a cultural arts destination. All Catastrophic productions are accessible through Pay-What-You-Can ticketing, ensuring that anyone can experience bold, innovative performance at a price they can afford. The theatre produces a year-round, six-play season at MATCH in Midtown and continues to expand its reach locally through civic engagement and educational programs informed by the unique perspective of its core artists."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Garden Theatre",
    "Discipline": "Theater",
    "AwardAmount": "$5,575.00",
    "FacebookURL": "facebook.com/gardentheatrehou",
    "InstagramURL": "instagram.com/gardentheatrehou",
    "WebsiteURL": "www.thegardentheatre.org",
    "Summary": "The Garden Theatre is committed to bringing meaningful art featuring semi-professional performers to our city. As one of Houston's most exciting new theatres, our goal is to tell relatable stories using unconventional casting to appeal to diverse audiences consisting of people from all different backgrounds and walks of life. Over the next year, our carefully chosen, audience-driven productions will include A Midsummer Night's Dream (January, 2023), Steel Magnolias (April, 2023), Bonnie & Clyde (August, 2023), and, the yet-to-be-announced, Lizzie - the Lizzie Borden Musical."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Heritage Society",
    "Discipline": "Museum",
    "AwardAmount": "$27,226.00",
    "FacebookURL": "facebook.com/TheHeritageSociety",
    "InstagramURL": "instagram.com/The Heritage Society",
    "WebsiteURL": "www.heritagesociety.org",
    "Summary": "The Heritage Society (THS) produces museum exhibits and interprets historic houses according to their particular era. Exhibits are typically changed every 3-6 months. Our museum is open Wednesday- Saturday 10 am - 4 pm, and historic home tours are available during these hours. THS produces a Facebook Live show and a Speaker Series devoted to holidays or exhibits."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Houston Museum of Natural Science",
    "Discipline": "Museum",
    "AwardAmount": "$745,722.92",
    "FacebookURL": "facebook.com/Natural.Science",
    "InstagramURL": "instagram.com/hmns",
    "WebsiteURL": "www.hmns.org",
    "Summary": "HMNS requests operational support to help deliver immersive educational experiences to the city of Houston. Founded in 1909, HMNS has been a powerful force for science education for more than a century. Its size and scope of programming has catapulted it into the top tier of the nation's museums, consisting of 433,000 square feet of exhibition spaces, the Burke Baker Planetarium, Wortham Giant Screen Theatre, and Cockrell Butterfly Center. It has a rich history of hosting travelling exhibits and is a beloved resource for education through its school field trips, summer camps, outreach programming, educator workshops, and growing digital library."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q1",
    "Name": "The Jung Center",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Jung Center",
    "Discipline": "Multimedia",
    "AwardAmount": "$75,000.00",
    "FacebookURL": "facebook.com/junghouston",
    "InstagramURL": "instagram.com/junghouston",
    "WebsiteURL": "www.junghouston.org",
    "Summary": "The Jung Center changes the lives of more than 30,000 people each year through multidisciplinary classes, performances, and art exhibitions. Working from the principle that creativity is psychologically necessary for mental wellness and growth across the lifespan, The Jung Center offers classes and events year-round, in three semesters, at our physical location, in the community with partner organizations, and online. We focus on the ways art creates community and gives vital expression to core human experiences, fulfilling the basic human need to reflect on our experiences and our ways of living."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Menil Collection",
    "Discipline": "Museum",
    "AwardAmount": "$604,814.98",
    "FacebookURL": "facebook.com/MenilCollection",
    "InstagramURL": "instagram.com/menilcollection/",
    "WebsiteURL": "https://www.menil.org/",
    "Summary": "The Menil Collection requests HAA funding to support its operations during 2023. The museum plans a variety of programming, including special exhibitions, artist lectures, symposia, performances, and film screenings to attract, engage, and inspire audiences from Greater Houston and beyond. Set in a residential neighborhood in Houston's Montrose district, the Menil fosters direct personal encounters with art, and welcomes all visitors free of charge."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Ponce Project",
    "Discipline": "Music",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "facebook.com/ponceproject/",
    "InstagramURL": "instagram.com/ponceproject/",
    "WebsiteURL": "https://theponceproject.org/",
    "Summary": "Imagine if the names Manual Ponce, Silvestre Revueltas, and Robert Rodriguez invoked the same familiarity as Bach, Mozart, and Beethoven. Impacted by various political and socioeconomic elements, Latin American composers remain overshadowed by their European counterparts, too often unrecognized in the classical music canon. Houston, boasting an extraordinarily diverse urban culture, strong arts scene, and hotspot of Latin heritage, is perfectly poised to spearhead the mission of raising awareness and elevating these unsung composers. The Ponce Project is stepping up to this task by creating and cultivating knowledgeable and appreciative audiences through performances and educational projects of the highest caliber."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "The Positive Project",
    "Discipline": "Theater",
    "AwardAmount": "$9,760.00",
    "FacebookURL": "facebook.com/thepositiveproject",
    "InstagramURL": "instagram.com/williealston",
    "WebsiteURL": "www.playahz.org",
    "Summary": "The Positive Project \"Playahz\" InSpirational Theatre Arts Company presents its 2023 season of theatrical productions at its primary location, the TBH Theater located on 333 S. Jensen Drive beginning in January 2023 through December 2023 with three original works to be announced. Tentatively scheduled is a new work entitled \"Breathe\", a social conscious stageplay , movie production entitled \"DeVonte\" and two more events to be determined. Another proposed event will be a comedy showcase/improvisation to be held at Midtown Arts Center, Houston. Productions will include community and professional performers working together to address social issues involving youth crime, gangs and drugs."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "The STEM Foundation",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "www.facebook.com/southunioncdc",
    "InstagramURL": "",
    "WebsiteURL": "www.southunioncdc.org",
    "Summary": "The \"STEAMtheBlock\" in Sunnyside event is a community outreach component of our program called The STEM Foundation.  We have historically tied the \"Arts\" into our delivery and will use it to draw the entire Houston community towards engagement in our 50MW Solar Farm that is coming to the community.  We will showcase a Veterans Garden mural to draw people and then host a Youth Talent Expo early evening and a more adult oriented concert that late evening of August 30th."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Theatre Under the Stars",
    "Discipline": "Performing Arts",
    "AwardAmount": "$610,992.26",
    "FacebookURL": "facebook.com/TheatreUnderTheStars",
    "InstagramURL": "instagram.com/tutshouston/",
    "WebsiteURL": "https://www.tuts.com/",
    "Summary": "Founded in 1968, Theatre Under The Stars (TUTS) is a Houston-based non-profit institution dedicated to enriching life through the experience of quality musical theatre and positively impacting lives beyond the stage through innovative education and community outreach initiatives. The company's artistic vision encompasses our organization's core values of equity, diversity and inclusion, and supports TUTS' commitment to enrich the lives of Houstonians through the power of musical theatre. While the COVID-19 pandemic continues to impact performing arts organizations, TUTS will return to the theatre for its 2021-2022 Homecoming Season. Our 2022-2023 Season will be announced in January 2022."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Thomas Helton",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thomasheltonbass",
    "InstagramURL": "instagram.com/thomasheltonbass",
    "WebsiteURL": "www.thomashelton.org",
    "Summary": "I'd like to present a concert for 50 Pianos at Houston Piano Company in the Heights. The piece will be written to allow members of the Houston community  as well as non piano playing musicians to participate."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "Thomas Tran",
    "Discipline": "Visual Arts",
    "AwardAmount": "$7,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/artbythomas/",
    "WebsiteURL": "https://www.artbythomastran.com/",
    "Summary": "I will create a cultural Vietnamese mural (or triptych) to be unveiled on September 24 at NRG Park during Viet Cultural Fest 2022. The ideas and concepts will explore what it means to be Vietnamese American today through extensive conversation and interviews with the local community in Houston."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Tina Hernandez",
    "Discipline": "Visual Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/la_libertina",
    "WebsiteURL": "www.lalibertina.com",
    "Summary": "Nichos of the Afterlife\" are photographs and short videos influenced by the tradition of small Mexican boxes created for the Day of the Dead, but with a big twist. The twist is that instead of small-crafted scenarios, what is crafted are 3 different, life-sized, immersive photo sets where I engage myself with hand-made props and respond to the intention of each scene which consist of personal reflections of life and death."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Toni Valle",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/toni.l.valle/",
    "InstagramURL": "instagram.com/6degreesdance/",
    "WebsiteURL": "www.6degreesdance.org",
    "Summary": "6 Degrees premieres \"Pop Demo,\" in October 2023 at MATCH, an evening-length multi-disciplinary performance by Toni Leago Valle set in a \"Speakeasy.\" \"Pop Demo\" views propaganda through the history of political cartoons in an immersive experience of visual projections, contemporary dance, aerial dance, and theatre. Incorporating Pop Art costumes by Judy Masliyah, 1920 lighting and set by Hudson Davis, and original music by George Heathco, Valle creates the surreal world of political satire come alive. From Suffragettes to mass shootings, \"Pop Demo\" unmasks the heart of propaganda to facilitate conversations on how the biased projection of issues distort public opinion."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q4",
    "Name": "Trent Wittenbach",
    "Discipline": "Film",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "TRENTWITTENBACH.COM",
    "Summary": "A short documentary film exploring the history, art and craft of La Catrinas, how they are symbolic of the East End neighborhood of Houston and Dia de los Muertos. Through interviews with several La Catrinas, we will learn about the history and art as we see them create their individual Catrina character. We will learn why they are so important to the identity of this community.  We plan on screening the film at a venue in the East End accessible to the community during the lead up to 2023 Dia de los Muertos and on a project specific website."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Trenton Kirksey",
    "Discipline": "Music",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/MusicByTrent",
    "InstagramURL": "instagram.com/thetkirk",
    "WebsiteURL": "",
    "Summary": "The Houston Radio Choir & Digital Orchestra will perform  LIVE on Houston Radio Stations every \"Sunday Summer Evening\" in 2023. (June 4,11,18 & 25; July 2,9,16,23,30; August 6,13,20 & 27 all twitter.com/ 7 p.m.)   This \"Listening Party\" will feature LIVE Music, allowing some a look back to the 1950s & 60s when Families across America would enjoy \"Concerts\" from their homes. Music will include classic Gospel Choir hits & other inspirational arrangements with Orchestra. This event will also be live streamed via the web & podcast platforms. The production will include Songs: Choir, Solo, Duets & Trios etc. Along with oratorical presentations and current event-story based skits."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q4",
    "Name": "Troy Scheid",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "www.facebook.com/bravelittleco",
    "InstagramURL": "www.instagram.com/bravelittleco",
    "WebsiteURL": "www.brave-little.com",
    "Summary": "PAPER OFFERINGS, now in its third season, is a story of family history and mysterious happenings, set in Vietnam and Houston. This serialized theatre piece for family audiences uses a combination of written storytelling through \"snail mail\" and short films. PAPER OFFERINGS draws on Vietnamese and Asian folklore, immigrant experiences, and food traditions to create a story that audiences of all ages can enjoy, using all of their senses!"
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Troy Scheid",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "facebook.com/bravelittleco",
    "InstagramURL": "instagram.com/bravelittleco",
    "WebsiteURL": "www.brave-little.com",
    "Summary": "THE BIG \"US\" PROJECT is an ongoing process that centers the creative voices of refugees and immigrants. The result is an original, community-driven theatre and dance piece created by 100 members of Houston's refugee and immigrant communities. The final performance of this year's piece, Story Threads, in December 2023 will be free, open to the public, accessible online, and created for an audience of children and their grown-ups."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2022 - Q3",
    "Name": "Trulei Versatile",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "instagram.com/truleiversatile",
    "WebsiteURL": "truleiversatile.com",
    "Summary": "Over the next 6 months I want to build a series of editorial photographic works that's show the dynamics economical equality and the fashionable greatness of the black community."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "University of Houston Foundation",
    "Discipline": "Visual Arts",
    "AwardAmount": "$37,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://www.universityofhoustonfoundation.org/",
    "Summary": "The Blaffer Art Museum is dedicated to the activation of contemporary art in all its many forms. We present nine exhibitions in 2023, a series of interdisciplinary performances, and public programs that bring together the UH community with the larger city of Houston. Every year we highlight a Houston-based artist, and all of programs are FREE and open to the public. The Texas Music Festival provides intensive summer music training and performance experience for pre-professional and high school musicians through Orchestral, Vocal, Jazz, and Keyboard institutes, presenting more than 25 public performances and events by students, faculty, and guest artists."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Uptown Dance Company",
    "Discipline": "Dance",
    "AwardAmount": "$34,562.00",
    "FacebookURL": "facebook.com/UptownDanceCompany",
    "InstagramURL": "instagram.com/uptown_dance",
    "WebsiteURL": "uptowndance.org",
    "Summary": "The 2022 season includes over 23 performances with thirteen premiere works in nine unique programs across five different venues throughout greater Houston including: Midtown Arts & Theater Houston, Uptown Dance Center, University of Houston Cullen, Miller Outdoor Theater, Cullen Theater, and Royal High School.  We are particularly excited about the following projects: Spring is in the Air, Dance Infusion 2023, Wine and Dance, Rockin in the Park (A free event), The Nutcracker Suite, Take Off with Uptown: Celebrating 22 Years, and Fall Fusion 2023.  UDC proudly strives to commit to the life of artist who devotes him or herself to dance."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Vietnamese Culture and Science Association",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/vcsaorg",
    "InstagramURL": "instagram.com/vcsa.htx/",
    "WebsiteURL": "www.vcsa.org",
    "Summary": "Vi?t Cultural Fest Houston, first established in 2019, is a festival celebrating Vietnamese arts and culture including arts exhibitions, traditional musical from local artists, and dance performances. Outside of the performances, we will have exhibition booths with festival games, food featuring Vietnamese-fusion cuisine, and much more for all ages. In 2023, we expect to have more than 10,000 attendees on Saturday, September 23, 2023 for a one-day festival at NRG Center."
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2023",
    "Name": "Vincent Victoria",
    "Discipline": "Theater",
    "AwardAmount": "$12,000.00",
    "FacebookURL": "facebook.com/VincentVictoria",
    "InstagramURL": "instagram.com/vincentvictoriaplaywright",
    "WebsiteURL": "www.vincentvictoriapresents.com",
    "Summary": "The House of Patrick, a new biographical play about the life of 80's fashion designer Patrick Kelly, will arrive just in time for the Fall 2023 Fashion and Theatre  Season . The play will be a joyous celebration of the life of the unsung fashion icon who died prematurely from AIDS in 1990. This show will recreate some of the designer's unique designs while telling his rags to couture story with the same passion and fun as Kelly himself would have."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Willow Waterhole Greenspace Conservancy",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/willowwaterhole",
    "InstagramURL": "instagram.com/willowwaterhole",
    "WebsiteURL": "WillowWaterhole.org",
    "Summary": "The Willow Waterhole MusicFest is the artistic home for three uniquely combined elements: nearby Parker Elementary, Meyerland MSPVA, and Westbury High School are all designated as magnet music schools, local and regional professional musicians, and performance/interactive artists. The Festival showcases their depth and breadth of talent. Through MusicFest, our community's music artistic identity is captured in an engaging and positive manner. It has made the Willow waterhole a destination point to enjoy both the arts and greenspace."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "WindSync",
    "Discipline": "Music",
    "AwardAmount": "$20,501.00",
    "FacebookURL": "facebook.com/windsync",
    "InstagramURL": "instagram.com/windsync",
    "WebsiteURL": "www.windsync.org",
    "Summary": "WindSync's 2023 activities include a mainstage concert at Live Oak Friends Meeting House in February, the Onstage Offstage Chamber Music Festival from April 21-28, 2023, continued partnerships with HISD schools, the Center for Performing Arts Medicine, and Lunar and Planetary Institute, and two mainstage concerts in the fall of 2023. The Onstage Offstage Chamber Music Festival will feature WindSync's annual collaboration with the HYS Coda Music Program, free concerts at Zilkha Hall, Houston Farmer's Market and Levy Park, and the premiere of a new theatrical children's program Interstellar Cinderella. WindSync will also continue to release widely accessible streamable performances virtually."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Workshop Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$42,148.00",
    "FacebookURL": "facebook.com/theWorkshopHouston",
    "InstagramURL": "instagram.com/workshophouston",
    "WebsiteURL": "www.workshophouston.org",
    "Summary": "Workshop Houston seeks funding from the Houston Arts Alliance to support its youth-led framework built around near-peer instruction of its direct learning music, media arts, design, and dance education programs. In 2023, Workshop Houston's youth instructors and participants will organize a series of showcase events featuring the work of students and community-based artists. These showcase events will celebrate the curriculum and projects completed over a six-week period. The event will highlight the talents of artists in the Third Ward, Southpark, and Sunnyside neighborhoods- providing youth leaders the empowering educational experience of creating celebratory events for their community and greater Houston."
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Writespace",
    "Discipline": "Literary",
    "AwardAmount": "$4,284.00",
    "FacebookURL": "facebook.com/writespace",
    "InstagramURL": "instagram.com/writespacehouston",
    "WebsiteURL": "www.writespacehouston.org",
    "Summary": "Writespace is a literary arts organization started in 2015 by writers for writers to provide masters quality workshops at low to no cost. Writespace supports Houston's whole writing community not only emerging writers and hobbyists, but we support doctoral candidates and established writers by paying them to run the workshops. Our goal is to include programming to introduce contemporary literature to underserved areas in our community through workshops and readings and to reach these underserved voices so they may examine their experiences through writing."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2022 - Q1",
    "Name": "Young Audiences of Houston",
    "Discipline": "Visual Arts",
    "AwardAmount": "$6,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": ""
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2023",
    "Name": "Young Audiences of Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$105,377.00",
    "FacebookURL": "facebook.com/yahouston",
    "InstagramURL": "instagram.com/ya_houston/",
    "WebsiteURL": "www.yahouston.org",
    "Summary": "Young Audiences of Houston will provide free programs to the public in partnership with local organizations, cultural districts, social service agencies, parks, community centers, libraries, hospitals, businesses and other public venues open to the general public. These programs enable the community and visitors to Houston to participate in meaningful, high-quality arts experiences while promoting Houston as a national tourist destination with relevant, diverse arts and cultural experiences for all ages, backgrounds, and abilities. Over 50% of our annual 3,037 Arts & Culture Programs are open to the public and will take place from January 1, 2023 - December, 31, 2023 across Houston."
  },
  {
    "Program": "Festival",
    "Cycle": "Festival 2023",
    "Name": "Zine Fest Houston",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "facebook.com/ZineFestHouston/",
    "InstagramURL": "instagram.com/zinefesthouston/",
    "WebsiteURL": "https://www.zinefesthouston.org/",
    "Summary": "Zine Fest Houston (ZFH) is an organization and festival dedicated to promoting zines, comics, and other indie press projects. The festival is free to attend and offers affordable vendor space for creators who publish, distribute, and promote alternative DIY media. It is the only event in Houston that provides a platform for emerging and established zine makers to exchange work and create meaningful relationships that lead to productive collaboration. The 2023 festival will be on November 11, 12-6pm at The Orange Show Center for Visionary Art, and will feature local and regional zine vendors, all-ages workshops, lectures, and panel discussions."
  }
]