[
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Contemporary Arts Museum Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/theCAMH",
    "InstagramURL": "https://www.instagram.com/camhouston",
    "WebsiteURL": "https://camh.org",
    "Summary": "From September 16-19, 2024, Contemporary Arts Museum Houston (CAMH), Houston Freedmen's Town Conservancy (HFTC), and artist Theaster Gates will host Houston's edition of the renowned Black Artists Retreat (B.A.R), focused on the radical concept of \"Black Land Ownership and Space: Black Stabilization and Determination.\" Over four days, the convening will present speakers, panelists, and experts from Houston and across the country, bringing together, elevating, and inspiring the brain trust in local Black and BIPOC artists, creatives, and intellectuals. With programming in Houston Freedmen's Town, POST Houston, and CAMH, B.A.R.  has the potential to generate paradigm-shifting frameworks."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "DACAMERA",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/dacamera",
    "InstagramURL": "https://www.instagram.com/dacamerahouston/",
    "WebsiteURL": "https://www.dacamera.com",
    "Summary": "In 2024-25, DACAMERA will embark on a new partnership with the recently restored Eldorado Ballroom in Houston's Third Ward. The focus of this collaboration is the \"DACAMERA At The Eldorado: Rising Jazz Stars\" concert series featuring up-and-coming jazz artists from around the country, providing a new opportunity for Houstonians to experience the next generation of outstanding jazz talent. This series will include eight concerts falling on Sunday afternoons from October 2024 - May 2025, dates TBA. All concerts will be offered as pay-what-you-can, all-ages concerts."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Dance Afrikana",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/danceafrikanahouston",
    "InstagramURL": "https://www.instagram.com/danceafrikana/",
    "WebsiteURL": "http://danceafrikana.com/",
    "Summary": "An extension of the Black Dance in Texas research project by Dance Afrikana's founder and Scholar-in-Residence for Rice University's CERCL Program at the African American History Research Center Gregory Campus, Black Dance in Texas is a multidisciplinary project around documenting the tradition of Black dance in Texas. This project includes a curated exhibition, digital dance archive, and book."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Group Acorde",
    "Discipline": "Performing Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://facebook.com/groupacorde",
    "InstagramURL": "https://instagram.com/groupacorde",
    "WebsiteURL": "https://www.groupacorde.org",
    "Summary": "Group Acorde will premiere Batimento Cardiaco, a new work that depicts Houstonian's mental health before, during and after a natural disaster occurs.  This work will be a collaboration between 4-7 musicians, two contemporary dance choreographers and a visual artist in an interdisciplinary work presented on October 3rd and 4th, 7:30pm at MATCHbox 2.  The company will host a free studio open rehearsal also livestreamed on the company's social media platforms prior to the premiere. Performances will feature all artists, and a visual set and costumes made of recyclable materials live on stage followed by an open discussion with the audience."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Lance Flowers",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://facebook.com/LanceFlowers",
    "InstagramURL": "https://instagram.com/hoganbrownart",
    "WebsiteURL": "https://www.hoganbrowngallery.com/",
    "Summary": "Take Me As I Am, is a solo exhibit featuring the work of multidisciplinary artist Lance Flowers. The exhibit will take place simultaneously at the Hogan Brown Gallery in Houston, TX and Yale University's Institute For Sacred Music. The Yale portion has obtained its own independent funding. This exhibit will feature new works highlighting Third Ward and its community through a series of mixed media works. The materials used will be gathered from the entirety of Third Ward. This exhibit will be curated by gallery director Robert Hodge and feature 2d works, videography, music, and photography highlighting Third Ward residents."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Norma Jo Thomas",
    "Discipline": "Theater",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/NormaT TV",
    "InstagramURL": "https://www.instagram.com/NormaT.xyz",
    "WebsiteURL": "",
    "Summary": "An original musical theatre production by Norma J. Thomas, \"Carol of the Bells\", to be performed at the C. Lee Turner Performing Arts Center on December 14, 2024. Building upon Norma's tradition of bringing Winter Holiday productions to the community, \"Carol of the Bells\" has its world premiere as part of an Acres Homes community  collaborative to fill the month of December with artistic and cultural holiday offerings."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "One Sample Cultural Foundation",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/onesampleculturalfoundation/",
    "WebsiteURL": "http://osculturalfoundation.org",
    "Summary": "Ethnography of Afro-Venezuelan Music is a multidisciplinary educational conference that includes videos, music and dance, which explores the syncretism of African culture and European religious practices in Venezuela through music. The project aims to strengthen ties between the African American and Venezuelan communities and promote a dynamic cultural exchange. This free educational-cultural activity for the general public, which will take place at the Institute of Hispanic Culture of Houston (10/10/2024) and Teatro Bilingue de Houston (04/13/2025)."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "SoulSista Art Foundation",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/soulsistafestival/",
    "WebsiteURL": "",
    "Summary": "The public presentation will be held at Houston Warehouse Studio (1506 Lorraine St, HTX) with a capacity of about 2000. There will be a two-hour conference highlighting Houston's contributions to the new music business. This will be presented in the studio room and will be followed by performances from selected poets and Afrobeats artists who have been recognized over the years in Houston. This event is scheduled for November 11th 2024 from 12pm to 6pm. The event will be open to the general public for free, donations will be accepted. We will also have food-trucks and djs."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "The Pilot Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/PilotDanceProject",
    "InstagramURL": "https://www.instagram.com/thepilotdanceproject",
    "WebsiteURL": "https://www.pilotdanceproject.org/",
    "Summary": "Loteria is an original dance work by celebrated Houston-based choreographer, Cynthia Garcia. Loteria brings to life the characters of the traditional Mexican board game, which is similar to bingo. In an urban landscape of constant gentrification, often times cultural signifiers, customs, and traditions are left behind to illustrate the legacies of cultural communities. The dances of Loteria will be presented at two major cultural events in gentrified neighborhoods that have histories as Mexican and Mexican American neighborhoods: MECA's Day of the Dead Festival in Sixth Ward (October 2024), and the MD Anderson YMCA's annual posada in Near Northside (December 2024)."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Round": "Round 1",
    "Name": "University of Houston Foundation",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/uhdowntown",
    "InstagramURL": "https://www.instagram.com/uhdofficial",
    "WebsiteURL": "https://universityofhoustonfoundation.org/",
    "Summary": "The Terence Blanchard concert will engage the community from Third Ward and Downtown Houston in a series of events with 7 time Grammy winning artist Terence Blanchard. \nIn addition to performing a concert, Blanchard will collaborate with University of Houston and University of Houston-Downtown students.\nThe performance will be November 7th, 8th, or 10th at either the Wortham Theater or at UH Moores School of Music. \nThere will also be a fireside chat / workshop as part of the visit."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Friends of River Oaks Theatre",
    "Discipline": "Film",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/FriendsofRiverOaksTheatre",
    "InstagramURL": "https://www.instagram.com/FriendsOfRiverOaksTheatre",
    "WebsiteURL": "https://www.friendsofriveroakstheatre.org",
    "Summary": "Our public presentation will be a final-cut screening of Cinema Revival, taking place at the Houston Media Conference in August 2025 (exact dates still to be determined). The screening will take place at the newly reopened River Oaks Theatre. Our organization already has a working relationship with this Conference, as we are presenting a work-in-progress screening of Cinema Revival at this year's Conference from August 23-25 at the Norris Conference Center in Houston, Texas."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "HOPERA",
    "Discipline": "Performing Arts",
    "AwardAmount": "$15,000.00",
    "FacebookURL": "https://www.facebook.com/profile.php?id=61552118362074",
    "InstagramURL": "https://www.instagram.com/hoperahtx/",
    "WebsiteURL": "https://www.hoperahtx.com",
    "Summary": "HOPERA is producing the Houston premier of the contemporary chamber opera As One in partnership with the Montrose Center. As One (music by Kaminksy, text by Campbell and Reed) tells the story of Hannah, a transgender protagonist on a journey of self-realization. Performances are at 7:00pm 11/18/2024 at Eureka Heights Brewery and on International Transgender Day of Remembrance 11/20/2024 at the Montrose Center. A portion of all ticket sales will be donated to the Montrose Center, located in the heart of Houston's historically LGBTQIA+ neighborhood, and the majority of the cast and creative team are members of the LGBTQIA+ community."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Houston Immigration Legal Services Collaborative",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "HILSC, in partnership with National Partnership for New Americans (NPNA) aims to uplift this region's culture and character at the National Immigrant Inclusion Conference (NIIC) held at Hilton Americas - Houston from December 8 to 10, 2024. By showcasing grassroots artists and through a first-time on-site art installation including visual and/or multimedia artworks by artists from diverse immigrant and refugee communities in Houston and Texas, the artistic components of the conference will amplify a sense of belonging, interconnectedness and community power as immigrant justice advocates gather at NIIC to absorb the 2024 election outcomes, its impacts and assess the landscape ahead."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Performing Arts Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$48,333.00",
    "FacebookURL": "https://www.facebook.com/performingartshouston",
    "InstagramURL": "https://www.instagram.com/performingartshouston/",
    "WebsiteURL": "https://www.performingartshouston.org",
    "Summary": "Performing Arts Houston is collaborating with Solange Knowles and her artist collective Saint Heron to present a week-long multidisciplinary series entitled \"Eldorado Ballroom\" in Houston in January 2025. First premiered by the Brooklyn Academy of Music in 2023, the series includes three mainstage performances featuring multiple artists, film screenings, community celebrations, and learning events. The first two performances will be presented at Jones Hall, with the culminating performance presented in the Third Ward at the Eldorado Ballroom itself. Each performance is curated by Ms. Knowles and focuses on a specific musical genre or artistic territory."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Shabach Enterprise",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$27,500.00",
    "FacebookURL": "https://www.facebook.com/FadeToBlackFest",
    "InstagramURL": "https://www.instagram.com/Fade2BlackFest",
    "WebsiteURL": "https://www.FadeToBlackFest.com",
    "Summary": "The Fade To Black Arts Festival, which has been in preproduction development for the past two years, will celebrate African-American art forms in film, music, poetry, and theatre throughout Downtown Houston from June 8-14, 2025. Over 20 prestigious arts and education organizations will contribute their own unique performing arts event or venue, showcasing unified support for underrepresented African American artists within Houston's Midtown Cultural Arts and Entertainment District. The festival will feature seven days of cultural arts entertainment, community events, and educational and career opportunities for artists of all ages, gender identities, and cultural backgrounds."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Stacey Summers",
    "Discipline": "Literary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "http://www.poppyproproductions.com/index.html",
    "Summary": "The public presentations will take place in the spring at several elementary school auditoriums, as well as the Children's Museum of Houston. Each will start with a literary reading of the book followed by a panel discussion/Q&A with the author and the subjects featured in the book, who will focus on how they were able to overcome obstacles to achieve their goal and achieve what they set out to do despite setbacks. The aim of this discussion will be to encourage children to persevere, keep a positive mindset, and not to ever give up on their dreams and goals."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 2",
    "Round": "Round 2",
    "Name": "WeLead",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/nigeriaculturalparade",
    "InstagramURL": "https://www.instagram.com/nigeriaculturalparade",
    "WebsiteURL": "https://www.nigeriaculturalparade.com",
    "Summary": "The Nigerian Exhibit is perfectly curated as a learning blueprint for Nigerian culture. The exhibit will showcase the richness of Nigerian art, culture, traditions, and achievements of notable Houston Nigerian figures to highlight their contributions to the city of Houston. It will include an installation of authentic masquerades representing key tribal groups and provide a traditional experience. The exhibit will support the need of global exchange and provide a learning platform to underserved communities with limited access to learn about an international culture. The exhibit will be installed at Houston City Hall from October 16, 2024 to January 3, 2025."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 3",
    "Round": "Round 3",
    "Name": "TBA",
    "Discipline": "",
    "AwardAmount": "",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Check back later for Round 3 grantees!"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "aisha tida",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,000.00",
    "InstagramURL": "https://www.instagram.com/aishanotaiiisha",
    "WebsiteURL": "https://aishatida.cargo.site",
    "Summary": "PUSH/PULL is a transdisciplinary exhibition project featuring works by aisha tida, Leila Mnekbi, Eliot Gray Fisher and EG Gionfriddo (ARCOS Dance). The free, public exhibition takes place at Box13 ArtSpace in Spring/Summer 2025 and centers intimate interactive performances. Visitors' visceral reactions to aisha tida's quilted installation feed into interactive embodied movement and live audio performances by ARCOS and Leila Mnekbi. Guided by the performers, audience-participants explore notions of authorship and agency while questioning the world we live in, the definitions and patterns we accept, and the loops and illusions we wish to escape."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Anastasia Kirages",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/k.llages/?hl=en",
    "WebsiteURL": "https://msha.ke/k.llages/",
    "Summary": "I plan to debut a zine called Catorce, Chiquinina!, inspired by family photographs of my mother's side, at Zine Fest Houston this fall on Saturday, November 16 from 12-6 PM at The Orange Show Center for Visionary Art. Collage work featured in the zine will be made during the summer at El Sur, an artist residency in Mexico City. Growing up, I have felt somewhat disconnected from the Hispanic community, even though I had a close relationship with my maternal grandparents, speak Spanish and live in Texas, so this zine will be an extended exploration of my cultural identity."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Anne Park",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://anneparkart.wixsite.com/anne-park",
    "Summary": "Minhwa is Korean folk art from the 19th century with the direct translation of people's (min) painting (hwa), which encapsulates unique Korean history and its people. My goal is to promulgate Minhwa and develop a new interpretation as a contemporary art. I would like to develop a comprehensive website and provide in-person presentations working first with Asia Society and Korean-American Society of Houston (KASH) with open public schedules for Summer/Fall sessions. I also would like to submit open-call proposals for exhibitions where I plan to conduct an artist's talk to facilitate a deeper understanding of Minhwa."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Asia Society Texas",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/asiasocietytexas",
    "InstagramURL": "https://www.instagram.com/asiasocietytx",
    "WebsiteURL": "https://asiasociety.org/texas",
    "Summary": "On September 28th, Asia Society Texas (AST) graciously invites Houston-based chamber music group Kinetic to take to the stage. Starting at 7:30 pm, the group will transform our versatile Education Center into an educational concerto with the aid of four acclaimed Turkish-based musicians: Erberk Eryilmaz, Sinan Ayyildiz, Bugra Kutbay, and Ali Can Oztan. The anticipated performance will be an introspective collaboration that pushes the boundaries of traditional and contemporary Turkish music as the musicians meld together Turkish and Western classical instruments into transcontinental harmony. Between pieces, there will be spoken presentations discussing the music's origin and instruments with the audience."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Ayanna Allen",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/MindofAMEA",
    "WebsiteURL": "https://AMEAMusic.com",
    "Summary": "An immersive Afrofuturistic experience to soothe all the senses - AMEA's \"Agenda's\" take us on a pursuit of Joy, Love, and Peace through sharing tools for supporting our nervous systems along the way the Fall of 2024. The mission is to meet the \"Lady on the Hill\" - Featuring local visual imaginings of the future human experience through installations to VR - You and your friends will be guided through a lush hike exploring the terrain of joy, love and ultimately meeting up in community for peaceful sounds curated by AMEA especially for you."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Babatunde",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/BabatundeOgunseinde",
    "InstagramURL": "https://instagram.com/babatunde140",
    "WebsiteURL": "",
    "Summary": "Rhythms and Canvas is an interactive and multidisciplinary experience that immerses attendees in traditional. modern and contemporary international art. Part art exhibit, part musical concert, part social gathering, Rhythms and Canvas does just what the name suggests. It brings the community together to celebrate and experience visual, performance, and musical art rooted in the local and diasporic cultures and experiences."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Beguiled Theatre Company",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/BeguiledTheatre",
    "InstagramURL": "https://www.instagram.com/beguiledtheatre",
    "WebsiteURL": "https://beguiledtheatre.com",
    "Summary": "Beguiled Theatre Company will be presenting John Faust's critically acclaimed play of \"Night of the Living Dead\" at the MATCH in Houston. Dates are TBD (in 2024 or early 2025), pending funding."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Bharathi Kalai Manram",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/bharathikalaimanram.bkm",
    "InstagramURL": "",
    "WebsiteURL": "http://bkmhouston.org/",
    "Summary": "This proposal is for a unique and new event \"Malargale\" - Indian Floral Art Exhibit and Live Demo on September 15, 2024, from 2-5pm at India House (8888 West Bellfort Ave, Houston, TX 77031). This exhibit will showcase the rich tradition of the unique Indian floral art while educating and engaging the community on how flowers play important role in day-to-day life, festivals, and special occasions. The proposal includes: Art exhibits created with fresh, dried, and artificial flowers; and Live demonstration to showcase creative models of garland making and varieties of flower threading activities exhibiting fine motor skills."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Carl Calloway Jr.",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/Cdc_14",
    "WebsiteURL": "https://callowaysphotography.mypixieset.com/",
    "Summary": "For my upcoming public presentation, I've opted to collaborate with Project Row House, a non-profit situated in Houston's Historic Third Ward, one of the city's oldest African-American neighborhood's. We plan to utilize their venue for screening the inaugural episode of our mini-series in mid to late September, scheduled for 6:00-8:00 PM. By teaming up with this esteemed art organization, strategically positioned in the heart of Houston, we aim to attract a diverse and sizable audience from the local community. The event will be ticketed and half of the proceeds will be given to Project Row House to support their efforts."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Dance Afrikana",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/danceafrikanahouston",
    "InstagramURL": "https://www.instagram.com/danceafrikana/",
    "WebsiteURL": "http://danceafrikana.com/",
    "Summary": "Zydeco in the Park is a project which will bring Zydeco dance and music to Discovery Green Park. Zydeco is a traditional Louisiana Creole dance and musical form from Southwest Louisiana and Southeast Texas, with African roots. It will feature a zydeco dance workshop and performance led by Dance Afrikana along with a live zydeco band, Zydeco Fenm."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Diamond Ashman",
    "Discipline": "Public Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/cultured.concepts",
    "InstagramURL": "https://instagram.com/cultured.concepts",
    "WebsiteURL": "https://www.cultured-concepts.com",
    "Summary": "Levels is an interactive Public Art experience for all ages and audiences that reframes the view of Street Art and Murals. Introducing the audience to the culture of Graffiti and the impact of Public Art. This event will attract audiences from all over with the unveiling of a hidden Houston gem. Located in Downtown Houston, this underground mecca of Art will host live Art, vendors and fun! A Mural Workshop will be available for all ages for those who would like to participate. Workshop will inform participants about mural creation process, site preparation and project execution."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "EMBER SKEYEZ",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/EMBERSKEYEZ",
    "InstagramURL": "https://instagram.com/EMBERSKEYEZ",
    "WebsiteURL": "",
    "Summary": "This project documents new music artists in developing an album from conception to production and finally performance.  The audience will witness the depth of collaborative efforts that go into creating not only music but also an accompanying performance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "George Heathco",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/georgeheathco/",
    "WebsiteURL": "https://georgeheathco.com/",
    "Summary": "Composer George Heathco and choreographer Toni Valle look to present \"make/SHIFT,\" integrating contemporary and aerial dance, chamber music, and video projections, where the roles of each will bind, blend, and blur into one another, to seamlessly interact in both visual and acoustic space, including: chamber musicians on stage serving as living and mobile set pieces, dancers becoming musicians supplying extra sonic content, and video projections redefining the space and complementing the live performance. The 30-minute work will be performed twice in January of 2025, serving as a workshop for a longer, more substantial future piece, slated for November 2025."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Group Acorde",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/groupacorde",
    "InstagramURL": "https://instagram.com/groupacorde",
    "WebsiteURL": "https://www.groupacorde.org",
    "Summary": "InWorks is a series of intimate experimental works that challenge two musicians and two dancers to communicate through set and improvisational material live in the moment. This series includes duets, solos and trios that highlight how each artist communicates with each other using contemporary choreography and music from instruments such as cello, upright bass and voice. This is set to premiere as part of Houston MetDance's residency program performances on August 2nd and 3rd at their studios in midtown Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "HOPERA",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/profile.php?id=61552118362074",
    "InstagramURL": "https://www.instagram.com/hoperahtx/",
    "WebsiteURL": "https://www.hoperahtx.com",
    "Summary": "HOPERA is producing 2 diverse concerts exclusively featuring local artists performing hourlong classical and operatic music programs as part of our Pint-Sized Performance series. Each concert will be presented free to the public at local craft breweries 8th Wonder and Eureka Heights. The first concert is a presentation of Boleros music September 2024 celebrating National Hispanic Heritage Month, and the second is an operatic duets program celebrating Valentine's Day 2025 with a curated pairing of beer with music. These performances are designed to benefit local musicians and encourage commerce at local small businesses while enriching the greater Houston community."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Houston Brass Band",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/Houstonbrassband",
    "InstagramURL": "https://instagram.com/houstonbrassband",
    "WebsiteURL": "https://houstonbrassband.org/",
    "Summary": "The Houston Brass Band, a local community ensemble, performs music based on the British brass band genre. We will perform the soundtrack to the move The Snowman at the Houston Public Library Winter Festival on the 7th December. This free event is designed as a community outreach in conjunction with the Houston Public Library, experience for families and children during the holiday season. The award-winning animated movie tells the story of a boy who builds a snowman that comes to life, which begins a magical adventure."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Isabella Vik",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/Isabella.v___",
    "WebsiteURL": "",
    "Summary": "Human Resource is a 25 minute contemporary dance and performance piece that parallels the effects of emotional regression through a corporate office setting, finding comradeship through vigorous technical partner work and an emphasize on femininity as survival. Initially created for film, the project will be available to audiences both online and in person, with a preview showing at Mind The Gap September 10th. The film will be produced and co-directed with David Nguyen and performed by Isabella Vik's Aufheben Ensemble."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Jesus Cantu Medel",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/tizoc1233/",
    "WebsiteURL": "",
    "Summary": "The culmination of this project will be a guided virtual tour of lesser known site of cultural or artistic significance around the city of Houston. Relevant interview clips will be played throughout, and the floor will be open to questions before moving on from each virtual location. This event will take place Saturday 12/14/24, online, via Zoom, where it will be freely accessible to anyone interested. It will also be recorded and posted to Youtube for anyone not able to attend."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "John P. McGovern Museum of Health & Medical Science",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/thehealthmuseum",
    "InstagramURL": "https://instagram.com/thehealthmuseum",
    "WebsiteURL": "https://www.thehealthmuseum.org",
    "Summary": "From October 24-26, The Health Museum will host artist Sayaka Ganz from \"Reclaimed Creations\" to engage the public with dialogues around the transformative powers of recycled plastics and how it can affect our health individually and within the larger environment. Our programming includes an artist talk, exhibition preview reception, and a public arts recycling activity for opening day. Through these hands-on activities and discussions, we aim to foster environmental consciousness and highlight the interconnectedness of human health, animal health, and the environment. Your support will help us empower healthier living in the community, using arts as the catalyst for change."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Levante Piano Duo",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/LevantePianoDuo?mibextid=LQQJ4d&rdid=cwqdWCZBa5aLTyNc",
    "InstagramURL": "https://www.instagram.com/levantepianoduo?igsh=MW8zbDJpMnQyZHc4aw==",
    "WebsiteURL": "",
    "Summary": "Recognizing that human relations often take a backseat in an era dominated by technology, a novel project emerges -- one that harnesses the power of music and explores the essence of human connection against the evolving tide of technology. Levante Piano Duo, a Houston-based piano 4-hands ensemble, presents \"Resonance: Rediscovering the Human in a Digital Age,\" a concert program that encourages human-centered musical interactions in a tech-driven world. At MATCH, (March 2025): Exact time and date, TBA according to venue availability."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Lovett Theater",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/lovett_theater",
    "WebsiteURL": "",
    "Summary": "Rice University's student-created and run Lovett Residential College Theater has been revived with a production of Into the Woods! Performances will be on November 7-9 at 8:30 and a 2:30 matinee also on November 9th. Shows will take place in Lovett College Upper Commons, a common student space that will be open to the larger public."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Magnolia City Brass Band",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/magnoliacitybrassband",
    "InstagramURL": "https://www.instagram.com/magnoliacitybrassband",
    "WebsiteURL": "https://www.MagnoliaCityBB.org",
    "Summary": "For this project, \"Women of the Brass Band World\" the Magnolia City Brass Band will perform a concert made up of works written by female composers or works that feature female soloists. This project will alleviate the underrepresentation of female composers in the brass band repertoire while recognizing the outstanding female brass musicians that we have in our own Houston arts community. This concert will be performed as part of our 2024-2025 concert season at a centrally located venue in the Houston area."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "MUSIQA",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/musiqahouston",
    "InstagramURL": "https://www.instagram.com/musiqahouston/",
    "WebsiteURL": "https://www.musiqa.org",
    "Summary": "Utilizing interview materials from the Houston Asian American Archive, three young composers from Houston -- Victor Cui, Ethan Soledad, and Tien Qin -- share vivid musical stories about Nathalie Roff, Angela Cheng, and Cookie Joe, respectively. This unique and innovative program highlights their immigrant experiences and triumphs in Houston. On October 3, 2024 Musiqa will present the world premiere of these works at The Asia Society Texas Center."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Norma Jo Thomas",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/NormaT TV",
    "InstagramURL": "https://www.instagram.com/NormaT.xyz",
    "WebsiteURL": "",
    "Summary": "It's not Supercuts in the local mall; it's Joe's, in the hood. So, what happens when REgentrification comes to Joe's barbershop? \"Shop Talk, the movie\" is a short, comedic film shot entirely on smartphone, on location at Joe's Barbershop, in Acres Homes. To be shot and finished August - September 2024, it will be screened in person and virtually, October - December, at events and locations including Saturday Night at the Movies, an outdoor film fest at the Acres Homes Chamber of Commerce, the Buy Black Marketplace at the Shrine Cultural & Event Center, and the Acres Homes Tree Lighting Reception, December 7th."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "PPL PXRTY ENTERTAINMENT",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/pplpxrtyent",
    "InstagramURL": "https://instagram.com/pplpxrtyent",
    "WebsiteURL": "",
    "Summary": "PPL PXRTY ENT. is launching a web and app based radio station, PPL PXRTY Radio, this winter on December 28th, 2024. Our team will introduce the Houston DJs, hosts, and podcasters joining our station, as well as PPL PXRTY's very own show on the station, which will be socially engaging with Houston creatives. We will utilize a small venue for a live, virtual event that allows us to interact with our audience and capture promotional footage. Our goal is to create marketing content for all parties involved and collectively promote to reach 5,000 listeners monthly within the first year."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Raul Orlando Edwards",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/raulorlandoedwards",
    "InstagramURL": "https://instagram.com/raulorlandoedwards",
    "WebsiteURL": "https://www.raulorlandoedwards.com",
    "Summary": "Flavors of Culture is a presentation that brings together performing arts (music and dance), visual arts and cuisine into one. Music, dance and visual arts are widely celebrated and here we bring cuisine to the forefront to showcase and inform, of the deep relationship that exists between these four. A public presentation that includes food samples, dance and music performances and visual art exhibit and historical background on how these four work in cultures from around the world that are found in Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Samskriti",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/IndianPerformingArtsSamskriti",
    "InstagramURL": "https://www.instagram.com/samskriti_tx",
    "WebsiteURL": "https://www.samskritihouston.org",
    "Summary": "Indian Performing Arts Samskriti proudly brings together the vibrant dance and music traditions of India, Indonesia, and Sri Lanka in \"TO A DIFFERENT BEAT.\" Witness professional BIPOC artists seamlessly intertwine their art forms, showcasing both their unique characteristics and the surprising commonalities that bind them together. Through colorful costumes, dynamic movements, and captivating rhythms, our performers will transport you on a mesmerizing journey across cultures, erasing boundaries and celebrating the beauty of diversity where art transcends barriers and unites hearts. Join us at the MIX-MATCH festival on Saturday, January 18, 2025 from 11am-11pm at MATCH Theatre in Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Sarah Sudhoff",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/sarah.sudhoff.7",
    "InstagramURL": "https://www.instagram.com/sarahsudhoff",
    "WebsiteURL": "https://www.sarahsudhoff.com",
    "Summary": "A two part multidisciplinary project, \"A Fading Union\" continues to survey the alarming increase in exposure to gun violence in the USA through photography, performance, and sculpture. Iconographically, the work appropriates the American flag and that image continues to naturally deepen and evolve as I install or employ it over time. Part one includes the development of a kinetic flag lowering sculpture. Part two features a three channel video and performance with flags. Both new works utilize a 3 x 5 foot solid red American flag that undergoes a series of transformations into water, black dye, and bleach."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Scriptwriters Houston",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/scriptwriters-Houston",
    "InstagramURL": "",
    "WebsiteURL": "https://www.scriptwriters-houston.org",
    "Summary": "The 10x10 Play Festival is the call for playwrights to submit their ten-minute play script. Ten are chosen from all submissions. A call is made for ten directors to direct those ten plays. Auditions are held for actors to perform in those plays. We partner with a local theatre to have those plays performed. One of the guidelines is that all of this has to be done by local Houston artist. The festival will be August 22, 23 & 24 at Theatre Suburbia, 5201 Mitchelldale, Houston  77092"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Silambam Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/silambamhouston",
    "InstagramURL": "https://www.instagram.com/silambamhouston",
    "WebsiteURL": "https://www.silambamhouston.org/",
    "Summary": "Curated and presented by Silambam Houston, the YUVA Festival is the only platform of its kind in Houston - a unique Indian arts residency that catalyzes creative collaboration among emerging talented artists of all genres and disciplines of Indian classical arts, both local and from across the country, and encourages them to 'find their artistic voice'. YUVA artists, selected from an applicant pool, are provided resources (space, time, mentoring, and funding) to create new collaborative artistic works for presentation at the YUVA Festival in September."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "SKEYEZ N STARZ",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/SKEYEZNSTARZ",
    "InstagramURL": "https://www.instagram.com/skeyez_n_starz/",
    "WebsiteURL": "https://www.skeyeznstarz.org",
    "Summary": "Stanzas and Stand Up is a show that blends the rhythm of poetry and spoken word with satire and humor.  This unique approach allows for cross exposure to different facets of Houston's creative community including Poetry, Comedy, and Theater. The shows structure include performance segments that follow specific topics and deliver an entertaining combination of skills to promote the talent of the performers and artistic engagment for the audience."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Space City Medievalism",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "On Friday April 11th, 2025, we will host a public reading at The Menil Collection celebrating poetry created through the yearlong program Space City Medievalism, sponsored by the Medieval Academy of America and the University of Houston. Space City Medievalism is a series of events that stage encounters between contemporary poets and medieval literature in Houston, TX. We will invite a keynote speaker who uses the medieval in their poetic and critical craft. The other readers will include graduate students at the University of Houston and established poets from the Houston area, including francine harris and Roberto Tejada."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "The Alta Arts",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thealtaarts",
    "InstagramURL": "https://www.instagram.com/thealtaarts/",
    "WebsiteURL": "https://www.thealtaarts.org",
    "Summary": "Alta Arts Presents: ElevateHer -- a groundbreaking 2-day event on October 15th & 16th, 2024, where innovation meets inspiration. ElevateHer isn't just an event; it's a movement reshaping the artistic landscape. Through storytelling, creative expression, and the diverse experiences of women artists, we're redefining boundaries and sparking conversations that matter."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "The Biggest Brandon",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/thebiggestbrandon/?hl=en",
    "WebsiteURL": "",
    "Summary": "The Biggest Brandon embarks on a new chapter in his series, spotlighting black-owned art galleries across Houston through an exploration of identity and a rejuvenation of black masculinity/femininity. With his trademark fusion of classical music, jazz, R&B, and hip-hop, The Biggest Brandon will host and perform Volume 2 of his acclaimed concert series, \"Lost,\" in the fall and winter months from September 2024 to February 2025. His mission is to showcase one of Houston's premier black-owned art gallery spaces while collaborating with top-tier musicians in this esteemed artistic environment."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "The Pilot Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/PilotDanceProject",
    "InstagramURL": "https://www.instagram.com/thepilotdanceproject",
    "WebsiteURL": "https://www.pilotdanceproject.org/",
    "Summary": "Houston-based choreographer Adam Castaneda will collaborate with acclaimed Houston-based musician Anthony Alemendarez to create \"Purple Bromeliads,\" a new dance work accompanied by an original composition. \"Purple Bromeliads,\" a work for nine dancers, is inspired by the the science fiction writing of N.K. Jemisin and is concerned with the warming of the planet and how communities rally together to support individual members in times of imminent danger. The work will be presented at a major festival in 2024, and will feature original costume design by Ashley Horn and visual art projections by Andre Amaral."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "The Positive Project Playahz InSpirational Theatre Arts Company",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/thepositiveproject",
    "InstagramURL": "https://instagram.com/williealston",
    "WebsiteURL": "https://www.playahz.org",
    "Summary": "A compilation of scenarios, performed by some of Houston's most prolific community artists, \"At The End of The Day\" is based on the hit stage-play \"Can't We All Just Get Along?\" in association with The Positive Project \"Playahz\" and Essence Entertainment. To be performed on Jan. 24th-25th at The Match Theater Downtown Houston. The story illustrates increases in neighborhood crime and what the Houston community can do about it. \"Silence Da Violence, Increase Da Peace\", a recurring theme, activates young and old alike to step up, step outside and be vigilant about our surroundings, working to safeguard our neighborhoods."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Thomas Helton",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thomasheltonbass",
    "InstagramURL": "https://instagram.com/thomasheltonbass",
    "WebsiteURL": "https://www.thomashelton.org",
    "Summary": "I want to compose music for a silent film from the 1920's. I want to use a 1920's style jazz band. This piece will be presented April of 2025 in a park or public space and free to the public."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "Uptown Dance Company",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/UptownDanceCompany",
    "InstagramURL": "https://instagram.com/uptown_dance",
    "WebsiteURL": "https://uptowndance.org",
    "Summary": "Uptown's 25th Anniversary Kickoff is a triple bill performance event at Uptown's Outdoor Theatre, August 24,2024.  Andre Silva, a Brazilian born professional dancer at Texas Ballet Theater, Lenard Lopez, a Hispanic choreographer and dancer and Beth Gulledge-Brown, an American choreographer and dancer trained in Cape Town South Africa.  Each choreographer will create international premier works for these performances. This is a free event that will showcase the works by these choreographers and a celebration of 25 years of dance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Round": "Round 1",
    "Name": "YUNGCHRIS",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/mrnternational.hk",
    "InstagramURL": "https://www.instagram.com/yungchrishk/",
    "WebsiteURL": "",
    "Summary": "Hi, my name is YUNGCHRIS. As a multidisciplinary artist, I create unique works of art in various sizes and produce dance productions and events all over the city. Currently, I am in the process of producing an independent film called TipToe Thomas, which I am both starring in and directing. The film is set to premiere this year and is centered around a character I created named TipToe Thomas. Through the art of mime, TipToe Thomas expresses himself through dance, inspired by the legendary Marcel Marceau. The premiere is set for November 16th, 2024."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Anthony Barilla",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/true.songs",
    "InstagramURL": "",
    "WebsiteURL": "https://www.anthonybarilla.com",
    "Summary": "I will produce an EP of new arrangements of songs by Houston artists. The songs will be performed by the members of Houston's Accordion Super Stars, a band of local musicians creating arrangements of existing songs for accordions. The final arrangements will be presented in a public concert in the Spring of 2025. Recordings will be sold in person and online. The intention of this project is to raise awareness of the scope and size of Houston's music scene by shining a spotlight on a diverse group of songwriters and presenting their work in an alternate light."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Brave Little Company",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/bravelittleco",
    "InstagramURL": "https://www.instagram.com/bravelittleco",
    "WebsiteURL": "https://www.brave-little.com",
    "Summary": "Grandpa's Garden is a unique and universal musical for kids and their grown-ups, exploring one family's roots and legacy as African Americans through song, senses, and stories. Audience members get their hands dirty as Grandpa Hollis teaches them how to plant their own squash seeds, and help curious Bebe find the key to her family history. Live performances to be hosted by MECA in Fall 2024 will include the latest phase of the project, the recording and release of the cast album and sheet music."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Canda",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/profile.php?id=100080336243418",
    "InstagramURL": "https://www.instagram.com/canda.n.b/",
    "WebsiteURL": "https://candanb.my.canva.site/home",
    "Summary": "On January 18, 2025 at MATCH venue in Houston during the MIXMATCH Festival, \"IMIYENZI\" will bring together poetry, dance, and visual storytelling to celebrate the resilience and cultural heritage of East-African communities. Inspired by traditional practices and the symbolic Pencil Tree, the performance will explore themes of strength and healing. After the performance, a research exhibition will highlight East-African traditional medicine, showcasing cultural wisdom and practices. This event aims to connect Houston's diverse communities and celebrate resilience through artistic expression and cultural exploration."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Carla Romero",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/Whitneyscrew",
    "WebsiteURL": "",
    "Summary": "Join us in the heart of Second ward Houston, as we come together to celebrate the rich cultural heritage of Salvadorian, Honduran, Guatemalan, Costa Rican, and Panamanian communities at the Central American Independence Day Celebration! This electrifying one day event is a tribute to unity and diversity, offering a day filled with exhilarating live music, captivating art exhibitions, and mouthwatering cuisine. Designed to honor our elders and build new traditions as we bring the sounds and culture of Central America to life September 2025."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Carmen Reeves",
    "Discipline": "Film",
    "AwardAmount": "$1,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/carm3nalicia/",
    "WebsiteURL": "",
    "Summary": "This short film is about an unorthodox love story for its time and place, early 1970s rural Texas. Two female school teachers face the repercussions of an affair and have to decide whether or not to continue their romance or settle back into their expected place in society as wives and mothers. I plan to shoot this project November 21st-23rd of this year."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Classical Arts Society of Houston",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/classicalartssocietyhouston",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Learn about a 18th century South Indian classical music composer Muthuswamy Diikshithar through this tribute. This 2h event will feature a movie of the life of the composer, sample presentations by youth of his unique compositions based on Veena - an ancient string instrument and narration by eminent musicologist Dr. Kanniks Kannikeswaran as the Artistic Director (AD). The finale will be a Q&A with the audience with an intent to clarify, educate and elaborate on the life of the brilliant composer who is one of the Trinity's of South Indian Classical Music."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "DG Fine Arts",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/dgfinearts",
    "InstagramURL": "https://www.instagram.com/dgfadallas",
    "WebsiteURL": "",
    "Summary": "The Murk City Invitational is a youth marching band showcase that celebrates the vibrant music culture of Houstons most historic communities.Themed after the iconic Texas Southern University vs. Southern University 'Murk City Classic' football game, this event will unite the community and inspire young musicians. Bands will showcase one halftime show that embodies the values of their respective communities. The Murk City Invitational will be held Saturday, October 12th at Delmar Stadium at 9am."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Dria Thornton",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/driathornton/",
    "InstagramURL": "https://www.instagram.com/dria_thornton/?hl=en",
    "WebsiteURL": "https://www.driathornton.com",
    "Summary": "Women to Watch: Houston R&B Storytellers is a unique outdoor event celebrating the incredible female talent in Houston's R&B scene. Join us on April 18, 2025 from 6-9pm at the new East River in 5th Ward for an evening where the city's rising and established female artists perform their most soulful tracks and share the personal stories behind their music. This event is not just a concert; it's an immersive acoustic experience that connects the audience with the heart and soul of R&B. Discover the voices shaping the future of music in Houston and may their journeys inspire."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Frame Dance",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/framedance/",
    "WebsiteURL": "https://www.framedance.org",
    "Summary": "Mise en Sc'ne is a highly-conceived choreographic performance series in which artists are brought together to interpret tasks, environment, and sound collaboratively in real time before an audience. Over 6 performances, 42 different artists from different pockets of the Houston dance, theater, and music community will come together to create new combinations...without ever having spoken to one another or the creators of the show."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Gulf Coast: A Journal of Literature and Fine Arts",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/GulfCoastJournal",
    "InstagramURL": "https://instagram.com/gulfcoastjournal",
    "WebsiteURL": "",
    "Summary": "Given the unique positioning of Gulf Coast Journal as a publication centering both literary and visual arts, with special attention paid to Houston based artists, our event will be a public craft talk and conversation featuring Houston artists whose art appears as magazine cover and in curated folios in the past year's issue of the journal discussing their own work and its interdisciplinary aspects. The event will be free, and held in prominent Houston space,  Lawndale Art Center at 7:00 on March 7."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Houston Brass Quintet",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/theHBQ/",
    "InstagramURL": "https://www.instagram.com/houstonbrassquintet",
    "WebsiteURL": "https://www.houstonbrassquintet.org",
    "Summary": "Set in Archway Gallery, HBQ will curate a program that celebrates Larry Garmezy's photography collection. Also being close to halloween, this concert will have a spooky, yet family friendly theme!"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Jeanette Degollado",
    "Discipline": "Performance Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/artistjeanettedegollado/",
    "InstagramURL": "",
    "WebsiteURL": "https://cuetlaxochitl.com",
    "Summary": "Welcome to a 19-minute sound performance and immersive photography installation, \"this should work,\" featuring Indigenous American transdisciplinary artist Jeanette Degollado. Degollado creates a sonification experience using field recordings, electronic pedals, a guitar, and multiple axillary instruments to develop a multisensory performance installation. Her sound composition will take you through California's cliffsides draped in plastic to help mitigate the eroding earth. She uses the patterns in her photographic images as the composition's framework. The installation showcases three large-scale color photographs, creating intimate spaces that the audience may maneuver through as they engage with the performance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Jeanette Joy Harris",
    "Discipline": "Performance Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/jeanette_joy_harris",
    "WebsiteURL": "https://jeanettejoyharris.me",
    "Summary": "INHERITANCE is a multi-disciplinary project that attends to the indiscernible and  unrelenting nature of grief and healing. Grounded in my experience of the tragic, simultaneous deaths of both my parents this project explores what you inherit when you lose your family and how you recover those lost stories, histories, and connections. This series employs family constellation therapy as a methodology and relies upon the activity of collaboration to generate new families and relationships."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Joel Aguilera",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/joel.aguilera.7",
    "InstagramURL": "https://www.instagram.com/aguilera_joel/",
    "WebsiteURL": "https://www.mezcladadancecompany.org/joel-aguilera",
    "Summary": "Percussive Movement is a free interactive and educational performance that explores the intricate relationship between percussion and dance across diverse cultures. Percussive Movement will be performed at The Museum of Fine Arts Houston on February 1st, 2025, and Levy Park on February 8th, 2025. This performance immerses audiences in the rich tapestry of cultural music and dance, showcasing instruments, rhythms, and dances from genres like Salsa, Breaking, Jazz, and Funk. Percussive Movement offers a unique cultural experience that celebrates and unites diverse traditions, making it a must-see event for all."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Karla Cisneros",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/karlacisneros.studio",
    "WebsiteURL": "https://karlacisneros.com",
    "Summary": "The presentation of 'Ofrenda Blossoms for Ghost Bikes' will be delivered as part of a featured educational booth at MECA's Dia de Muertos Festival on Saturday November 2 and Sunday, November 3rd, from 11am to 8pm on both days. The festival will take place at 1900 Kane St, Houston, TX 77007. This year marks MECA's 24th iteration of this free community celebration of Latin American folk art traditions that honor family and ancestry. Through artful floral creations honoring the bicyclists who have been killed, the presentation will bring more attention, raise awareness, and increase advocacy for a bike safe Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Kemi OG",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/OGCreatives",
    "InstagramURL": "https://instagram.com/ogcreatives",
    "WebsiteURL": "https://www.ogcreatives.com",
    "Summary": "Untitled (WT) is a digital photo exhibit that explores the emotions of the African immigrant experience. Each photo collection tells a story of aspirations, sacrifices, and triumphs, giving a glimpse into the lives of African immigrants. The exhibit also highlights the universal experiences shared by immigrants everywhere, emphasizing the common goals and determination of those seeking a new beginning in the United States. A public presentation of works in progress will be available by Spring 2025."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Lolade",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/lolademusic",
    "InstagramURL": "https://www.instagram.com/lolademusic",
    "WebsiteURL": "https://www.lolademusic.com",
    "Summary": "The aim for the Heard and Seen project is to present music as an immersive art, facilitate connection with others and awareness with self, and to create a space where attendees feel validated and welcomed. It will take place on March 1st 2025 at 6:30pm at Society for Africans in the Diaspora (SAiD INSTITUTE) 12126 Westheimer Rd #118, Houston, TX 77077."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Mariela G. Dominguez XZZX",
    "Discipline": "Public Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/xzzxart/",
    "InstagramURL": "https://instagram.com/xzzxart/",
    "WebsiteURL": "https://xzzx.com.ar",
    "Summary": "Soberania is a colorful and extensive sculpture of a mountain range that will be temporarily placed in a surrounding public space or under the highways of the Houston 610 loop.\nIn apparent contrast to the swampy and flat landscape of Houston, a mountainous portion activates an allegorical interpretation of the depersonalization of our urban environment. In this way, the sculptural location recalls the geological history in contrast to the sustained and negative deregulated urban development.\nThis project aims to offer a better understanding of our place in human history and to appreciate the beauty and fragility of current ecosystems."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "PPL PXRTY ENTERTAINMENT",
    "Discipline": "Performance Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/pplpxrtyent",
    "InstagramURL": "https://instagram.com/pplpxrtyent",
    "WebsiteURL": "",
    "Summary": "Flavors of Legacy will officially celebrate Kent Anderson Hadnot Sr. Day on 11/27/2024 at a Peerspace venue, honoring our late father's passion for the culinary arts. Partnering with Chef Quice, we'll host a sensory experience for food lovers, sharing his story, shaping our identity and histories, and curating a memorable menu in remembrance of a great chef. Flavors of Legacy will evoke creative expression that engages all five senses, communicating messages, emotions, values, and stories through food."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Priority Value Investments",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Houston Conversations in Art - Us Then and Now is a televised City of Houston visual artists showcase that focuses on local historic events that occurred from the 1970 to present day. The main objectives is to get artists from every Community or neighborhood to participate. We respectfully ask that each participant highlight events that have occurred within their own communities. This will allow all of us an opportunity to learn about each community. We will discuss the entries in a  live televised symposium featuring the artists. There are NO age limitations. All of our events are FREE to the public."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "REIA",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/kitchentable.puppetspress",
    "WebsiteURL": "",
    "Summary": "In Filipino culture, Kamayan is an act of communal feasting. Banana leaves are laid on a long table, while food is artfully placed along the middle to eat together. Kamote, or sweet potato in Tagalog, is a crop highlighted for its resilience and accessibility. On October 14th at the Arts + Culture Lab, Kamote Kamayan will be a night that encapsulates the necessity of community, allowing us to come home to our indigenous roots by putting these ideals into practice. A puppet presentation led by Kitchen Table Puppets + Press will express this story, while our community partakes in a shared meal."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Richard Carey Ford",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/richardcareyford",
    "InstagramURL": "https://instagram.com/richardcareyford",
    "WebsiteURL": "https://richardcareyford.com",
    "Summary": "The presentation is of the new musical, the Myth of the Modern Dad, written by Richard Ford. The presentation on January 16, 18 & 19 at 7:00 p.m. at the Evelyn Rubenstein JCC's Kaplan Theater in Meyerland. Modern Dad is a poignant and funny musical celebrating one Dad's evolving world. An authentic portrayal of love, contribution, and balance based on the author's experiences. Modern Dad explores what it is to lift others up with humor and joy. And finding peace navigating the pitfalls of being a man today. The show features four actors portraying a colorful, diverse array of people."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Rivkah French Choreography",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/RivkahFrenchChoreography",
    "InstagramURL": "https://www.instagram.com/rivkahfrenchchoreography",
    "WebsiteURL": "https://rivkahfrenchchoreography.carrd.co/",
    "Summary": "This funding will support Rivkah French Choreography's collaboration with Houston Contemporary Dance Company's 6th Season February 2025 performance. The event will feature RFC as a guest choreographer, presenting work in the themes around the city of Houston and its ties to diverse communities surrounding the city. Rivkah French Choreography brings LGBTQIA+ representation in dance to this exciting collaboration."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Seven Walker",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/yslas.flac",
    "WebsiteURL": "",
    "Summary": "Mihtotilistli: De-Colonizational Healing Through Interactive Art will be held at Insomnia Gallery on March 2025, starting at 6 PM. This audio-visual interactive installation, developed by myself and Mexican-American composer J.E. Hernandez (together as Yslas), uses LIDAR-based visual media and granular synthesis to create an immersive experience. The event invites the Mestizo and de-tribalized communities to engage with their ancestral spaces through a blend of sound art, music, and visual arts. Participants' movements and bodies are captured and transformed, granting them communal agency to navigate LIDAR scans of Mesoamerican and Native American ancestral sites, fostering a journey of reclaiming and healing."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "The Bay Area Youth Singers",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/bayareayouthsingers",
    "InstagramURL": "https://www.instagram.com/bayareayouthsingers",
    "WebsiteURL": "https://www.bayareayouthsingers.org",
    "Summary": "From Latin to Latin America...The Bay Area Youth Singers and Segundo Barrio Children's Chorus present holiday music with traditional Latin texts and traditional Latin American songs in the lovely Chapel of the Villa de Matel in downtown Houston.  They bring together children from disparate neighborhoods and cultures. Free concert; tickets required due to limited seating.  Saturday, Dec 14, 2024, 3:00PM.  String quartet, organ, guitar, percussion and beautiful a cappella singing."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "The Great UnKnwn",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/profile.php?id=100093981132393",
    "InstagramURL": "https://instagram.com/officially.unknwn",
    "WebsiteURL": "",
    "Summary": "Introducing The Great UnKnwn with his debut EP, \"Look Here,\" at the House of Blues Houston in May 2025. Join us for an unforgettable night featuring Houston's own lyrical genius, whose flow has been compared to J. Cole and Kendrick Lamar. Experience the unique sounds and talents of The Great UnKnwn and collaborating emerging artists. Come out and see for yourself... Look Here!"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Thomas Helton",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thomasheltonbass",
    "InstagramURL": "https://instagram.com/thomasheltonbass",
    "WebsiteURL": "https://www.thomashelton.org",
    "Summary": "The tuba is considered the foundation of most orchestras, concert bands, wind ensembles, etc. Using 8 tubas I will embrace the audience with sound in  the beautifully cavernous space of the Buffalo Bayou Park Cistern in April of 2025."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Thunderclap Productions",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thunderclapproductions",
    "InstagramURL": "https://www.instagram.com/thunderclapproductions/",
    "WebsiteURL": "https://thunderclapproductions.com/",
    "Summary": "We plan to produce a New Works Festival, featuring excerpts from plays and musicals of about 6 writers living within 75 miles of Houston. This is slated for Jan. 6, 2025 at the MATCH. The performance will include about 10-20 minutes per creator of excerpts from their new works to highlight the exciting new work that's being created locally. While festivals like this exist in places like New York, Houston does short work festivals and full-length work readings, but doesn't yet have a way to feature highlights of larger works from several local writers and composers."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 2",
    "Round": "Round 2",
    "Name": "Virtuosi of Houston",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/virtuosiofhouston",
    "InstagramURL": "https://www.instagram.com/virtuosi1996",
    "WebsiteURL": "https://virtuosiofhouston.org/",
    "Summary": "Virtuosi of Houston is excited to present the \"Opening Night Concert of our 29th Season\" on Saturday, November 9th, 2024, at the Hobby Center for the Performing Arts in Zilkha Hall. Under the patronage of Franz Anton Krager and Andrzej Grabiec, 55 to 65 talented students selected by audition will have the opportunity to perform in a professional venue for their first concert of the season. These young musicians, from diverse backgrounds in Houston and the surrounding area, will come together and, after only 10 rehearsals, will undoubtedly impress the audience in attendance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 3",
    "Round": "Round 3",
    "Name": "TBA",
    "Discipline": "",
    "AwardAmount": "",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Check back later for Round 3 grantees!"
  },
  {
    "Program": "Support for Organizations",
    "Cycle": "SO 2025",
    "Round": "",
    "Name": "TBA",
    "Discipline": "",
    "AwardAmount": "",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Check back later for SO 2025 grantees!"
  },
  {
    "Program": "Support for Artists and Creative Individuals",
    "Cycle": "SACI 2025",
    "Round": "",
    "Name": "TBA",
    "Discipline": "",
    "AwardAmount": "",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Check back later for SACI 2025 grantees!"
  },
  {
    "Program": "Festival",
    "Cycle": "FG 2025",
    "Round": "",
    "Name": "TBA",
    "Discipline": "",
    "AwardAmount": "",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "Check back later for Festival 2025 grantees!"
  }
]
