[
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "Contemporary Arts Museum Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/theCAMH",
    "InstagramURL": "https://www.instagram.com/camhouston",
    "WebsiteURL": "https://camh.org",
    "Summary": "From September 16-19, 2024, Contemporary Arts Museum Houston (CAMH), Houston Freedmen's Town Conservancy (HFTC), and artist Theaster Gates will host Houston's edition of the renowned Black Artists Retreat (B.A.R), focused on the radical concept of \"Black Land Ownership and Space: Black Stabilization and Determination.\" Over four days, the convening will present speakers, panelists, and experts from Houston and across the country, bringing together, elevating, and inspiring the brain trust in local Black and BIPOC artists, creatives, and intellectuals. With programming in Houston Freedmen's Town, POST Houston, and CAMH, B.A.R.  has the potential to generate paradigm-shifting frameworks."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "DACAMERA",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/dacamera",
    "InstagramURL": "https://www.instagram.com/dacamerahouston/",
    "WebsiteURL": "https://www.dacamera.com",
    "Summary": "In 2024-25, DACAMERA will embark on a new partnership with the recently restored Eldorado Ballroom in Houston's Third Ward. The focus of this collaboration is the \"DACAMERA At The Eldorado: Rising Jazz Stars\" concert series featuring up-and-coming jazz artists from around the country, providing a new opportunity for Houstonians to experience the next generation of outstanding jazz talent. This series will include eight concerts falling on Sunday afternoons from October 2024 - May 2025, dates TBA. All concerts will be offered as pay-what-you-can, all-ages concerts."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "Dance Afrikana",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/danceafrikanahouston",
    "InstagramURL": "https://www.instagram.com/danceafrikana/",
    "WebsiteURL": "http://danceafrikana.com/",
    "Summary": "An extension of the Black Dance in Texas research project by Dance Afrikana's founder and Scholar-in-Residence for Rice University's CERCL Program at the African American History Research Center Gregory Campus, Black Dance in Texas is a multidisciplinary project around documenting the tradition of Black dance in Texas. This project includes a curated exhibition, digital dance archive, and book."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "Group Acorde",
    "Discipline": "Performing Arts",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://facebook.com/groupacorde",
    "InstagramURL": "https://instagram.com/groupacorde",
    "WebsiteURL": "https://www.groupacorde.org",
    "Summary": "Group Acorde will premiere Batimento Cardiaco, a new work that depicts Houstonian's mental health before, during and after a natural disaster occurs.  This work will be a collaboration between 4-7 musicians, two contemporary dance choreographers and a visual artist in an interdisciplinary work presented on October 3rd and 4th, 7:30pm at MATCHbox 2.  The company will host a free studio open rehearsal also livestreamed on the company's social media platforms prior to the premiere. Performances will feature all artists, and a visual set and costumes made of recyclable materials live on stage followed by an open discussion with the audience."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "Lance Flowers",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://facebook.com/LanceFlowers",
    "InstagramURL": "https://instagram.com/hoganbrownart",
    "WebsiteURL": "https://www.hoganbrowngallery.com/",
    "Summary": "Take Me As I Am, is a solo exhibit featuring the work of multidisciplinary artist Lance Flowers. The exhibit will take place simultaneously at the Hogan Brown Gallery in Houston, TX and Yale University's Institute For Sacred Music. The Yale portion has obtained its own independent funding. This exhibit will feature new works highlighting Third Ward and its community through a series of mixed media works. The materials used will be gathered from the entirety of Third Ward. This exhibit will be curated by gallery director Robert Hodge and feature 2d works, videography, music, and photography highlighting Third Ward residents."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "Norma Jo Thomas",
    "Discipline": "Theater",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/NormaT TV",
    "InstagramURL": "https://www.instagram.com/NormaT.xyz",
    "WebsiteURL": "",
    "Summary": "An original musical theatre production by Norma J. Thomas, \"Carol of the Bells\", to be performed at the C. Lee Turner Performing Arts Center on December 14, 2024. Building upon Norma's tradition of bringing Winter Holiday productions to the community, \"Carol of the Bells\" has its world premiere as part of an Acres Homes community  collaborative to fill the month of December with artistic and cultural holiday offerings."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "One Sample Cultural Foundation",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/onesampleculturalfoundation/",
    "WebsiteURL": "http://osculturalfoundation.org",
    "Summary": "Ethnography of Afro-Venezuelan Music is a multidisciplinary educational conference that includes videos, music and dance, which explores the syncretism of African culture and European religious practices in Venezuela through music. The project aims to strengthen ties between the African American and Venezuelan communities and promote a dynamic cultural exchange. This free educational-cultural activity for the general public, which will take place at the Institute of Hispanic Culture of Houston (10/10/2024) and Teatro Bilingue de Houston (04/13/2025)."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "SoulSista Art Foundation",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/soulsistafestival/",
    "WebsiteURL": "",
    "Summary": "The public presentation will be held at Houston Warehouse Studio (1506 Lorraine St, HTX) with a capacity of about 2000. There will be a two-hour conference highlighting Houston's contributions to the new music business. This will be presented in the studio room and will be followed by performances from selected poets and Afrobeats artists who have been recognized over the years in Houston. This event is scheduled for November 11th 2024 from 12pm to 6pm. The event will be open to the general public for free, donations will be accepted. We will also have food-trucks and djs."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "The Pilot Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/PilotDanceProject",
    "InstagramURL": "https://www.instagram.com/thepilotdanceproject",
    "WebsiteURL": "https://www.pilotdanceproject.org/",
    "Summary": "Loteria is an original dance work by celebrated Houston-based choreographer, Cynthia Garcia. Loteria brings to life the characters of the traditional Mexican board game, which is similar to bingo. In an urban landscape of constant gentrification, often times cultural signifiers, customs, and traditions are left behind to illustrate the legacies of cultural communities. The dances of Loteria will be presented at two major cultural events in gentrified neighborhoods that have histories as Mexican and Mexican American neighborhoods: MECA's Day of the Dead Festival in Sixth Ward (October 2024), and the MD Anderson YMCA's annual posada in Near Northside (December 2024)."
  },
  {
    "Program": "City's Initiative",
    "Cycle": "CI 2024 - Round 1",
    "Name": "University of Houston Foundation",
    "Discipline": "Music",
    "AwardAmount": "$10,000.00",
    "FacebookURL": "https://www.facebook.com/uhdowntown",
    "InstagramURL": "https://www.instagram.com/uhdofficial",
    "WebsiteURL": "https://universityofhoustonfoundation.org/",
    "Summary": "The Terence Blanchard concert will engage the community from Third Ward and Downtown Houston in a series of events with 7 time Grammy winning artist Terence Blanchard. \nIn addition to performing a concert, Blanchard will collaborate with University of Houston and University of Houston-Downtown students.\nThe performance will be November 7th, 8th, or 10th at either the Wortham Theater or at UH Moores School of Music. \nThere will also be a fireside chat / workshop as part of the visit."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "aisha tida",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,000.00",
    "FacebookURL": "https://facebook.com/avaishashley",
    "InstagramURL": "https://www.instagram.com/aishanotaiiisha",
    "WebsiteURL": "https://aishatida.cargo.site",
    "Summary": "PUSH/PULL is a transdisciplinary exhibition project featuring works by aisha tida, Leila Mnekbi, Eliot Gray Fisher and EG Gionfriddo (ARCOS Dance). The free, public exhibition takes place at Box13 ArtSpace September 7-October 5, 2024 (opening September 6, 6-9pm) and centers intimate interactive performances. Visitors' visceral reactions to aisha tida's quilted installation feed into interactive embodied movement and live audio performances by ARCOS and Leila Mnekbi. Guided by the performers, audience-participants explore notions of authorship and agency while questioning the world we live in, the definitions and patterns we accept, and the loops and illusions we wish to escape."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Anastasia Kirages",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/k.llages/?hl=en",
    "WebsiteURL": "https://msha.ke/k.llages/",
    "Summary": "I plan to debut a zine called Catorce, Chiquinina!, inspired by family photographs of my mother's side, at Zine Fest Houston this fall on Saturday, November 16 from 12-6 PM at The Orange Show Center for Visionary Art. Collage work featured in the zine will be made during the summer at El Sur, an artist residency in Mexico City. Growing up, I have felt somewhat disconnected from the Hispanic community, even though I had a close relationship with my maternal grandparents, speak Spanish and live in Texas, so this zine will be an extended exploration of my cultural identity."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Anne Park",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "https://anneparkart.wixsite.com/anne-park",
    "Summary": "Minhwa is Korean folk art from the 19th century with the direct translation of people's (min) painting (hwa), which encapsulates unique Korean history and its people. My goal is to promulgate Minhwa and develop a new interpretation as a contemporary art. I would like to develop a comprehensive website and provide in-person presentations working first with Asia Society and Korean-American Society of Houston (KASH) with open public schedules for Summer/Fall sessions. I also would like to submit open-call proposals for exhibitions where I plan to conduct an artist's talk to facilitate a deeper understanding of Minhwa."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Asia Society Texas",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/asiasocietytexas",
    "InstagramURL": "https://www.instagram.com/asiasocietytx",
    "WebsiteURL": "https://asiasociety.org/texas",
    "Summary": "On September 28th, Asia Society Texas (AST) graciously invites Houston-based chamber music group Kinetic to take to the stage. Starting at 7:30 pm, the group will transform our versatile Education Center into an educational concerto with the aid of four acclaimed Turkish-based musicians: Erberk Eryilmaz, Sinan Ayyildiz, Bugra Kutbay, and Ali Can Oztan. The anticipated performance will be an introspective collaboration that pushes the boundaries of traditional and contemporary Turkish music as the musicians meld together Turkish and Western classical instruments into transcontinental harmony. Between pieces, there will be spoken presentations discussing the music's origin and instruments with the audience."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Ayanna Allen",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/MindofAMEA",
    "WebsiteURL": "https://AMEAMusic.com",
    "Summary": "An immersive Afrofuturistic experience to soothe all the senses - AMEA's \"Agenda's\" take us on a pursuit of Joy, Love, and Peace through sharing tools for supporting our nervous systems along the way the Fall of 2024. The mission is to meet the \"Lady on the Hill\" - Featuring local visual imaginings of the future human experience through installations to VR - You and your friends will be guided through a lush hike exploring the terrain of joy, love and ultimately meeting up in community for peaceful sounds curated by AMEA especially for you."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Babatunde",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/BabatundeOgunseinde",
    "InstagramURL": "https://instagram.com/babatunde140",
    "WebsiteURL": "",
    "Summary": "Rhythms and Canvas is an interactive and multidisciplinary experience that immerses attendees in traditional. modern and contemporary international art. Part art exhibit, part musical concert, part social gathering, Rhythms and Canvas does just what the name suggests. It brings the community together to celebrate and experience visual, performance, and musical art rooted in the local and diasporic cultures and experiences."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Beguiled Theatre Company",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/BeguiledTheatre",
    "InstagramURL": "https://www.instagram.com/beguiledtheatre",
    "WebsiteURL": "https://beguiledtheatre.com",
    "Summary": "Beguiled Theatre Company will be presenting John Faust's critically acclaimed play of \"Night of the Living Dead\" at the MATCH in Houston. Dates are TBD (in 2024 or early 2025), pending funding."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Bharathi Kalai Manram",
    "Discipline": "Art + Social Practice",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/bharathikalaimanram.bkm",
    "InstagramURL": "",
    "WebsiteURL": "http://bkmhouston.org/",
    "Summary": "This proposal is for a unique and new event \"Malargale\" - Indian Floral Art Exhibit and Live Demo on September 15, 2024, from 2-5pm at India House (8888 West Bellfort Ave, Houston, TX 77031). This exhibit will showcase the rich tradition of the unique Indian floral art while educating and engaging the community on how flowers play important role in day-to-day life, festivals, and special occasions. The proposal includes: Art exhibits created with fresh, dried, and artificial flowers; and Live demonstration to showcase creative models of garland making and varieties of flower threading activities exhibiting fine motor skills."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Carl Calloway Jr.",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://instagram.com/Cdc_14",
    "WebsiteURL": "https://callowaysphotography.mypixieset.com/",
    "Summary": "For my upcoming public presentation, I've opted to collaborate with Project Row House, a non-profit situated in Houston's Historic Third Ward, one of the city's oldest African-American neighborhood's. We plan to utilize their venue for screening the inaugural episode of our mini-series in mid to late September, scheduled for 6:00-8:00 PM. By teaming up with this esteemed art organization, strategically positioned in the heart of Houston, we aim to attract a diverse and sizable audience from the local community. The event will be ticketed and half of the proceeds will be given to Project Row House to support their efforts."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Dance Afrikana",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/danceafrikanahouston",
    "InstagramURL": "https://www.instagram.com/danceafrikana/",
    "WebsiteURL": "http://danceafrikana.com/",
    "Summary": "Zydeco in the Park is a project which will bring Zydeco dance and music to Discovery Green Park. Zydeco is a traditional Louisiana Creole dance and musical form from Southwest Louisiana and Southeast Texas, with African roots. It will feature a zydeco dance workshop and performance led by Dance Afrikana along with a live zydeco band, Zydeco Fenm."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Diamond Ashman",
    "Discipline": "Public Art",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/cultured.concepts",
    "InstagramURL": "https://instagram.com/cultured.concepts",
    "WebsiteURL": "https://www.cultured-concepts.com",
    "Summary": "Levels is an interactive Public Art experience for all ages and audiences that reframes the view of Street Art and Murals. Introducing the audience to the culture of Graffiti and the impact of Public Art. This event will attract audiences from all over with the unveiling of a hidden Houston gem. Located in Downtown Houston, this underground mecca of Art will host live Art, vendors and fun! A Mural Workshop will be available for all ages for those who would like to participate. Workshop will inform participants about mural creation process, site preparation and project execution."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "EMBER SKEYEZ",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/EMBERSKEYEZ",
    "InstagramURL": "https://instagram.com/EMBERSKEYEZ",
    "WebsiteURL": "",
    "Summary": "This project documents new music artists in developing an album from conception to production and finally performance.  The audience will witness the depth of collaborative efforts that go into creating not only music but also an accompanying performance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "George Heathco",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/georgeheathco/",
    "WebsiteURL": "https://georgeheathco.com/",
    "Summary": "Composer George Heathco and choreographer Toni Valle look to present \"make/SHIFT,\" integrating contemporary and aerial dance, chamber music, and video projections, where the roles of each will bind, blend, and blur into one another, to seamlessly interact in both visual and acoustic space, including: chamber musicians on stage serving as living and mobile set pieces, dancers becoming musicians supplying extra sonic content, and video projections redefining the space and complementing the live performance. The 30-minute work will be performed twice in January of 2025, serving as a workshop for a longer, more substantial future piece, slated for November 2025."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Group Acorde",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/groupacorde",
    "InstagramURL": "https://instagram.com/groupacorde",
    "WebsiteURL": "https://www.groupacorde.org",
    "Summary": "InWorks is a series of intimate experimental works that challenge two musicians and two dancers to communicate through set and improvisational material live in the moment. This series includes duets, solos and trios that highlight how each artist communicates with each other using contemporary choreography and music from instruments such as cello, upright bass and voice. This is set to premiere as part of Houston MetDance's residency program performances on August 2nd and 3rd at their studios in midtown Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "HOPERA",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/profile.php?id=61552118362074",
    "InstagramURL": "https://www.instagram.com/hoperahtx/",
    "WebsiteURL": "https://www.hoperahtx.com",
    "Summary": "HOPERA is producing 2 diverse concerts exclusively featuring local artists performing hourlong classical and operatic music programs as part of our Pint-Sized Performance series. Each concert will be presented free to the public at local craft breweries 8th Wonder and Eureka Heights. The first concert is a presentation of Boleros music September 2024 celebrating National Hispanic Heritage Month, and the second is an operatic duets program celebrating Valentine's Day 2025 with a curated pairing of beer with music. These performances are designed to benefit local musicians and encourage commerce at local small businesses while enriching the greater Houston community."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Houston Brass Band",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/Houstonbrassband",
    "InstagramURL": "https://instagram.com/houstonbrassband",
    "WebsiteURL": "https://houstonbrassband.org/",
    "Summary": "The Houston Brass Band, a local community ensemble, performs music based on the British brass band genre. We will perform the soundtrack to the move The Snowman at the Houston Public Library Winter Festival on the 7th December. This free event is designed as a community outreach in conjunction with the Houston Public Library, experience for families and children during the holiday season. The award-winning animated movie tells the story of a boy who builds a snowman that comes to life, which begins a magical adventure."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Isabella Vik",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/Isabella.v___",
    "WebsiteURL": "",
    "Summary": "Human Resource is a 25 minute contemporary dance and performance piece that parallels the effects of emotional regression through a corporate office setting, finding comradeship through vigorous technical partner work and an emphasize on femininity as survival. Initially created for film, the project will be available to audiences both online and in person, with a preview showing at Mind The Gap September 10th. The film will be produced and co-directed with David Nguyen and performed by Isabella Vik's Aufheben Ensemble."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Jesus Cantu Medel",
    "Discipline": "Multimedia",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/tizoc1233/",
    "WebsiteURL": "",
    "Summary": "The culmination of this project will be a guided virtual tour of lesser known site of cultural or artistic significance around the city of Houston. Relevant interview clips will be played throughout, and the floor will be open to questions before moving on from each virtual location. This event will take place Saturday 12/14/24, online, via Zoom, where it will be freely accessible to anyone interested. It will also be recorded and posted to Youtube for anyone not able to attend."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "John P. McGovern Museum of Health & Medical Science",
    "Discipline": "Visual Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/thehealthmuseum",
    "InstagramURL": "https://instagram.com/thehealthmuseum",
    "WebsiteURL": "https://www.thehealthmuseum.org",
    "Summary": "From October 24-26, The Health Museum will host artist Sayaka Ganz from \"Reclaimed Creations\" to engage the public with dialogues around the transformative powers of recycled plastics and how it can affect our health individually and within the larger environment. Our programming includes an artist talk, exhibition preview reception, and a public arts recycling activity for opening day. Through these hands-on activities and discussions, we aim to foster environmental consciousness and highlight the interconnectedness of human health, animal health, and the environment. Your support will help us empower healthier living in the community, using arts as the catalyst for change."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Levante Piano Duo",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/LevantePianoDuo?mibextid=LQQJ4d&rdid=cwqdWCZBa5aLTyNc",
    "InstagramURL": "https://www.instagram.com/levantepianoduo?igsh=MW8zbDJpMnQyZHc4aw==",
    "WebsiteURL": "",
    "Summary": "Recognizing that human relations often take a backseat in an era dominated by technology, a novel project emerges -- one that harnesses the power of music and explores the essence of human connection against the evolving tide of technology. Levante Piano Duo, a Houston-based piano 4-hands ensemble, presents \"Resonance: Rediscovering the Human in a Digital Age,\" a concert program that encourages human-centered musical interactions in a tech-driven world. At MATCH, (March 2025): Exact time and date, TBA according to venue availability."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Lovett Theater",
    "Discipline": "Theater",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/lovett_theater",
    "WebsiteURL": "",
    "Summary": "Rice University's student-created and run Lovett Residential College Theater has been revived with a production of Into the Woods! Performances will be on November 7-9 at 8:30 and a 2:30 matinee also on November 9th. Shows will take place in Lovett College Upper Commons, a common student space that will be open to the larger public."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Magnolia City Brass Band",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/magnoliacitybrassband",
    "InstagramURL": "https://www.instagram.com/magnoliacitybrassband",
    "WebsiteURL": "https://www.MagnoliaCityBB.org",
    "Summary": "For this project, \"Women of the Brass Band World\" the Magnolia City Brass Band will perform a concert made up of works written by female composers or works that feature female soloists. This project will alleviate the underrepresentation of female composers in the brass band repertoire while recognizing the outstanding female brass musicians that we have in our own Houston arts community. This concert will be performed as part of our 2024-2025 concert season at a centrally located venue in the Houston area."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "MUSIQA",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/musiqahouston",
    "InstagramURL": "https://www.instagram.com/musiqahouston/",
    "WebsiteURL": "https://www.musiqa.org",
    "Summary": "Utilizing interview materials from the Houston Asian American Archive, three young composers from Houston -- Victor Cui, Ethan Soledad, and Tien Qin -- share vivid musical stories about Nathalie Roff, Angela Cheng, and Cookie Joe, respectively. This unique and innovative program highlights their immigrant experiences and triumphs in Houston. On October 3, 2024 Musiqa will present the world premiere of these works at The Asia Society Texas Center."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Norma Jo Thomas",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/NormaT TV",
    "InstagramURL": "https://www.instagram.com/NormaT.xyz",
    "WebsiteURL": "",
    "Summary": "It's not Supercuts in the local mall; it's Joe's, in the hood. So, what happens when REgentrification comes to Joe's barbershop? \"Shop Talk, the movie\" is a short, comedic film shot entirely on smartphone, on location at Joe's Barbershop, in Acres Homes. To be shot and finished August - September 2024, it will be screened in person and virtually, October - December, at events and locations including Saturday Night at the Movies, an outdoor film fest at the Acres Homes Chamber of Commerce, the Buy Black Marketplace at the Shrine Cultural & Event Center, and the Acres Homes Tree Lighting Reception, December 7th."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "PPL PXRTY ENTERTAINMENT",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/pplpxrtyent",
    "InstagramURL": "https://instagram.com/pplpxrtyent",
    "WebsiteURL": "",
    "Summary": "PPL PXRTY ENT. is launching a web and app based radio station, PPL PXRTY Radio, this winter on December 28th, 2024. Our team will introduce the Houston DJs, hosts, and podcasters joining our station, as well as PPL PXRTY's very own show on the station, which will be socially engaging with Houston creatives. We will utilize a small venue for a live, virtual event that allows us to interact with our audience and capture promotional footage. Our goal is to create marketing content for all parties involved and collectively promote to reach 5,000 listeners monthly within the first year."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Raul Orlando Edwards",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/raulorlandoedwards",
    "InstagramURL": "https://instagram.com/raulorlandoedwards",
    "WebsiteURL": "https://www.raulorlandoedwards.com",
    "Summary": "Flavors of Culture is a presentation that brings together performing arts (music and dance), visual arts and cuisine into one. Music, dance and visual arts are widely celebrated and here we bring cuisine to the forefront to showcase and inform, of the deep relationship that exists between these four. A public presentation that includes food samples, dance and music performances and visual art exhibit and historical background on how these four work in cultures from around the world that are found in Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Samskriti",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/IndianPerformingArtsSamskriti",
    "InstagramURL": "https://www.instagram.com/samskriti_tx",
    "WebsiteURL": "https://www.samskritihouston.org",
    "Summary": "Indian Performing Arts Samskriti proudly brings together the vibrant dance and music traditions of India, Indonesia, and Sri Lanka in \"TO A DIFFERENT BEAT.\" Witness professional BIPOC artists seamlessly intertwine their art forms, showcasing both their unique characteristics and the surprising commonalities that bind them together. Through colorful costumes, dynamic movements, and captivating rhythms, our performers will transport you on a mesmerizing journey across cultures, erasing boundaries and celebrating the beauty of diversity where art transcends barriers and unites hearts. Join us at the MIX-MATCH festival on Saturday, January 18, 2025 from 11am-11pm at MATCH Theatre in Houston."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Sarah Sudhoff",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/sarah.sudhoff.7",
    "InstagramURL": "https://www.instagram.com/sarahsudhoff",
    "WebsiteURL": "https://www.sarahsudhoff.com",
    "Summary": "A two part multidisciplinary project, \"A Fading Union\" continues to survey the alarming increase in exposure to gun violence in the USA through photography, performance, and sculpture. Iconographically, the work appropriates the American flag and that image continues to naturally deepen and evolve as I install or employ it over time. Part one includes the development of a kinetic flag lowering sculpture. Part two features a three channel video and performance with flags. Both new works utilize a 3 x 5 foot solid red American flag that undergoes a series of transformations into water, black dye, and bleach."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Scriptwriters Houston",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/scriptwriters-Houston",
    "InstagramURL": "",
    "WebsiteURL": "https://www.scriptwriters-houston.org",
    "Summary": "The 10x10 Play Festival is the call for playwrights to submit their ten-minute play script. Ten are chosen from all submissions. A call is made for ten directors to direct those ten plays. Auditions are held for actors to perform in those plays. We partner with a local theatre to have those plays performed. One of the guidelines is that all of this has to be done by local Houston artist. The festival will be August 22, 23 & 24 at Theatre Suburbia, 5201 Mitchelldale, Houston  77092"
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Silambam Houston",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/silambamhouston",
    "InstagramURL": "https://www.instagram.com/silambamhouston",
    "WebsiteURL": "https://www.silambamhouston.org/",
    "Summary": "Curated and presented by Silambam Houston, the YUVA Festival is the only platform of its kind in Houston - a unique Indian arts residency that catalyzes creative collaboration among emerging talented artists of all genres and disciplines of Indian classical arts, both local and from across the country, and encourages them to 'find their artistic voice'. YUVA artists, selected from an applicant pool, are provided resources (space, time, mentoring, and funding) to create new collaborative artistic works for presentation at the YUVA Festival in September."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "SKEYEZ N STARZ",
    "Discipline": "Multidisciplinary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/SKEYEZNSTARZ",
    "InstagramURL": "https://www.instagram.com/skeyez_n_starz/",
    "WebsiteURL": "https://www.skeyeznstarz.org",
    "Summary": "Stanzas and Stand Up is a show that blends the rhythm of poetry and spoken word with satire and humor.  This unique approach allows for cross exposure to different facets of Houston's creative community including Poetry, Comedy, and Theater. The shows structure include performance segments that follow specific topics and deliver an entertaining combination of skills to promote the talent of the performers and artistic engagment for the audience."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Space City Medievalism",
    "Discipline": "Literary",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "",
    "WebsiteURL": "",
    "Summary": "On Friday April 11th, 2025, we will host a public reading at The Menil Collection celebrating poetry created through the yearlong program Space City Medievalism, sponsored by the Medieval Academy of America and the University of Houston. Space City Medievalism is a series of events that stage encounters between contemporary poets and medieval literature in Houston, TX. We will invite a keynote speaker who uses the medieval in their poetic and critical craft. The other readers will include graduate students at the University of Houston and established poets from the Houston area, including francine harris and Roberto Tejada."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "The Alta Arts",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thealtaarts",
    "InstagramURL": "https://www.instagram.com/thealtaarts/",
    "WebsiteURL": "https://www.thealtaarts.org",
    "Summary": "Alta Arts Presents: ElevateHer -- a groundbreaking 2-day event on October 15th & 16th, 2024, where innovation meets inspiration. ElevateHer isn't just an event; it's a movement reshaping the artistic landscape. Through storytelling, creative expression, and the diverse experiences of women artists, we're redefining boundaries and sparking conversations that matter."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "The Biggest Brandon",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "",
    "InstagramURL": "https://www.instagram.com/thebiggestbrandon/?hl=en",
    "WebsiteURL": "",
    "Summary": "The Biggest Brandon embarks on a new chapter in his series, spotlighting black-owned art galleries across Houston through an exploration of identity and a rejuvenation of black masculinity/femininity. With his trademark fusion of classical music, jazz, R&B, and hip-hop, The Biggest Brandon will host and perform Volume 2 of his acclaimed concert series, \"Lost,\" in the fall and winter months from September 2024 to February 2025. His mission is to showcase one of Houston's premier black-owned art gallery spaces while collaborating with top-tier musicians in this esteemed artistic environment."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "The Pilot Dance Project",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/PilotDanceProject",
    "InstagramURL": "https://www.instagram.com/thepilotdanceproject",
    "WebsiteURL": "https://www.pilotdanceproject.org/",
    "Summary": "Houston-based choreographer Adam Castaneda will collaborate with acclaimed Houston-based musician Anthony Alemendarez to create \"Purple Bromeliads,\" a new dance work accompanied by an original composition. \"Purple Bromeliads,\" a work for nine dancers, is inspired by the the science fiction writing of N.K. Jemisin and is concerned with the warming of the planet and how communities rally together to support individual members in times of imminent danger. The work will be presented at a major festival in 2024, and will feature original costume design by Ashley Horn and visual art projections by Andre Amaral."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "The Positive Project Playahz InSpirational Theatre Arts Company",
    "Discipline": "Performing Arts",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/thepositiveproject",
    "InstagramURL": "https://instagram.com/williealston",
    "WebsiteURL": "https://www.playahz.org",
    "Summary": "A compilation of scenarios, performed by some of Houston's most prolific community artists, \"At The End of The Day\" is based on the hit stage-play \"Can't We All Just Get Along?\" in association with The Positive Project \"Playahz\" and Essence Entertainment. To be performed on Jan. 24th-25th at The Match Theater Downtown Houston. The story illustrates increases in neighborhood crime and what the Houston community can do about it. \"Silence Da Violence, Increase Da Peace\", a recurring theme, activates young and old alike to step up, step outside and be vigilant about our surroundings, working to safeguard our neighborhoods."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Thomas Helton",
    "Discipline": "Music",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/thomasheltonbass",
    "InstagramURL": "https://instagram.com/thomasheltonbass",
    "WebsiteURL": "https://www.thomashelton.org",
    "Summary": "I want to compose music for a silent film from the 1920's. I want to use a 1920's style jazz band. This piece will be presented April of 2025 in a park or public space and free to the public."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "Uptown Dance Company",
    "Discipline": "Dance",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://facebook.com/UptownDanceCompany",
    "InstagramURL": "https://instagram.com/uptown_dance",
    "WebsiteURL": "https://uptowndance.org",
    "Summary": "Uptown's 25th Anniversary Kickoff is a triple bill performance event at Uptown's Outdoor Theatre, August 24,2024.  Andre Silva, a Brazilian born professional dancer at Texas Ballet Theater, Lenard Lopez, a Hispanic choreographer and dancer and Beth Gulledge-Brown, an American choreographer and dancer trained in Cape Town South Africa.  Each choreographer will create international premier works for these performances. This is a free event that will showcase the works by these choreographers and a celebration of 25 years of dance."
  },
  {
    "Program": "Let Creativity Happen",
    "Cycle": "LCH 2024 - Round 1",
    "Name": "YUNGCHRIS",
    "Discipline": "Film",
    "AwardAmount": "$2,500.00",
    "FacebookURL": "https://www.facebook.com/mrnternational.hk",
    "InstagramURL": "https://www.instagram.com/yungchrishk/",
    "WebsiteURL": "",
    "Summary": "Hi, my name is YUNGCHRIS. As a multidisciplinary artist, I create unique works of art in various sizes and produce dance productions and events all over the city. Currently, I am in the process of producing an independent film called TipToe Thomas, which I am both starring in and directing. The film is set to premiere this year and is centered around a character I created named TipToe Thomas. Through the art of mime, TipToe Thomas expresses himself through dance, inspired by the legendary Marcel Marceau. The premiere is set for November 16th, 2024."
  }
]
